{
    "name": "Dragon Palace",
    "CardType": "Event",
    "CardLimit": "0",
    "Description": "Visit Cetuspeanna's home. Your lover is surely waiting for you at the altar island.",
    "requires": [ ""],
    "requiresEvent": [
                        {
                          "NameOfEvent": "Meet the Sea Dragon!",
                          "Progress": "-99",
                          "ChoiceNumber": "-1",
                          "Choice": ""
                        }
                      ],
    "Speakers": [
                  {
                    "name": "Cetuspeanna",
                    "postName": "",
                    "SpeakerType": "Monster"
                  }

                ],
    "EventText": [
                    {
                      "NameOfScene": "EventStart",
                      "theScene": [
                        "DenyInventory",
                        "ProgressEqualsOrGreater", "1", "RepeatVisits",
                        "SetProgress", "1",

                        "Cetuspeanna swims within the towering structure, easily slipping through the wide gateways.",
                        "Speaks", "I built it big so my friend could visit... She is huge.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Honestly, it feels too big to have it all to myself...",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "But maybe that will change now...?♥",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "She hugs you closer and starts swimming upwards, right above a large staircase. You're not sure why her house would have one, but it certainly looks grand.",
                        "After a few twists and turns, the two of you arrive in a large and very tall room. Cetuspeanna starts swimming upwards and, surprisingly enough, emerges from water!",
                        "On the water's surface, you are stunned to see a fairly large ship! It is taking up most of the underwater room, and appears large and sturdy enough to easily hold several Cettys.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "A little flashy, isn't it? Let me just climb up there, and we can finally get more comfortable...",
                        "ChangeBG", "../Mods/Beach/Images/deck.png",
                        "Cetuspeanna magically floats from the water and softly lands on the ship's deck. Disentangling you from the tentacles, she lovingly lowers you to the floor, giving you a moment to stretch your slightly stiff body...",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "RepeatVisits",
                      "theScene": [
                        "ChangeBG", "../Mods/Beach/Images/altar.png",
                        "You return to Cetuspeanna's island and sit down on the altar, waiting for your beloved dragon's arrival.",
                        "Seemingly waiting for you, Cetuspeanna soon emerges from the water.",
                        "DisplayCharacters", "1", "EndLoop",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "{ThePlayerName}.♥",
                        "Menu",
                          "Hang out at the altar.",
                          "Go to Cetty's home.",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "Hang out at the altar.",
                      "theScene": [
                        "JumpToEventThenScene", "Meet the Sea Dragon!", "MainHub"
                      ]
                    },
                    {
                      "NameOfScene": "Go to Cetty's home.",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Cetuspeanna beams at your suggestion and holds you close, surrounding you with the familiar shimmering shield.",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeBG", "../Mods/Beach/Images/surface.png",
                        "The now familiar trip from the altar to the subaqueous ship passes quickly, as the two of you flirt idly on the way...",
                        "ChangeBG", "../Mods/Beach/Images/underwater.png",
                        "...",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "MainHubHome",
                      "theScene": [
                        "ChangeBG", "../Mods/Beach/Images/deck.png",
                        "ChangeBGM", "../Mods/Beach/Music/PerituneMaterial_Whisper3_loop.mp3",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Menu",
                          "Talk.",
                          "Spar.",
                          "Intimacy.",
                          "Sex.",
                          "Leave.",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "Talk.",
                      "theScene": [
                        "Menu",
                          "RequiresChoice", "1", "",
                          "Your job...",
                          "The ship.",
                          "RequiresChoice", "2", "Hoard",
                          "Hoard?",
                          "RequiresChoice", "2", "HoardRepeat",
                          "Ask to see the hoard again.",
                          "Hobbies?",
                          "Huge friend?",
                          "Perfect wedding?",
                          "Done talking.",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "Your job...",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "Reminiscing",
                        "Speaks", "Huh? What about-",
                        "ChangeImageLayer", "Expression", "1", "Confus",
                        "Speaks", "Oh.",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "I planned to tell Mrs. Felicia that I quit because I found a boyfriend, but I forgot...",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "My mind was too full of... us.♥",
                        "You inquire if she's really planning to quit.",
                        "ChangeImageLayer", "Expression", "1", "Rules",
                        "Speaks", "Of course! I don't want to be entertaining other men when I need you and you alone.",
                        "You mention your own job and ask how she feels about that.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "You're the Godess's Chosen Champion, and I knew that from the start. I can't expect to have you all to myself, right?",
                        "You point out that it's not what you asked.",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "Umm... Okay, okay!",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "I find it... exciting to think of you going out there, overcoming hardships and becoming the strongest adventurer.",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Honestly, I don't know yet what kind of relationship I want in the long run...",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "Like if we were to get... m-married... Just the two of us sounds so good...",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "B-but for now I really don't mind if you find more girlfriends!",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "I'm sorry, I realize that sounds like it could become an issue in the future...",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "But I feel that is the best option right now... Really, I probably won't mind being a part of a harem...",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "A-anyway! Umm, could you tell Mrs. Felicia that I quit?",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "She's kinda scary, so that makes me a little anxious... I'll handle the papers and stuff later, just don't want to break her the news.",
                        "You nod, figuring you can do at least that much for your lovably cowardly Cetuspeanna.",
                        "SetChoice", "1", "TellCatMama",
                        "JumpToScene", "Talk."
                      ]
                    },
                    {
                      "NameOfScene": "The ship.",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "I found it sunken deep inside one of the ocean trenches about halfway to Fertilia.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "It took me about three days to raise it from there with my magic, then I had one of my bigger friends bring it here.",
                        "Speaks", "The vessel was mostly intact, sans a large hole in the bottom, and the mermaids offered to repair it.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Then a friend suggested we make a place where it could float... but underwater.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Sounds complicated, right? We even invited a Voltlin to design this room... She was excited at first, but later said it was impossible... At least, without magic.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Thankfully, I am pretty good at magic, so we got it to work. Now there is an enchantment on this room that prevents too much water from entering.",
                        "You point out that the entire affair sounds like a whole lot of trouble.",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "That is true. It was a... hobby project? I do realize it is not a very practical thing to have.",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "After the barrier went up and relations with humans became less... strained, I reported this ship to the adventurers' guild. They were very happy to receive some of the items I found inside that were still intact. Some documents in particular.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "I was even paid, and they also let me keep the ship itself to boot.♪",
                        "Speaks", "Oh, and now we have a nice secret place we can use to hang out together! See, it's getting some use even now.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "And it is also the place where I keep my... hoard.",
                        "SetChoice", "2", "Hoard",
                        "JumpToScene", "Talk."
                      ]
                    },
                    {
                      "NameOfScene": "Hoard?",
                      "theScene": [
                        "SetChoice", "2", "HoardRepeat",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Yes... Before I discovered I was actually a strange sea slug, I really considered myself a dragon. Hoarding was something I thought I had to do, as a part of my dragon identity.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Truth be told, I don't think it ever truly excited me, but I couldn't admit it to myself...",
                        "Speaks", "Later, I would give most of the hoard away. I prefer items being used, rather than simply being collected and gathering dust.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "So what remains now is just a pile of really odd items that nobody wanted... I don't really look at it often either.",
                        "You ask if she'll let you see it.",
                        "Speaks", "Umm... Sure. It's below the deck, so let's head inside...",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Cetty picks herself up and slithers towards the ship's stern. Standing right next to one of the doors, Cetuspeanna's grand body looks incomparably larger, and for a moment, you worry that she won't fit inside. To your surprise, she smoothly slips inside with her usual grace, with nary a struggle.",
                        "You follow her inside, descending deeper into the ship, and quickly arrive at a spacious room littered with display cases and stands. It looks a bit like a museum.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "It doesn't even look like much of a hoard... More of a collection, I suppose.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Feel free to look around and ask me if something catches your eye.",
                        "You take a look around. Most of the collection appears to be slightly peculiar but unremarkable items found in nature, but several pieces catch your attention...",
                        "JumpToScene", "HoardHub"
                      ]
                    },
                    {
                      "NameOfScene": "Ask to see the hoard again.",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Um... You're still curious about that? Well, let's go I suppose...",
                        "You follow her inside the ship, quickly arriving in her 'treasury' again.",
                        "JumpToScene", "HoardHub"
                      ]
                    },
                    {
                      "NameOfScene": "HoardHub",
                      "theScene": [
                      "ChangeImageLayer", "Base", "1", "Base",
                      "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Menu",
                          "Oddly-shaped metal object signed 'Voltlin Horn Machine'",
                          "Unsigned gemstone with something dark swirling inside.",
                          "A small hand mirror signed 'Mirror of no reflection'",
                          "An empty case signed 'Invisible dagger'",
                          "Ask about the magic items she used in combat.",
                          "Done looking.",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "Oddly-shaped metal object signed 'Voltlin Horn Machine'",
                      "theScene": [
                        "Speaks", "Ah, that one is very old and surprisingly advanced, according to a Voltlin who identified it. I found it on the ocean's floor, as most things here.",
                        "Cetty pulls the device from the case and shows it to you up close. The thing is shaped like a curled horn, stylized into a lightning. It is also badly scratched and dented, sporting several bite marks. Once you've gotten a good look, Cetty rotates a small handle on the side of the metal horn, and you see crackles of electricity forming around it.",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Here's what it does...",
                        "She gently taps one of her own horns with the device and...",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "Hurt",
                        "Speaks", "Kiiiiii!♥",
                        "...cries out in pleasure.",
                        "ChangeImageLayer", "Expression", "1", "HappyLewd",
                        "Speaks", "Oh, umm, sorry, wow...♥ I forgot that it feels quite... intense.♥",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Looking away bashfully, she puts the device back and closes the case's lid hurriedly.",
                        "Speaks", "Apparently, Voltlins used this to overcharge their horns. It also lets other horned races briefly wield electricity with their horns, but it doesn't work well with aquatic monsters who are naturally sensitive to electricity.",
                        "She says nothing else, still looking flushed and bashful, so you nod and turn your attention back to the 'hoard'.",
                        "SetChoice", "10", "ZapperExamined",
                        "JumpToScene", "HoardHub"
                      ]
                    },
                    {
                      "NameOfScene": "Unsigned gemstone with something dark swirling inside.",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "You approach the case for a closer look and Cetty slithers next to you in a hurry.",
                        "Speaks", "Ah, umm, make sure you don't touch it. It is... prickly.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "She opens the case and reverently picks the gemstone with tongs left next to it.",
                        "Speaks", "I found this thing inside a small chest in an underwater cave. I don't actually know what it is, but there is... someone inside. She spoke to me only twice, the first time being when I was trying to research the gem in more detail.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "The conversation was quite one-sided. She cursed and insulted me for at least twenty minutes before demanding that I... uh, leave her alone.",
                        "Speaks", "Let's not touch it at all... I don't want to be called a perpetually wet pervert snake again.",
                        "She carefully places the gem back and closes the lid, obviously careful not to bother whoever is inside.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "When I brought it up to a succubus friend, she mentioned this gem may have a succubus soul sealed inside it.",
                        "You ask whether she should be let out, but Cetuspeanna just shrugs.",
                        "Speaks", "Maybe. I even offered to, at a later date, but the only response I got was 'No'. That was the only other time she ever spoke to me. I haven't really tried talking to her since... And I figure she'd speak up now, if she wanted out.",
                        "You nod and step away from the supposedly potty-mouthed succubus soul, ready to examine the rest of collection.",
                        "JumpToScene", "HoardHub"
                      ]
                    },
                    {
                      "NameOfScene": "A small hand mirror signed 'Mirror of no reflection'",
                      "theScene": [
                        "Speaks", "That one's a little confusing. It's a mirror that refuses to reflect people.",
                        "She pulls out the mirror and points it at your face. True enough, you see the room behind you reflected on the shiny surface, but your own face is nowhere to be seen.",
                        "ChangeImageLayer", "Expression", "1", "Wistful",
                        "Speaks", "I got it as a gift from a vampire friend... I am not sure if this was a joke or she meant something by it, because she refused to explain the gesture.",
                        "She places the mirror back, quiet and still looking confused.",
                        "JumpToScene", "HoardHub"
                      ]
                    },
                    {
                      "NameOfScene": "An empty case signed 'Invisible dagger'",
                      "theScene": [
                        "You approach the case and peek inside, discovering a small pillow. There is a visible indentation on it, as if something hard was lying on top of the pillow. Cetty walks up next to you and swings opens the lid.",
                        "ChangeImageLayer", "Expression", "1", "Pout",
                        "Speaks", "I put the thing on a soft pillow so it would be possible to tell where it is... Before the barrier went up, I cut myself on it once.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "She picks up the invisible object and hands it to you. It feels weird to grab at thin air, but the cold handle placed in your hand feels very real.",
                        "Speaks", "This was a gift from the Nereid Matriarch...",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Apparently, she bought into the whole Goddess thing when her flock first moved here, and this was an... offering.",
                        "You trace a finger over the blade, measuring its length. It is quite long for a dagger, and unusually shaped. It appears to be more of a ritual instrument then a fighting weapon.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "It took a while to explain that I was not really a sea monster goddess... She would then spend days laughing about it and apologizing, but she told me to keep the dagger still.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "...All that, and now she calls me 'Little Cetty'... Even though I'm a bit older than her...",
                        "You place the dagger back with a wry smile and step back, turning your attention to rest of the hoard.",
                        "JumpToScene", "HoardHub"
                      ]
                    },
                    {
                      "NameOfScene": "Ask about the magic items she used in combat.",
                      "theScene": [
                        "She cocks her head in confusion at first, then seems to realize what you mean.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Ah, you mean like the dragonscale?",
                        "ChangeImageLayer", "Magic", "1", "Dragonscale",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "The glimmering scale appears in her hand, as if by magic. Probably by magic.",
                        "Speaks", "My sea serpent friend gave it to me. We think this is a real Sea Dragon's scale, but there's no way to make sure.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "ChangeImageLayer", "Magic", "1", "Dragonhorn",
                        "Speaks", "I also have this horn. I call it the dragon's horn too, but it probably isn't. It is seeping with dark demonic energy and likely belonged to an arch-succubus of old.",
                        "ChangeImageLayer", "Magic", "1", "MagicNone",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "They have powerful magical effects, so I use them in my spells.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Like I said, I don't keep the useful items in this collection...",
                        "JumpToScene", "HoardHub"
                      ]
                    },
                    {
                      "NameOfScene": "Done looking.",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Okay. Let's get back on deck then...",
                        "You respectively slither and walk back 'outside', where Cetty leans against the boat's rail, hands primly folded in her lap, watching you expectantly.",
                        "JumpToScene", "Talk."
                      ]
                    },
                    {
                      "NameOfScene": "Hobbies?",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Well... I don't think I have a consistent one.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Being so long-lived, and a bit of a loner by nature, I usually occupy myself with overly long and largely useless projects.",
                        "Speaks", "Such as building grand underwater palaces, repairing this ship, or spending a century trying to figure out my own species.",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "I guess that's not very relatable for a human, huh...?",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "...Ah, I suppose magical research can be considered a hobby? I've been doing that all my life.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Recently, I have been studying erotic magic that humans developed for sex-fighting. It is not quite the same as succubi magic, so I find it really fun to play around with it...",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "MildlyAroused",
                        "Speaks", "If you're interested, we could try some naughty new spells together...?♥",
                        "SetChoice", "7", "SexMagic",
                        "JumpToScene", "Talk."
                      ]
                    },
                    {
                      "NameOfScene": "Huge friend?",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Ah, yes. Her name is Ourania. She is an ancient sea turtle... And yes, she is very big. The size of a small island, I suppose.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "And she keeps growing. Very slowly at this point, but nonetheless.",
                        "You ask if it doesn't make life difficult for her, and Cetty nods thoughtfully.",
                        "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
                        "Speaks", "No doubt. She hasn't had a boyfriend in centuries, or so she told me. She is at least 300 years older than me.",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "And lovers aside, it even becomes difficult to simply hang out with friends. Even someone as large as me is fairly small in comparison, so the things we can do together are... limited.",
                        "JumpToScene", "Talk."
                      ]
                    },
                    {
                      "NameOfScene": "Perfect wedding?",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "MildlyAroused",
                        "Speaks", "{ThePlayerName}.♥ You can't just ask things like that to me...♥",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "But let's see...",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "First, it would happen at night - on a deserted island with very few people around. Only our closest friends would get to attend.",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Speaks", "Yes... definitely away from the mermaids...",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Next, I'd really want the union to be blessed by a real priestess of Venereae.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "I suppose I would have to carry one all the way to the island...",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Of course, my biggest fantasy is wearing a beautiful wedding gown.♥",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Us aquatic folk don't have much of a fashion culture, but I would really love to wear something really fancy for the occasion.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "You would be dressed as a blessed Hero, naturally.♥",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "I-if you're okay with that, of course!",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "I hope my fantasies don't sound too silly to you...",
                        "Menu",
                          "'Not at all.'",
                          "Strike a heroic pose.",
                          "'If it's just the closest friends...'",
                          "'I'd rather wear a suit.'",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "'Not at all.'",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Yay.♥",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Honestly, it's a little embarrassing to myself as well... but I can't help my preferences.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "And with a special, irreplacable moment like that... I wouldn't want to compromise on it.",
                        "JumpToScene", "Talk."
                      ]
                    },
                    {
                      "NameOfScene": "Strike a heroic pose.",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseFullBodyBlush",
                        "ChangeImageLayer", "Tits", "1", "",
                        "ChangeImageLayer", "ArmsBase", "1", "",
                        "ChangeImageLayer", "ArmsTop", "1", "",
                        "ChangeImageLayer", "Expression", "1", "Flustered",
                        "Speaks", "...!",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Tits", "1", "Titties",
                        "ChangeImageLayer", "ArmsBase", "1", "ArmsRest",
                        "ChangeImageLayer", "Expression", "1", "Rules",
                        "Speaks", "T-that's forbidden!",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "U-unless we can have sex on the spot...",
                        "JumpToScene", "Talk."
                      ]
                    },
                    {
                      "NameOfScene": "'If it's just the closest friends...'",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Yeah... After all it's a bit embarrassing, isn't it?",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "I'd be shy too... But I can't really help my preferences.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "And with a special, irreplaceable moment like that... I wouldn't want to compromise on it.",
                        "JumpToScene", "Talk."
                      ]
                    },
                    {
                      "NameOfScene": "'I'd rather wear a suit.'",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "PoutAvert",
                        "Speaks", "Nnn... I- I am not giving up!",
                        "ChangeImageLayer", "Expression", "1", "Pout",
                        "Speaks", "I'd be shy too... But I can't really help my preferences.",
                        "Speaks", "And with a special, irreplaceable moment like that... I don't want to compromise on it...",
                        "JumpToScene", "Talk."
                      ]
                    },
                    {
                      "NameOfScene": "Done talking.",
                      "theScene": [
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Spar.",
                      "theScene": [
                        "IfChoice", "3", "SparUnlocked", "StartSpar",
                        "SetChoice", "3", "SparUnlocked",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "We're still doing that? Being lovers and all?",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Well, I do think it is fun, so sure!",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "But... What do you think about a real fight? Without all the goddess roleplaying. Just Cetty.♥",
                        "Speaks", "I won't have my Mermaids and Nereids here after all. So if we spar, I'll be going all out.♥",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "StartSpar",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "Happy",
                        "As soon as you decide upon the fight, she breaks into a wide smile and retreats a few steps away excitedly.",
                        "ChangeBGM", "../Mods/Beach/Music/PerituneMaterial_Shizima2.mp3",
                        "Speaks", "Oh, this is going to be so fun!",
                        "CombatEncounter",
                        "RunningWontSkipEvent",
                        "NoRunning",
                        "CetuspeannaEXTRA",
                        "StartCombat",
                        "JumpToScene", "CetuspeannaBeatenSparLover"
                      ]
                    },
                    {
                      "NameOfScene": "CetuspeannaBeatenSparLover",
                      "theScene": [
                        "RemovePerkQuietly", "Ethereal Hands",
                        "DisplayCharacters", "1", "EndLoop",
                        "ChangeImageLayer", "Expression", "Happy",
                        "Speaks", "That was fun!",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "CetuspeannaLostSparLover",
                      "theScene": [
                        "RemovePerkQuietly", "Ethereal Hands",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "All of a sudden, Cetty lifts herself up before plopping down next to you, wrapping her arms around you and planting a long kiss on your cheek.",
                        "Speaks", "There, there... You've done well...♥",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Rest up... I wouldn't want you to go home right now... fufu...♥",
                        "PlayBlackOut",
                        "...",
                        "RestPlayer",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "EndBlackOut",
                        "You come to still in her embrace, possessively wrapped up in her tail's coils. Seeing you stir awake, Cetty plants another loving kiss on your cheek and giggles.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Good morning.♥",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "I hope you liked losing as much I liked winning...♥",
                        "You nod with a flush and slowly sit up, cock still feeling sore from all the pleasurable orgasms she's given you. Cetty sits up as well, clinging to your side affectionately, and rests your head on her shoulder...",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Back.",
                      "theScene": [
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Intimacy.",
                      "theScene": [
                        "IfChoice", "4", "IntimacySuggested", "IntimacyMenu",
                        "SetChoice", "4", "IntimacySuggested",

                        "ChangeImageLayer", "Base", "1", "BaseFullBodyBlush",
                        "ChangeImageLayer", "Tits", "1", "",
                        "ChangeImageLayer", "ArmsBase", "1", "",
                        "ChangeImageLayer", "ArmsTop", "1", "",
                        "ChangeImageLayer", "Expression", "1", "Tiny",
                        "Speaks", "...!",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "...",
                        "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
                        "Speaks", "Of course... We are dating now, after all, I shouldn't- Can't. I can't let my silly hangups keep getting in our way.",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Tits", "1", "Titties",
                        "ChangeImageLayer", "ArmsBase", "1", "ArmsRest",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "So... what do you have in mind?",
                        "JumpToScene", "IntimacyMenu"
                      ]
                    },
                    {
                      "NameOfScene": "IntimacyMenu",
                      "theScene": [
                        "Menu",
                          "Kiss her.(♥)",
                          "Ask to cuddle.",
                          "Give her a massage.",
                          "Brush her hair.",
                          "Back.",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "Kiss her.(♥)",
                      "theScene": [
                        "ChangeBGM", "music/Relaxing/BGM05_Azalea.mp3",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "MildlyAroused",
                        "As you lean closer, your large lover seems to catch up and lowers her face to your level, allowing you to place your hand on her chin softly. Her face flushes a light purple, lips parting in a sensual smile as you bring her face closer to yours.",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Her eyelashes flutter excitedly for a moment before she closes her eyes, leaning closer and closer. You feel her sweet breath on your lips, followed by her tentacles and arms coming to caress you. Your lips haven't touched yet, your mouths a mere inch away.",
                        "Your arm rests on Cetty's elbow, bringing her ever closer, desiring to feel her as close as possible. She giggles softly under her breath, her soft bosom bumping into your midsection.",
                        "Finally, as if unable to wait any longer, your lips start moving closer at the same time, and the next moment, they touch.",
                        "ChangeImageLayer", "Expression", "1", "Kissy",
                        "Softly at first, but as a spark of passion quickly finds its way into the kiss, the gentle gesture of affection turns into a smoldering hot and sloppy act of animal desire. Cetty moans as her forked tongue sneaks its way into your mouth, greedily seeking your own tongue.",
                        "Both of her hands rest on your cheeks as your tongues intertwine sloppily, showering one another in saliva and affection. Your lover tastes divine, a real sea goddess in the flesh, the sweet taste of her mouth permeating your senses. Her lips are sinfully soft, a delightful treat you want more and more of. But above all else, you enjoy her gentle and affectionate touches that convey nothing short of complete adoration.",
                        "Under the effect of the immense love and affection, you feel your head starting to spin from the overwhelming whirlpool of passion smoldering between you two. Her affectionate hands shift lower, caressing your chest as she breaks the kiss for a moment to catch some air.",
                        "ChangeImageLayer", "Expression", "1", "MildlyAroused",
                        "Speaks", "My beloved...♥",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "Kissy",
                        "A moment is all both of you need, and the kiss resumes again, sloppier and hornier than ever. Your cock can't help but spring to attention, poking conspicuously at the dragoness's toned tummy. Her hands shift lower, quickly wrapping their fingers around your rigid length.",
                        "ChangeImageLayer", "BikiniBottom", "1", "",
                        "Shifting her flexible lower body, Cetuspeanna slips out of her bikini bottoms and rests her serpentine butt on the side, presenting her pussy. Her great flexibility allowing her not to break the kiss, she uses your cock as a control stick to guide you lower, aligning your achingly hard shaft with her soft dragon slit.",
                        "You push forward, earning an adorable gasp from your dragoness as your cock enters her drooling pussy. Cetty's tentacles wrap around your waist and thighs, driving you deeper and deeper until you are hilted entirely inside of her.",
                        "Your kiss grows ever sloppier and more desperate, both of you unable to get your fill of each other. Her tentacles do not let go, keeping you inside and unmoving, leisurely enjoying the soft caresses and squeezes of her dragon pussy.",
                        "The passionate kissing had already made you quite aroused, and with her exquisite folds now pressing at your cock from all sides, you actually feel yourself coming dangerously close to cumming in such an impressively short time.",
                        "Speaks", "Want to kiss- mwah...♥ filling me up- mmm...♥ one- mwah♥ after- chu♥ another...♥",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Cetty suddenly breaks the kiss with an awkward laugh and apologizes.",
                        "Speaks", "S-sorry, I should be more coherent...♥ Um, I want to keep kissing as you're cumming inside, but without going too hard at it...♥",
                        "ChangeImageLayer", "Expression", "1", "MildlyAroused",
                        "Speaks", "So, umm, please cum?♥",
                        "ChangeImageLayer", "Expression", "1", "Kissy",
                        "PlayerOrgasmNoSpiritLoss",
                        "As soon as the kiss resumes, you unload deep inside your dragon lover, both for her pleasure and due to your own excitement surging from her naughty request. You moan into her mouth as your massive load fills her womb and Cetty shivers from delight, the pleasurable sensation only causing her to intensify the makeout session.",
                        "Her long tongue wraps around your own, sliding deeper into your mouth, completely dominating you with its serpentine size and flexibility. The dominant act only serves to excite you further, causing you to buck your hips and hug her ever tighter, feeling as if you'll never able to get your fill of your wonderful dragoness.",
                        "Another load spurts from your gently-squeezed dick, causing your lover to gasp softly and thrust her own hips, eager to meet your ejaculation.",
                        "ChangeImageLayer", "Expression", "1", "HappyLewd",
                        "The intense makeout session leaves both of you with little opportunity to breathe, but when you start feeling a little faint from the lack of air, Cetuspeanna breaks away, gasping heavily herself.",
                        "Speaks", "Haaa... Haa...♥",
                        "ChangeImageLayer", "Expression", "1", "NaughtyFace",
                        "Biting her mouth, she runs her fingers over your lips, still heaving. Her pussy has kept milking your dick softly all this time, and you feel your knees giving out as you blow another load into the dragoness.",
                        "ChangeImageLayer", "Expression", "1", "Kissy",
                        "Cetuspeanna supports your limp form in her arms, hugging and kissing you again as you collapse forward, needily ejaculating inside her again. Feeling incredibly drained from four consecutive orgasms, you only manage to lazily kiss her back, feeling the world around you grow dim...",
                        "...",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "ChangeImageLayer", "BikiniBottom", "1", "Base",
                        "You stir awake in your lover's embrace, lying face to face, wrapped in her slick coils on the ship's deck. Cetuspeanna smiles softly as she sees you wake and whispers softly.",
                        "Speaks", "Good morning, darling.♥",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Hehe... That got a little intense, huh?",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "I just can't help myself when kissing.♥",
                        "You smooch her again softly before moving to sit up. Cetty follows suit, a lingering smile on her lips as she sits across from you and takes your hands into her own.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Now, what should we do next?",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Ask to cuddle.",
                      "theScene": [
                        "ChangeBGM", "music/Relaxing/Tokimeki.mp3",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "...!♥",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Gladly...♥",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Before you get to do anything, her tail slithers around your thighs, grabbing you and bringing you closer to her upper body. Wrapping her arms around you, she falls softly to the side, cradling you in her embrace.",
                        "You are left face to face with her bosom, which jiggles alluringly mere inches away from your nose. Unexpectedly, she hugs you even closer, smothering you in her breasts!",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "Oh...",
                        "Just as suddenly, she lets go, freeing your face from the breastly prison and looking down at you apologetically.",
                        "Speaks", "S-sorry, I want to hold you really close but that's probably a little stuffy... Maybe you can face the other way?",
                        "Menu",
                          "'This was fine...(♥)'",
                          "Face the other way.",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "'This was fine...(♥)'",
                      "theScene": [
                        "ChangeBGM", "music/Loss/Do not yarn.mp3",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "NaughtyFace",
                        "Speaks", "I see...",
                        "ChangeImageLayer", "BikiniTop", "1", "",
                        "Untying her bikini top, she lets it fall to the ground, revealing her bare bosom in its full glory.",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "Cetuspeanna hugs you again, stuffing your face between her wonderfully soft tits. You nuzzle against them affectionately and feel her stroking the back of your head gently with her hand.",
                        "Speaks", "Naughty, naughty... Saying you wanted to cuddle then getting all cute and needy.♥",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "In response, you fumble a little, then wrap your lips around her nipple, earning a cute gasp from your big dragoness.",
                        "Speaks", "Nnh...♥",
                        "Her nipple is slightly salty from the sea water, and quickly grows stiff in your mouth. You flick the sensitive nub with your tongue and grab her large tit with both hands. The dragoness coos and moans, stroking your head encouragingly with her soft hands.",
                        "You begin sucking at the nipple strongly, eliciting a long, drawn out sigh of pleasure from Cetty. One of her hands shifts over yours, encouraging you to squeeze her sizable tit stronger.",
                        "Your cock springs to attention, trapping itself between your tightly-pressed bodies. Cetty's tentacles slither slowly between the two of you, eventually arriving at your crotch, playfully poking at your erection.",
                        "Still focused on her breasts, you knead and squeeze the welcoming flesh, reveling in the soft texture. Breaking away from her nipple, you raise your head and manage to bring the other one to your mouth next.",
                        "It is already incredibly stiff when you put it in your mouth, and you feel the playful tentacles getting frisky around your achingly hard cock.",
                        "ChangeImageLayer", "Expression", "1", "BigSucc",
                        "Speaks", "Ahhn...♥ Squeeze harder...♥",
                        "ChangeImageLayer", "Expression", "1", "MildlyAroused",
                        "You are happy to oblige and redouble your efforts, squeezing, bouncing, and kneading the delightfully soft orbs and sucking at her sensitive teat. Her slick tentacles bundle around your cock, stroking its sides and tip as much as they can.",
                        "You moan and buck your hips upwards, reveling at the sensation of her soft, smooth tummy and the naughty tentacles poking at your sensitive spots. Burying your face deeper into her tit, you bite at the nipple softly, causing Cetty to gasp in pleasure and hug you tighter again.",
                        "ChangeImageLayer", "Expression", "1", "BigSucc",
                        "Speaks", "Hyaah~♥ H-harder, bite it more!♥",
                        "ChangeImageLayer", "Expression", "1", "Oface",
                        "You nuzzle deeper into her sensitive bust and nibble on her stiff teat, harder this time, and are instantly rewarded by an orgasmic scream from your lover. With her entire body shaking, the tentacles start lashing wildly at your cock, bringing you to the edge of orgasm.",
                        "PlayerOrgasmNoSpiritLoss",
                        "As you needily hump the dragoness's stomach, your cock erupts, flooding the tight space between the two of you with a hot, sticky load of semen. Still attached firmly to her tits, you moan and gasp in pleasure, softly rubbing against her stomach as you're riding out the powerful orgasm.",
                        "ChangeImageLayer", "Expression", "1", "Torogao",
                        "As the last of your cum escapes your cock, you go limp, releasing the nipple in your mouth with a loud pop. Cetuspeanna also comes down from her orgasm, cooing softly and affectionately caressing you in her embrace.",
                        "Speaks", "Haaa...♥ That wasn't cuddling, but...♥",
                        "The two of you lay there for a moment, enjoying each other's touch and not minding the sticky mess between your bodies...",
                        "...",
                        "After a while, you disentangle from each other... To a degree, as Cetty's tail stays loosely but affectionately wrapped up around your legs even as she's wiping your cum from her stomach.",
                        "ChangeImageLayer", "BikiniTop", "1", "Base",
                        "Finished with the cleanup, the two of you get comfortable on the deck again, wondering what to do next...",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Face the other way.",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "You turn over, pressing your back closer to Cetty as she wraps her arms around you, resting both of her palms on your chest. You feel a soft, gentle kiss land at the top of your head, followed by a soft giggle.",
                        "Speaks", "I love how small you feel in my embrace...",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Usually, I dislike how large I am, but this... Cradling my beloved in my arms like this feels really right.",
                        "You lazily move your hands upwards, resting them over hers for a moment before grasping them. You squeeze her larger hands affectiontely, and she squeezes back with another quiet giggle.",
                        "Speaks", "Love you...",
                        "Menu",
                          "Relax.",
                          "Get naughty...(♥)",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "Relax.",
                      "theScene": [
                        "Holding your lover's hands close to your heart, you relax in her warm, if a little wet embrace. A contented sigh escapes her lips and she squeezes you closer.",
                        "Speaks", "I could stay like this forever...♥",
                        "A while passes with both of you laying still, enjoying each other's warm and the silence, only Cetty's and your own quiet breathing filling the air...",
                        "PlayBlackOut",
                        "...",
                        "RestPlayer",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "EyesClosed",
                        "EndBlackOut",
                        "...You stir awake, still in Cetty's embrace. It seems both of you dozed off for a while.",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Speaks", "Nnh...",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "I guess we fell asleep...?",
                        "Hugging you tighter, she pecks your head, then slowly sits up, still holding you in her arms.",
                        "Speaks", "Well, it is probably time to get up.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "After all, I'd rather spend our time together while awake...♥",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Get naughty...(♥)",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "NaughtyFace",
                        "Still holding her hands, you shift them lower, moving from your chest to the midsection. Cetty fidgets a little, uncertainly caressing your stomach with an excited sigh.",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "MildlyAroused",
                        "Speaks", "...This isn't cuddling, you know?♥",
                        "ChangeBGM", "music/Casino/BGM06_sink.mp3",
                        "You gasp softly as Cetty's delicate hands slip into your speedo, grabbing your semi-erect dick. Her hands slowly stroking it up and down, she uses her tentacles to tug down your swimwear.",
                        "With your cock free of the restraining cloth, Cetty firmly grips its base with one of her hands, letting the other go over your length in smooth, delicate strokes.",
                        "You hear Cetty giggle behind you as she plants a gentle kiss on your head, suddenly picking up the pace of her handjob.",
                        "Speaks", "Fufu... Being so cute and needy, you can't expect me not to tease you.♥",
                        "You squirm a little in her embrace, feeling a little overwhelmed by the sudden onset of pleasure, your cock leaking a large droplet of precum that quickly gets smeared all over your shaft. Lewd and wet stroking sounds fill the air as her hand picks up the pace yet again, beating you off excitedly.",
                        "Shivering from the intense pleasure, you whine erotically, helplessly bucking your hips against her hands.",
                        "ChangeImageLayer", "Expression", "1", "Haughty",
                        "Speaks", "Naughty, naughty.♥ I really just wanted to cuddle, you know? You shouldn't betray my expectations like that.♥",
                        "You gasp in panicked pleasure as you see her tailpussy moving ominously in front of your cock, dripping blue liquid on the ship's deck.",
                        "PlayerSpeaks", "W-wait...!",
                        "Speaks", "Fufu... Don't worry, I am not going to use it on you... I just don't want cleanup getting in the way of our cuddling session after you're all wringed out.♥",
                        "The tailpussy opens wide mere inches away from your cock, ready to receive all of your seed. Cetty's hand is a blur, sliding effortlessly over your stiff cock, beating your copiously leaking precum into a sticky mess.",
                        "PlayerSpeaks", "Ahh...!",
                        "Splatters of pre flying everywhere, she beats you off intensely into the gaping tail organ, the stimulation making your body feel like putty in her hands. Cetty giggles ominously and whispers a naughty command that you cannot disobey.",
                        "Speaks", "Now, start cumming for Cetty...♥",
                        "PlayerOrgasmNoSpiritLoss",
                        "On her command, you erupt, blasting the lewd pussy in front of you with a hot load of sticky cum. But the intense handjob doesn't stop, as Cetty only picks up the pace of stroking your overstimulated cock, clearly intent on wringing you completely dry in one go.",
                        "Speaks", "And keep cumming. You don't get to stop.♪",
                        "PlayerOrgasmNoSpiritLoss",
                        "You couldn't stop even if you wanted to, moaning in helpless pleasure as your cock keeps launching ropes of ivory seed into her tailpussy. Cetty's other hand shifts from the base of your shaft to cup your balls, stroking them gently to coax out more of your sperm.",
                        "Speaks", "Shh, keep cumming, keep cumming.♥",
                        "PlayerOrgasmNoSpiritLoss",
                        "The new stimulation, coupled with the affectionate encouragement, reboots your orgasm, causing you to spurt out your cum with newfound power and intensity. Your eyes roll back from the intense climax and your consciousness flickers, the world around you growing dimmer.",
                        "Finally, her hand relents, slowly and sensually squeezing your length before coming to a halt. Your cock is still spurting weakly, causing Cetty to giggle playfully.",
                        "Speaks", "Fufu... It's okay, you can stop now.♥",
                        "Last bits of cum leak from your cock, dribbling weakly into the tailpussy, then your cock finally stops, deflating in complete defeat to submissive pleasure. The dragoness's tailpussy retreats slowly, only a single drop of your cum visible on its dark tentacles.",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Cetuspeanna pats your head affectionately, cradling your limp body in her gentle embrace, her numerous tentacles gently caressing your barely conscious body.",
                        "Speaks", "Shh, it's okay darling, you did great...♥",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Fufu... And now we can cuddle.♥",
                        "Cetty squeezes you tighter, nuzzling against your back softly. Exhausted by your surprisingly dominant lover, you quickly drift off to sleep in her warm embrace...",
                        "PlayBlackOut",
                        "...",
                        "RestPlayer",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "EyesClosed",
                        "EndBlackOut",
                        "ChangeBGM", "../Mods/Beach/Music/PerituneMaterial_Whisper3_loop.mp3",
                        "...You stir awake, still in Cetty's embrace. It seems both of you were out for a while. Your cock is still feeling a little sore, and you gulp down nervously as you recall the intense orgasms she gave you.",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Speaks", "Nnh...",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "I guess we fell asleep for a while...?",
                        "Hugging you tighter, she pecks your head, then slowly sits up, still holding you in her arms.",
                        "Speaks", "Well, it is probably time to get up.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "As much as I enjoy cuddling, I'd rather spend our time together while awake...♥",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Give her a massage.",
                      "theScene": [
                        "ChangeBGM", "music/Relaxing/Tokimeki.mp3",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Umm...",
                        "ChangeImageLayer", "Expression", "1", "HappyLewd",
                        "Speaks", "Promise you'll be gentle?",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "You know I am sensitive...",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "You reassure her that you won't tease her too much, causing her to blush even more at the implication. But she does not object, and gives you a slow nod before moving to slowly surround you with her tail.",
                        "She lays flat on her stomach in front of you, shooting a shy glance in your direction. With her large upper body in front of you and the long serpentine half encircling both of you at once, you feel a little overwhelmed at the prospect of massaging {i}all{/i} of your lover.",
                        "Deciding to start with her tail, you arrive next to her tailpussy first. The orifice is slightly dripping with a clear blueish liquid as usual, looking oddly inviting... Cetty fidgets a little but seems to catch on to your intentions.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Ah, my tail is not that sensitive, I suppose it'd be better to start there.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "But make sure not to touch the... tip.",
                        "Speaks",
                        "SwapLineIf", "OtherEventsChoice", "Meet the Sea Dragon!",
                          "9", "TailPussyNotFucked", "The blue... juices would make you super sensitive, so going on with the massage would be difficult.",
                          "9", "TailPussyFucked", "You know how my... juices are, after all.♥",
                        "EndLoop",
                        "Menu",
                          "Play with the tailpussy. (♥)",
                          "Stick with the plan. (♥)",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "Play with the tailpussy. (♥)",
                      "theScene": [
                        "ChangeBGM", "music/Casino/BGM06_sink.mp3",
                        "Feeling mischievous, you begin by slowly massaging the base of her split tail, waiting for her to relax and lay down. Eyeing up the drooling orifice as you work, you note that it seems to start drooling more lubricant than usual, probably in response to stimulation of her tail.",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Cetty is moaning softly as you stroke her lean, muscular tail, seemingly completely relaxed and finally facing away from you. Taking the chance, you carefully scoop up some of her tailpussy lubricant with your hands, wondering if this could backfire on you pretty fast.",
                        "Your hands start tingling and feel quite sensitive, picking up even the slight draft as a pleasurable sensation.",
                        "SwapLineIf", "OtherEventsChoice", "Meet the Sea Dragon!",
                          "9", "TailPussyNotFucked", "It is surprisingly intense, but pretty bearable nonetheless. You do, however, feel a little threatened by how good it would feel to have on your cock.",
                          "9", "TailPussyFucked", "Compared to the mind-melting sensations it created on your cock last time, you know that this much is nothing.",
                        "EndLoop",
                        "You slowly move upwards over her tail, spreading the sensitizing lubricant all over her skin. It is already naturally wet, so Cetty doesn't seem to notice the added moisture, simply enjoying your touch.",
                        "Speaks", "Ah...♥ This is quite nice...",
                        "The liquid is quite runny and spreads over her skin nicely even with a little amount, but you do have to make one more silent trip to scoop up some more. You almost end up touching the black tentacles, which seem to pick up your presence this time and try to reach for your hands, but you manage to move them out of the way.",
                        "Holding a large pool of her lubricant in your palms, you finally reach her large dragon rump. You begin to massage and caress her body, stealthily spreading the lewd lubricant, noting the firmer muscles around the spots where her tentacles grow.",
                        "Spending an extra moment on those spots, you manage to really loosen up the stiff muscles around the tentacles. Her anatomy is quite the enigma, as you're uncertain how her muscles can be involved in the movements of the very gel-like appendages.",
                        "As you work, the white tentacles wrap around your wrists before squeezing them affectionately, but try not to get in the way otherwise.",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "With how much naughty lubricant you've been spreading over her, you start to wonder if the stuff even affects her. Peeking at her upper body, you then note that she is flushed a deeper purple than before. It may simply be the effects your massage, but you decide to keep going.",
                        "With the last bit of lube, you place your hands on her lower back, where her upper human-like body meets with the serpentine parts. Cetty emits a pleasured murmur, wiggling her wide hips a little under your hands.",
                        "You begin moving your hands upwards, finally getting to spread the lewd liquid on her human skin as well. Going all the way from her butt to her shoulders in one go, you rub it in with stronger movements. Cetty seems to enjoy the stronger touch on her shoulders, moaning aloud.",
                        "Speaks", "Nnh!♥ So good...♥",
                        "ChangeImageLayer", "Base", "1", "BaseFullBodyBlush",
                        "ChangeImageLayer", "Tits", "1", "",
                        "ChangeImageLayer", "ArmsBase", "1", "",
                        "ChangeImageLayer", "ArmsTop", "1", "",
                        "You decide to move downwards again, towards her sides and waist. However, from there it doesn't take long for Cetty to start audibly panting, her entire body flushed a deep purple. As your hand brushes next to her breast, she moans so loudly that she seems to startle even herself.",
                        "ChangeImageLayer", "Expression", "1", "Helpless",
                        "Speaks", "Aaahhhn!♥",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "W-wha? What???",
                        "ChangeImageLayer", "Expression", "1", "Oface",
                        "Figuring the cat is out of the bag, you grin and shove your hand under her swimsuit, enjoying a palmful of her soft tit. Her entire body reacts violently, convulsing in pleasure as she seems to cum her brains out on the spot.",
                        "Speaks", "Hyaanh!♥ W-whaat did you dooooo!?♥",
                        "Speaks", "W-why...! Shoo goood?!♥",
                        "ChangeImageLayer", "Expression", "1", "Helpless",
                        "You show off the dripping blue liquid on your free hand, earning a panicked moan from Cetty, her entire body wiggling and convulsing beneath your touch.",
                        "ChangeImageLayer", "Expression", "1", "Oface",
                        "Speaks", "I I didn't- hyanh!♥ Know it wooorks on meeeee!?♥ Whyyy?!♥♥",
                        "ChangeImageLayer", "BikiniTop", "1", "",
                        "You slip off Cetty's bikini top, squeezing her soft, palmable tits with your lube-smeared hands, causing her to orgasm yet again. She squeals in pleasure, arching her back and uncoiling her tail, powerfully slamming it into the ship.",
                        "ChangeImageLayer", "BikiniBottom", "1", "",
                        "Deftly moving your hands down, you get rid of the bottoms as well, revealing her already drenched, quivering pussy. Wasting no time you shove two of your fingers inside, easily welcomed by the warm and moist orifice. Cetty has another micro-orgasm from the insertion, needily thrusting her hips against your hand with a low whine.",
                        "Speaks", "M-meeanieee...♥ Thish ish too good...♥♥",
                        "ChangeImageLayer", "Expression", "1", "Kissy",
                        "You interrupt her complaints with a kiss, pushing your tongue into her warm mouth. She doesn't seem to have any strength left to beat her tail any more, or even respond to your kiss, so she simply lays there defeated, shivering and panting into your mouth helplessly. Given how sensitive she already is, this kind of stimulation may be a little too much for her.",
                        "You diminsh your efforts a little, slowly and sensually pushing your fingers in and out of her soft dragon pussy, planting gentle, drawn out kisses on her mouth. This only seems to excite Cetty even more, and when you start patting her head gently with your free hand, she completely melts into a quietly mewling mess, seemingly in the state of a perpetual orgasm.",
                        "Speaks", "{ThePlayerName}...♥ {ThePlayerName}...!♥♥",
                        "ChangeImageLayer", "Expression", "1", "Oface",
                        "She keeps muttering your name softly, words intermixing with breathy moans and cute gasps. Her pussy clenches down harder than before, her back arching strongly as she cums yet again, this time with a deafening, truly draconic cry.",
                        "Speaks", "AAAAAAAaahh!!!♥♥",
                        "ChangeImageLayer", "Expression", "1", "Torogao",
                        "After riding out her orgasm on your fingers, she falls to the ship's deck completely exhausted. You pull out your fingers from her tight slit and cuddle up next to the barely conscious dragon, caressing her motionless body gently.",
                        "Speaks", "Oohhh...♥ I- I can't believe I never thought to try that...",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Speaks", "This... could become a...",
                        "She seems to drift to sleep, clearly too exhausted by the repeated orgasms. You cuddle up closer to your lover, also feeling a little tired after the whole exercise...",
                        "PlayBlackOut",
                        "...",
                        "RestPlayer",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Tits", "1", "Titties",
                        "ChangeImageLayer", "ArmsBase", "1", "ArmsRest",
                        "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
                        "EndBlackOut",
                        "...You stir awake after a while, still hugging Cetty. The large dragoness seems to be awake already, face a little flushed as she looks down at you.",
                        "ChangeImageLayer", "Expression", "1", "HappyLewd",
                        "Speaks", "Umm... That was quite the massage...",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "It was so good it was getting a little scary, so thanks for slowing down at the end...",
                        "You point out how that only seemed to excite her more.",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "Rules",
                        "Speaks", "O-of course it would! Hmph...",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "She looks away steaming and embarrassed, but obviously very happy.",
                        "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
                        "ChangeImageLayer", "BikiniTop", "1", "Top",
                        "ChangeImageLayer", "BikiniBottom", "1", "Bottom",
                        "You squeeze her tighter for a moment before disentangling yourself to sit up. She sits up as well, redressing herself and still looking a little worn out, but later looking at you with anticipation nonetheless.",
                        "Speaks", "Let's do something more relaxing next...",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "Just no more massages...",
                        "JumpToScene", "MainHubHome"

                      ]
                    },
                    {
                      "NameOfScene": "Stick with the plan. (♥)",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
	                        "You begin to slowly massage the base of her split tail with your hands, gently prodding at its muscles first. It is quite firm, but you are not certain if it is because they are stiff, or sea dragon bodies are naturally like that.",
	                        "With a shrug, you keep massaging, squeezing and kneading her tail, noting that it does seem to become more relaxed from your efforts, and also feeling rewarded as Cetty starts murmuring in pleasure.",
	                        "With the tail sufficiently loosened up, you move upwards over her long body. Most of her snake-like length seems fairly flexible, coming off as well-trained and toned. You don't have to spend much time on these areas, although you do note the top part of the tail was stiffer than the bottom.",
	                        "Moving on, you reach her wide dragon rump, with the many white tentacles growing out of it. Cetty coos in pleasure as your hands work on her wide hips, giving extra attention to the areas around every tentacle, which seem particularly stiff.",
	                        "Spending an extra moment around those spots, you manage to really loosen up the stiff muscles in the area. Her anatomy is quite the enigma, as you're uncertain how muscles can be involved in the movements of the very gel-like appendages that are her tentacles.",
	                        "As you work, the white limbs wrap around your wrists before squeezing them affectionately, but try not to get in the way otherwise. Cetty herself is almost shivering with pleasure as you work on her body, clearly appreciating the extra attention to her tentacles.",
	                        "Finally, you reach her upper body, which should be more familiar to work with. You plant your hands on her lower back, taking a moment to appreciate your lover's beautiful physique from behind. While she looks quite soft overall, her body is indeed quite toned, which is especially evident when you're paying extra attention to her muscles, as you are right now.",
	                        "ChangeImageLayer", "Expression", "1", "Happy",
	                        "As you switch from her lower back to her upper body and to her sides, Cetty lets out a girlish titter.",
	                        "Speaks", "Hehe... that tickles...",
	                        "You playfully tickle her for a moment, causing her to giggle uncontrollably, but return to simply massaging her soon enough, deciding to stay focused on the task.",
	                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
	                        "Moving up to her shoulders, you realize that they are quite tense, wondering if it may be related to her grand gesturing when she casts magic, her regal posture, or something else entirely.",
	                        "ChangeImageLayer", "Base", "1", "BaseFlush",
	                        "Speaks", "Ahhnn... You're so good at this...♥",
	                        "Cetty seems to really appreciate the extra attention to her shoulders and upper arms, mewling quietly as you massage them. Spending a little time around her neck next, you gently tap her on the side to get her to turn over.",
	                        "ChangeImageLayer", "Expression", "1", "Haughty",
	                        "Speaks", "Front, huh...? Hmm...",
	                        "She turns over as asked, but shoots you a mischievous glance as her tentacles suddenly wrap around your wrists.",
	                        "Speaks", "You're so serious about this... We can be a little naughtier, you know?♥",
	                        "ChangeImageLayer", "Expression", "1", "NaughtyFace",
	                        "ChangeImageLayer", "BikiniTop", "1", "",
	                        "ChangeImageLayer", "BikiniBottom", "1", "",
	                        "Her tentacles firmly plant your hands on her soft chest, just as the others move to pull her bikini off entirely.",
	                        "Speaks", "Be nice and thorough with my... front, okay?♥",
	                        "ChangeBGM", "music/Relaxing/Tokimeki.mp3",
	                        "You gulp down and nod, a bit taken aback by her sudden assertiveness. Squeezing her soft bosom with both hands, you wonder how to free up one hand to massage her stomach.",
	                        "ChangeImageLayer", "Expression", "1", "Pleasured",
	                        "With a shrug, you lean down, planting your lips on one of her puffy nipples, drawing a pleasured moan from your lover. As you move one of your hands down to her tummy, Cetty brings her own hand to the back of your head, pushing your face deeper into her soft tit. You gently bite the stiff nub in your mouth in response, causing her to moan even louder.",
	                        "Trying not to lose yourself in her amazing tits, you keep massaging her stomach with one hand as you play with them, slowly inching lower towards her undoubtedly moist pussy. In a hurry, one of her tentacles grabs your wrist again, insistently tugging your arm towards her crotch.",
	                        "Speaks", "Nnn... Hurry...♥",
	                        "Obliging your cutely needy lover, you push your fingers inside her tight and hot pussy, drawing an excited gasp from the large dragoness. You squeeze and bite her nipples as you start pushing your finger in and out of her moist love canal, every movement causing her to shiver unabashedly.",
	                        "Cetty pants and gasps as you work her sensitive bits, quickly becoming more and more excited, writhing like a snake beneath your touch. You redouble your efforts, eager to please your lovably needy Cetty, her honest and cute reactions making the massage quite rewarding.",
	                        "It doesnt take long for her to approach her peak, moaning and whispering expressions of love throughout. Clamping down on her nipples, you switch your fingering hand to her stiff clit, stroking and teasing it in quick circular motions, sending obvious shivers through Cetty's entire body.",
	                        "ChangeImageLayer", "Expression", "1", "Oface",
	                        "The dragoness cries out in pleasure, arching her back as she finally cums hard, splattering the deck with her juices as her pussy convulses and quivers under your fingers. Slowly, passionately and methodically, you lead her through the orgasm with your hands, focusing on making it as pleasurable as you can.",
	                        "ChangeImageLayer", "Expression", "1", "Torogao",
	                        "As her climactic screams subside, she falls to the deck again in exhaustion, completely and thoroughly spent and relaxed. She looks at you with an exhausted but loving smile before mouthing 'Love you' and falling asleep like a rock.",
	                        "ChangeImageLayer", "Expression", "1", "Sleepy",
	                        "...",
	                        "ChangeImageLayer", "BikiniTop", "1", "Top",
	                        "ChangeImageLayer", "BikiniBottom", "1", "Bottom",
	                        "ChangeBGM", "music/Relaxing/Tokimeki.mp3",
	                        "You redress your lover in her sleep, cradling her upper body as you wait for her to wake up. She's been quite heavy to hold all this time, given her size, but she stirs awake before your arms start getting really sore.",
	                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
	                        "Speaks", "Mmh... Sorry... I didn't mean to fall asleep.",
	                        "ChangeImageLayer", "Base", "1", "BaseFlush",
	                        "ChangeImageLayer", "Expression", "1", "ShySmile",
	                        "Speaks", "Your massage was just that good...",
	                        "She gets up from your lap, positioning herself across you as usual.",
	                        "ChangeImageLayer", "Expression", "1", "Happy",
	                        "ChangeImageLayer", "Base", "1", "Base",
	                        "Speaks", "Let's do something more exciting next!",
	                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Brush her hair.",
                      "theScene": [
                        "IfChoice", "5", "BrushingSuggested", "BrushRepeat",
	                        "SetChoice", "5", "BrushingSuggested",
	                        "ChangeImageLayer", "Base", "1", "BaseFlush",
	                        "ChangeImageLayer", "Expression", "1", "Tiny",
	                        "Speaks", "Eh?",
	                        "ChangeImageLayer", "Base", "1", "BaseBlush",
	                        "You repeat the offer and she just blushes more.",
	                        "ChangeImageLayer", "Expression", "1", "ShySmile",
	                        "Speaks", "S-sure, but... Why? D-does it look tangled?",
	                        "You reassure her that her hair looks gorgeous, and that it is exactly why you want to take care of it and play with it.",
	                        "ChangeImageLayer", "Base", "1", "BaseFlush",
	                        "She relaxes somewhat and gives a short nod, but still looks a bit puzzled.",
	                        "Speaks", "R-right.",
	                        "You walk behind your dragon girlfriend and quickly realize one simple but obvious issue: you don't have a brush. Somewhat bashfully, you ask if she has one at hand.",
	                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
	                        "Speaks", "Oh, not here, but I could fetch one from my bedroom. Give me just a moment!",
	                        "DisplayCharacters", "EndLoop",
	                        "Cetty leaps into the air and disappears underwater, splashing water all around and leaving you alone on the ship.",
	                        "The solitude is a little unnerving, given that you have no real way out of this place. You get up and decide to look around the vessel to chase away the unpleasant feeling.",
	                        "Approaching the ship's port, you examine the woodwork and the ship's overall design. It looks quite different from the vessel you arrived on, and the others you saw back at Fertilia.",
	                        "You're not sure if this woodwork is authentic ancient human craftsmanship or something produced by local mermaids as a replacement, but judging by how old and weathered it looks, it is likely to be the former.",
	                        "You spend a couple more minutes admiring the antique-looking ship before hearing a splash, signaling your lover's return.",
	                        "DisplayCharacters", "1", "EndLoop",
	                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
	                        "Speaks", "Here it is... And umm, let's keep it here somewhere, just in case we do this again.",
	                        "You nod and take the brush, then ask Cetty to sit down and get comfortable. As she's coiling her long tail into neat loops, you grip the brush and step behind her, looking forward to finally getting to touch her hair.",
	                        "ChangeBGM", "../Mods/Beach/Music/PerituneMaterial_Starry_loop.mp3",
	                        "To start with, you carefully run your fingers through her shiny, raven-black hair. It is incredibly soft and silky-smooth, flowing gracefully around your moving fingers. Of course, you've touched it many times before, during the time you already spent together, but this is the first time you get to focus on it, and really appreciate the texture.",
	                        "ChangeImageLayer", "Expression", "1", "Sleepy",
	                        "Supporting the base of the hair with your hand to avoid tearing, you run the brush through the wonderfully soft strands. It moves unimpeded, not meeting any knots or other obstacles, her hair shining beautifully beneath the brush.",
	                        "You repeat the motion, again and again, at a different spot or angle, but fail to find a single tangled strand. With a shrug, you settle down for simply appreciating her meticulously groomed hair and its pleasant texture.",
	                        "ChangeImageLayer", "Base", "1", "BaseBlush",
	                        "Deciding to try something new while you're at it, you shift the mass of her hair aside a little. As your brush is running through her hair from below, you take the opportunity to kiss her exposed nape, causing Cetty to shiver just a little.",
	                        "ChangeImageLayer", "Base", "1", "BaseFlush",
	                        "Smilling to yourself, you go back to taking care of her hair. Even though it didn't really need brushing in the first place, you just can't seem to stop doing it. The process is simple and meditative, surprisingly easy to really focus on. Cetty hums a happy little melody, seemingly content with not doing anything else.",
	                        "Figuring you can move to a different spot, you walk around a little to take a look at her horns, spotting some messier hair strands around them. They're not tangled, not exactly, but are not quite as well-groomed as the rest of her head.",
	                        "You reach out and begin to straighten out the messier strands. The horn is getting in the way so it is a bit of a challenge, but you seem to manage. Her ear-tentacles, which are also nearby, playfully tickle and tug at your hands as you work.",
	                        "Walking around your large girlfriend again, you get to work around her other horn. It takes less effort this time, despite the ear tentacles getting more and more playful with you. Finally done, you wonder if Cetty can't straighten out this area herself because she can't see behind the horns.",
	                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
	                        "Lastly, you arrive at her front, deciding to finish the job with her cute bangs. She smiles quietly as you pat her head, her ear-tentacles wiggling in delight.",
	                        "ChangeImageLayer", "Expression", "1", "Happy",
	                        "You plant a soft kiss on her forehead, causing her to giggle happily, and start brushing down her bangs. It doesn't take long, as they are particularly well-groomed, but you take your sweet time, content to be simply standing in front of your lover and looking at her cute smiling face.",
	                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
	                        "Finally, you step away and put the brush down, figuring you've had your fill for now. Seeing this, Cetty picks herself up and briefly touches her hair with a smile.",
	                        "Speaks", "You know, that was very relaxing. We should do it again sometime...",
	                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "BrushRepeat",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Sure.",
                        "ChangeBGM", "../Mods/Beach/Music/PerituneMaterial_Starry_loop.mp3",
                        "You tell Cetty to sit down and get comfortable, then walk away to procure the brush again.",
                        "When you're back, she's just finished coiling her long tail into neat loops. You step behind her, brush in hand, looking forward to touching her hair again.",
                        "To start with, you carefully run your fingers through her shiny, raven-black hair. It is incredibly soft and silky-smooth, flowing gracefully around your moving fingers. No matter how many times you do this, you can't seem to find a single flaw with her beautiful, almost abnormally smooth hair.",
                        "ChangeImageLayer", "Expression", "1", "Sleepy",
                        "Supporting the base of the hair with your hand to avoid tearing, you run the brush through the wonderfully soft strands. It moves unimpeded, not meeting any knots or other obstacles, her hair shining beautifully beneath the brush.",
                        "Like before, you shift her mane aside a little, wanting to change up the angle of movement. As your brush is running through her hair from below, you take the opportunity to kiss her exposed nape, causing Cetty to shiver just a little.",

                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "Smilling to yourself, you go back to taking care of her hair. Even though it didn't really need brushing in the first place, you just can't seem to stop doing it. The process is simple and meditative, surprisingly easy to really focus on. Cetty hums a happy little melody, seemingly content with not doing anything else.",
                        "Figuring you can move to a different spot, you walk around a little to take a look at her horns, spotting some messier hair strands around them. They're not tangled, not exactly, but are not quite as well-groomed as the rest of her head.",
                        "You reach out and begin to straighten out the messier strands. The horn is getting in the way so it is a bit of a challenge, but you seem to manage. Her ear-tentacles, which are also nearby, playfully tickle and tug at your hands as you work.",
                        "Walking around your large girlfriend again, you get to work around her other horn. It takes less effort this time, despite the ear tentacles getting more and more playful with you. Finally done, you once more wonder if Cetty can't straighten out this area herself because she can't see behind the horns.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Lastly, you arrive at her front, deciding to finish the job with her cute bangs. She smiles as you pat her head a little, her ear-tentacles wiggling energetically, but doesn't say anything.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "You plant a soft kiss on her forehead, causing her to giggle happily, and start brushing down her bangs. It doesn't take long, as they are particularly well-groomed, but you take your sweet time, content to be simply standing in front of your lover and looking at her cute smiling face.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Finally, you step away and put the brush down, figuring you've had your fill for now. Seeing this, Cetty picks herself up and briefly touches her hair with a smile.",
                        "Speaks", "I actually really like it when you... take care of me. Let me know if you want to do this again.",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Sex.",
                      "theScene": [
                        "IfChoice", "6", "SexDiscussed", "SexMenu",
                        "SetChoice", "6", "SexDiscussed",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "O-of course... But since we're all the way here, and all alone... I think we can do naughtier things than we did back on beach.♥",
                        "You nod, idly wondering what she may have in mind...",
                        "JumpToScene", "SexMenu"
                      ]
                    },
                    {
                      "NameOfScene": "SexMenu",
                      "theScene": [
                        "Menu",
                          "Hand-holding standing sex.",
                            "RequiresChoice", "9", "",
                          "Naughtier things?",
                            "RequiresChoice", "9", "IdeasDiscussed",
                            "RequiresStat", "Spirit", "10",
                          "Gokkun. (10 Spirit)",
                            "RequiresChoice", "9", "IdeasDiscussed",
                          "Tentacle fuck.",
                            "RequiresChoice", "8", "",
                          "Roleplay?",
                            "RequiresChoice", "8", "RoleplayDiscussed",
                          "Roleplay.",
                            "RequiresChoice", "7", "SexMagic",
                          "Magic play.",
                            "RequiresChoice", "10", "ZapperExamined",
                          "Horn machine...?",
                            "RequiresChoice", "10", "ZapperDiscussed",
                          "Horn machine play.",
                          "Back.",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "Hand-holding standing sex.",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "Rules",
                        "Speaks", "{b}Yes.{/b}",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "I mean... that sounds very good, yes. We should do... that.",
                        "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
                        "Speaks", "...",
                        "ChangeImageLayer", "BikiniTop", "1", "",
                        "ChangeImageLayer", "BikiniBottom", "1", "",
                        "Cetty silently strips on the spot, dropping her bikini on the deck. You follow suit, slipping out of your speedo and taking a step closer.",
                        "ChangeImageLayer", "Expression", "1", "Wistful",
                        "With both of you naked, Cetty can't seem to tear her eyes away from your dick. Feeling mischievous, you wave your hand in front of it, causing her to sputter awkwardly.",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "I- umm, ah... S-sorry I... spaced out...",
                        "ChangeImageLayer", "Expression", "1", "Smile",
                        "You come closer and take one of her hands into yours before giving it a little kiss. Cetty finally seems to relax a little, placing her other hand over yours.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "ChangeBGM", "../Mods/Beach/Music/PerituneMaterial_Shizima2.mp3",
                        "You hold her hands gently, holding her soft fingers between your own and your palms. As always, her hands are smooth, girlish and gentle, almost feeling diminutive depsite their large size.",
                        "You step closer again, your already hard cock bumping against her slick lower  body. Cetty coos softly, shifting downwards until her pale dragon pussy aligns with your erect shaft, and presses it up against your glans. Her slit is hot, soft, and very wet, already anticipating the insertion.",
                        "ChangeImageLayer", "Expression", "1", "Pleasured",
                        "You waste no time and push inside, also eager to taste the pleasurable insides of her lewd slit. Slowly, you ease yourself inside until your hips connect with a wet slap, followed by a deep moan from Cetuspeanna as her pussy starts squeezing down welcomingly on your cock.",
                        "Her hands also squeeze yours affectionately, as do her tentacles that start to wrap around your limbs when you begin thrusting. Cetty whines in pleasure, weakly moving her hips as well, but mostly assisting your thrusts with her slippery appendages.",
                        "Speaks", "Nnnnhh...♥",
                        "Knowing how sensitive your lover is, you try to control the pace of your thrusts, allowing her to ease into the act. Despite the gentle pace, she is obviously {i}really{/i} feeling it, swaying so much that you worry she might topple over.",
                        "You make sure you have a good grip on her hands and keep thrusting slowly, reveling in the sensations of her wet pussy desperately clenching down on your cock, and enjoying the unabashedly sweet moans that Cetty lets out every time your crotches slap together.",
                        "ChangeImageLayer", "Expression", "1", "LovingSex",
                        "Cetty's eyes fly open as she gazes deep into yours, a look of complete lovestruck adoration plastered on her panting face. Your heart skips a beat at the sight, causing you to thrust forward in need. Cetty cries out in bliss, seemingly cumming on the spot as her pussy walls start thrashing wildly around your engorged cock.",
                        "Speaks", "I love youu...♥ I love you, {ThePlayerName}!♥",
                        "ChangeImageLayer", "Expression", "1", "Kissy",
                        "PlayerOrgasmNoSpiritLoss",
                        "Her own declaration of love seems to send her over the edge and she starts orgasming again, her moans silenced by your kiss as you can't control yourself and let go of her hands to hug her tight while she cranes her neck down to kiss you deeply. Your cock erupts as well, flooding Cetty's deepest parts with a thick load of hot seed as you make out passionately.",
                        "To your lust-addled, passion-struck mind, a single load is not enough, not nearly, and you keep thrusting into your lover without a break. The sensation of her pussy churning against your cumming cock is almost too much to bear but you don't care, consumed by your burning desire for your beautiful dragoness.",
                        "ChangeImageLayer", "Expression", "1", "LovingSex",
                        "Speaks", "Mmaaah!♥ {TPN}-{TPN}-{TPN}-{ThePlayerName}!!!♥",
                        "You can no longer control your flaring libido, or resist the heavenly insides of her slimy pussy quivering wildly around your cock, and pound Cetty as hard and as fast as you can. Her hands grab onto your buttocks, eagerly assisting your intense movements as she shivers and orgasms from every pounding thrust.",
                        "With the speed your cock is sliding through her moist canal, knocking at her soft womb, it doesn't take long before you are spurting again, your second load bigger than the first. Cetty's moans turn into a single, drawn-out cry of pleasure as she finally falls down into your arms. You barely manage to brace yourself for impact through your orgasm and catch her, both of you falling softly to the side.",
                        "ChangeImageLayer", "Expression", "1", "Kissy",
                        "Your cock still spraying, you begin thrusting again, kissing your lover deeply as your desire for her keeps reaching new heights. Even though you can barely move your hips at this point, you want to- {i}need to{/i} plant another load inside your dragon lover. Cetty kisses you back weakly, panting and sighing happily, but otherwise seems unable to move.",
                        "ChangeImageLayer", "Expression", "1", "LovingSex",
                        "Or so you think, as she suddenly turns over on her back, keeping you on top with her tentacles. Assisted by gravity, your cock easily sinks into the deepest parts of her pussy and erupts again, flooding her warm womb with one final serving of seed.",
                        "ChangeImageLayer", "Expression", "1", "Kissy",
                        "As your cock goes soft, you slip out of her pussy, slididng across her stomach closer to her face. She welcomes you with another deep kiss, sighing contentedly as she embraces you...",
                        "PlayBlackOut",
                        "...",
                        "RestPlayer",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "EndBlackOut",
                        "You come to in Cetty's embrace, both of you still in the nude. It seems you passed out right after your last orgasm. Cetty is watching over you quietly with a relaxed smile on her face. Neither of you speak up - there is no need for words in this moment of tender love. You spend a while just gazing at each other...",
                        "...",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "Smile",
                        "ChangeImageLayer", "BikiniTop", "1", "Top",
                        "ChangeImageLayer", "BikiniBottom", "1", "Bottom",
                        "After a while, you reluctantly disentangle from each other and redress. As Cetty is possessively encircling you with her tail as she often does, she only says a single thing.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "We'll need to do that again soon.",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Naughtier things?",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Eh? W-well I mean stuff like... actual sex, or kissing, or... just lovey-dovey things?",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "R-really I didn't want to do those back on the beach because the mermaids were definitely watching...",
                        "You point out that those are not very 'naughty' things to do.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "O-oh, you mean... I see. I guess trying... riskier things is an an intriguing and... attractive prospect.",
                        "You ask if she has any fantasies about kinkier things she would like to try in private.",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "W-well I... Umm...",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "A-a friend once told me about a thing they do at the capital... When a girl drinks an entire glass of semen at once. Apparently it's called 'gokkun'?",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "I-if you can cum that much, I would like the opportunity to be a little gluttonous, I suppose. It sounds very arousing to me...",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "A-anyway, another thing is... uuh... even more embarrassing.",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "Basically, I would like to, um, fuck you with my tentacles. L-like, really wrap you up and tease you a lot, your penis and your butt... Especially your butt...",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "Y-you don't have to say anything now! Just tell me later if you're interested and forget it if you're not...",
                        "SetChoice", "9", "IdeasDiscussed",
                        "JumpToScene", "SexMenu"
                      ]
                    },
                    {
                      "NameOfScene": "Gokkun. (10 Spirit)",
                      "theScene": [
                        "ChangeBGM", "music/Loss/Do not yarn.mp3",
                        "IfChoice", "12", "DoneMilkingBefore", "RepeatMilkingScene",
                        "SetChoice", "12", "DoneMilkingBefore",
                        "JumpToScene", "FirstMilkingScene"
                      ]
                    },
                    {
                      "NameOfScene": "FirstMilkingScene",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "R-really? You can do that?",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "SwapLineIf", "Item",
                          "Sigil Of Will-Power", "She slithers away and excitedly brings in a flat red cup from the ship's depths. You remember seeing the Willpower Temple denizens drink from these... only this one is larger. Much, much larger.",
                          "", "She slithers away and excitedly brings in a flat red cup from the ship's depths. Or rather, it looks more like a dish. A rather large one.",
                        "EndLoop",
                        "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
                        "You gulp nervously, realizing just how much you'll be cumming in a moment. You glance at Cetty and realize that she is quite nervous as well, seemingly uncertain how to proceed at this point.",
                        "Speaks", "So umm... how do we...?",
                        "At this point, you {i}are{/i} used to ejaculating often and frequently, but filling a container of that size may be difficult to do with most normal sexual acts.",
                        "SwapLineIf", "HasFetishLevelEqualOrGreater", "VeneficasMilkingPet",
                          "10", "Recalling your 'milking' sessions with Venefica, your cock throbs powerfully with needy excitement, already quite sure how this will work...",
                          "0", "All things considered, there's probably one single position that fits best for this kind of thing...",
                        "EndLoop",
                        "You tell Cetty that she should probably 'milk' you over the cup until it fills up.",
                        "ChangeImageLayer", "Expression", "1", "Flustered",
                        "Speaks", "O-o-okay, that sounds... sensible.",
                        "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
                        "Cetty sets the cup on the deck and positions herself next to it, looking at you shyly and expectantly. You strip free of your speedo and stand over the cup before getting on all fours, feeling a little embarrassed.",
                        "ChangeImageLayer", "Expression", "1", "MildlyAroused",
                        "Speaks", "Umm... O-one question. Can I play with your butt too?",
                        "Menu",
                          "No.",
                          "Yes...",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "RepeatMilkingScene",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Ah- a-again? You spoil me...♥",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "She slithers away and excitedly brings back the red cup. You gulp nervously, realizing just how much you'll be cumming again. You glance at Cetty and see that she is quite excited to do this again, fiddling with the bowl-like dish in her hands.",
                        "SwapLineIf", "HasFetishLevelEqualOrGreater", "VeneficasMilkingPet",
                          "10", "Recalling your 'milking' sessions with both Cetty and Venefica, your cock throbs powerfully with needy excitement, already looking forward to getting squeezed dry...",
                          "0", "",
                        "EndLoop",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "L-let's start then!",
                        "Cetty sets the cup on the deck and positions herself next to it, looking at you shyly and expectantly. You strip free of your speedo and stand over the cup before getting on all fours, feeling a little embarrassed.",
                        "ChangeImageLayer", "Expression", "1", "MildlyAroused",
                        "Speaks", "Umm... O-one question. Can I play with your butt too?",
                        "Menu",
                          "No.",
                          "Yes...",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "No.",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "O-okay...",
                        "SetChoice", "11", "AnalMilkingNo",
                        "JumpToScene", "MilkingScene"
                      ]
                    },
                    {
                      "NameOfScene": "Yes...",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Okay!",
                        "SetChoice", "11", "AnalMilkingYes",
                        "JumpToScene", "MilkingScene"
                      ]
                    },
                    {
                      "NameOfScene": "MilkingScene",
                      "theScene": [
                        "SwapLineIf", "Choice",
                          "11", "AnalMilkingYes", "Her hands rest on your buttocks first, squeezing and kneading them appreciatively. After indulging in her love of your ass for a bit, she switches her attention to your shaft, firmly grasping it and pointing it downwards into the cup.",
                          "11", "AnalMilkingNo", "Her hands move to your already erect cock, brushing against your buttocks first. Firmly grasping your dick and pointing it downwards into the cup with one hand, she softly caresses your testes with the other.",
                        "EndLoop",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Um, move a little closer...",
                        "She tugs at your shaft gently, using it to guide you a couple steps back before tapping your butt playfully to signal a 'stop'. You feel a little embarrassed by how she goes about this, but cannot deny that her playful handling of your crotch fills you with submissive arousal.",
                        "SwapLineIf", "Choice",
                          "11", "AnalMilkingYes", "You gasp as her middle finger moves to slowly trace over your buttcrack and across your anus, just as she begins tugging at your hard dick with her other hand. Cetty giggles quietly, repeating the motion several times as she keeps working your shaft, large droplets of precum already escaping from its tip, falling into the waiting cup below.",
                          "11", "AnalMilkingNo", "You gasp as her soft hand starts squeezing gently at your heavy balls, just as she begins tugging at your hard dick with her other hand. Cetty giggles quietly as she keeps working your shaft, large droplets of precum already escaping from its tip, falling into the waiting cup below.",
                        "EndLoop",
                        "Speaks", "Fufu, you're already working to fill it.♥",
                        "SwapLineIf", "Choice",
                          "11", "AnalMilkingYes", "Her finger slips into your anus carefully, drawing a pleasured whine from you as your cock starts leaking even more. Her stroking hand slows down to gentle but insistent milking motions, but the finger inside of you confidently arrives at your prostate, giving it a firm press.",
                          "11", "AnalMilkingNo", "Her soft hand keeps squeezing your full testicles, gently but stronger every time, drawing a pleasured whine from you as your cock starts leaking even more. Her stroking hand picks up pace to rough milking motions, already intent on making you cum right away.",
                        "EndLoop",
                        "PlayerOrgasm", "1",
                        "SwapLineIf", "Choice",
                          "11", "AnalMilkingYes", "You throw your head back with a loud moan, pretty sure that you are drooling, and cum, blasting the cup with a serving of hot splooge just from a single touch to your love button.",
                          "11", "AnalMilkingNo", "You throw your head back with a loud moan, pretty sure that you are drooling, and cum, blasting the cup with a serving of hot splooge, already overtaken by the intense handjob.",
                        "EndLoop",
                        "ChangeImageLayer", "Expression", "1", "NaughtyFace",
                        "Speaks", "Well, that was easy...♥ Fufu...♥",
                        "ChangeImageLayer", "Expression", "1", "MildlyAroused",
                        "SwapLineIf", "Choice",
                          "11", "AnalMilkingYes", "You only manage an uncharacteristically high-pitched moan as her hands keep working their magic on your nethers, despite the ongoing orgasm. Her stroking hand even picks up the pace suddenly, already smeared in cum as it slides over your twitching length with ease. Her other hand is massaging your prostate in slow circular motions, but without much force behind it.",
                          "11", "AnalMilkingNo", "You only manage an uncharacteristically high-pitched moan as her hands keep working their magic on your nethers, despite the ongoing orgasm. Her stroking hand even picks up the pace suddenly, already smeared in cum as it slides over your twitching length with ease. Her other hand is massaging your balls in slow circular motions, but without much force behind it.",
                        "EndLoop",
                        "PlayerOrgasm", "1",
                        "The ongoing assault is too much to bear and you spurt again, mere moments passing since your first load. The orgasm hits you harder than before and you feel your legs shivering as you arch your back and shoot out long ropes of thick ivory cum. You cannot see the cup, but it certainly feels like you already came quite a lot.",
                        "Speaks", "Mmm... Let's switch this up a bit so you don't get bored.♥",
                        "PlayerOrgasm", "1",
                        "There is no way you could get bored when the next orgasm is already on its way, rapidly. But when Cetty's hand switches from your shaft to encircle your over-engorged glans, you begin cumming again even faster than you expected.",
                        "PlayerSpeaks", "Hyaah!♥",
                        "SwapLineIf", "Choice",
                          "11", "AnalMilkingYes", "Cetty is moving her hand in tiny but rapid motions, right at the tip of your cock, and the fingers lodged deep inside your butt are knocking insistently at your overworked prostate.",
                          "11", "AnalMilkingNo", "Cetty is moving her hand in tiny but rapid motions, right at the tip of your cock. All the while, her other hand is squeezing your balls unevenly and playfully.",
                        "EndLoop",
                        "PlayerOrgasm", "2",
                        "Another mind-shattering orgasm hits you, even before you finish shooting out your previous load. It is as if a switch was flipped inside of you, and you start to spurt without end, globs of white cum escaping your cock in a constant stream. You feel your legs give out, but realize Cetty's tail and tentacles were holding you in place for a while already.",
                        "PlayerOrgasm", "2",
                        "You don't get to think much as all your thoughts are replaced with orgasmic sensations yet again, the world becoming white from the mind-searing pleasure and the endless assault on your cock...",
                        "Menu",
                            "RequiresFetishLevelEqualOrGreater", "VeneficasMilkingPet", "10",
                          "'Moo!♥'",
                          "Cry out in pleasure.",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "'Moo!♥'",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "Flustered",
                        "Speaks", "'M-moo?!' Oh my...",
                        "ChangeImageLayer", "Expression", "1", "NaughtyFace",
                        "Speaks", "My, my, now who taught you to do that, mm? My little cow...♥",
                        "PlayerOrgasm", "3",
                        "Cetty's hand picks up the pace suddenly, roughly assaulting your already overstimulted cock. Your eyes roll back from unbearable pleasure and you moo again, weakly shaking your hips as you spurt another, truly massive load inside the cup.",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Speaks", "Fufu, such an eager, helpless cum cow.♥ I'll tease you even more...♥",
                        "Speaks", "There, there, shoot more for Cetty.♥ You can do it.♥",
                        "JumpToScene", "MilkingDone"
                      ]
                    },
                    {
                      "NameOfScene": "Cry out in pleasure.",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Speaks", "Shh, it's okay. There, there, we almost filled the cup.♥ Can you shoot a little more for Cetty?♥",
                        "PlayerOrgasm", "3",
                        "Cetty's hand picks up the pace suddenly, roughly assaulting your already overstimulted cock. Your eyes roll back from unbearable pleasure and you moan again, weakly shaking your hips as you spurt another, truly massive load inside the cup.",
                        "Speaks", "Good job...♥ Just a little more now, a teensy little bit.♥",
                        "JumpToScene", "MilkingDone"
                      ]
                    },
                    {
                      "NameOfScene": "MilkingDone",
                      "theScene": [
                        "PlayerOrgasm", "1",
                        "With a final, unbearably pleasant effort, you cum again, weakly dribbing out the last of your immediate reserves. Cetty's soft hands let go of your over-stimulated nethers and gently wrap around your abdomen. With assistance from her tentacles, she lifts you up, resting your tired body against her own. Caressing your cheek with one hand, she points to the bowl with the other.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Look, you filled it completely...♥",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "You manage to nod weakly, still shaking from the numerous overwhelming orgasms and unable to believe you managed to shoot so many loads.",
                        "Cetty doesn't move to take the cup, focused on gently cradling your limp body.",
                        "Speaks", "Thank you.♥ I hope I didn't overdo it. Are you okay?♥",
                        "You nod again. It was more intense than you would've expected from Cetty, but you cannot deny just how amazing it felt.",
                        "IfPlayerSpiritGone", "RestoreSpirit",
                        "JumpToScene", "MilkingFinal"
                      ]
                    },
                    {
                      "NameOfScene": "RestoreSpirit",
                      "theScene": [
                        "ChangeSpiritQuietly", "1",
                        "JumpToScene", "MilkingFinal"
                      ]
                    },
                    {
                      "NameOfScene": "MilkingFinal",
                      "theScene": [
                        "Once you feel like you've sufficiently recovered, you shift in Cetty's embrace, pointing to the cum-filled cup and suggesting she drinks it before it gets cold.",
                        "ChangeImageLayer", "Expression", "1", "HappyLewd",
                        "Speaks", "Oh, that's right, I get to eat all that now...",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "NaughtyFace",
                        "The two of you disentangle and Cetty gingerly picks up the almost dripping bowl of cum, embarrassment and anticipation written clearly on her face.",
                        "Speaks", "H-here goes...",
                        "ChangeImageLayer", "Expression", "1", "Licc",
                        "She brings the cup to her mouth, slowly licking her lips before starting to drink. From the second gulp, she whines in pleasure, and you see a droplet of clear fluid running down her tail from under the bikini.",
                        "ChangeImageLayer", "Expression", "1", "Pleasured",
                        "Speaks", "Ah...♥",
                        "ChangeImageLayer", "Expression", "1", "Kissy",
                        "Breaking away for a moment to take a breath, a large bubble of your cum forms and pops inside of her mouth from her panting, giving her flushed face a borderline obscene look. She then starts to greedily drink the sticky, lewd liquid again, and you watch in awe at her neck, taking in every large gulp she makes.",
                        "It doesn't take her long to empty the cup, despite the volume and the contents. Craning her head backwards, she sends the last of your sticky splooge down her throat, completely emptying the large cup with a shiver.",
                        "ChangeImageLayer", "Expression", "1", "LovingSex",
                        "Speaks", "Puah~♥",
                        "ChangeImageLayer", "Expression", "1", "Charmed",
                        "Speaks", "Hehee... Shoo good...♥",
                        "ChangeImageLayer", "Expression", "1", "Kissy",
                        "She closes her eyes, licking off any remaining cum from her lips before setting the cup down.",
                        "ChangeImageLayer", "Expression", "1", "Sleepy",
                        "Seemingly trying to calm herself down, she sits down next to it, not opening her eyes and shivering a little.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "...",
                        "Speaks", "That was amazing... I felt really naughty doing it too...",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Well... What did you think...?",
                        "Menu",
                          "'It was very sexy. Watching it made me hard again.'",
                          "'It was gross. Let's do it again some day.'",
                          "'I think I'm good never seeing that again...'",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "'It was very sexy. Watching it made me hard again.'",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Yeah, I see that...♥",
                        "ChangeImageLayer", "Expression", "1", "HappyLewd",
                        "Speaks", "But we should wait, I don't have it in me to make you cum even more right now...♥",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "'It was gross. Let's do it again some day.'",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "HappyLewd",
                        "Speaks", "Ehh? I'm getting mixed signals here.♥",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "'I think I'm good never seeing that again...'",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "I- I see... I suppose it was quite a... decadent thing to do. But thank you for letting me try once.",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Tentacle fuck.",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Okay, get naked.♥",
                        "ChangeBGM", "music/Casino/BGM06_sink.mp3",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "She says that, but her tentacles are already pulling down on your swimsuit, leaving you buck naked in a moment. Four of her tentacles wrap snugly around your limbs, lifting you a couple of inches above the deck.",
                        "The remaining tentacles align themselves to your crotch, one of them wrapping softly around your semi-hard prick, while the other moves lower, resting between your asscheeks.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Hehe... I have just the right number of tentacles for this...♥",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Cetty herself shifts closer as well, resting her soft hands over your stomach. The tentacle wrapped around your cock starts stroking up and down slowly, bringing you to full mast as she caresses your abdomen gently.",
                        "Speaks", "There... your penis is nice and hard now.♥",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "But for this, we will be focusing on another thing, won't we?♥",
                        "Her tentacle prods playfully at your anus, causing you to gasp softly. Cetty giggles and keeps teasing your anus with tickling motions, using just the tip of her slimy, translucent white appendage.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "O-okay, no more teasing.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "I need you to relax for this, after all...",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Can you do that for me? Relax and leave everything to Cetty...♥",
                        "You nod and try to relax as she says. Her tentacles are long enough to both wrap around your limbs, and comfortably support your back, so it is not particularly dificult to do. One of her hands moves from your midsection towards your butt, giving it an appreciative squeeze, before grasping unto her own tentacle, stroking it up and down.",
                        "Releasing the slick appendage, she rubs the mucus from it all over her hands, thoroughly smearing them in the transparent and slimy fluid. As her tentacle keeps working your shaft slowly, she slips one of her lubed-up fingers inside your ass, drawing a pleasured gasp from you. A drop of pre forms at the tip of your cock, quickly disappearing into the slimy mucus coming from her tentacles.",
                        "Speaks", "Fufu... feels good? And it was just a finger...♥",
                        "She begins to smoothly thrust her finger in and out of your butt, carefully but lewdly rubbing your insides. The slow anal massage feels really relaxing, but also spreads a strong, needy heat throughout your loins.",
                        "Speaks", "Shh... relax for Cetty...♥ I promise it will feel really good...♥",
                        "You moan and pant beneath her skilled touch, growing more and more loose and relaxed, only your cock growing tenser and more desperate for release as the teasingly slow stroking from her tentacle becomes even slower.",
                        "Suddenly her finger slips out of your ass smoothly, leaving behind a slightly uncomfortable emptiness, along with desire to be filled again. You whine and thrust your hips weakly, the arousal that built up inside you demanding more stimulation.",
                        "ChangeImageLayer", "Expression", "1", "NaughtyFace",
                        "Speaks", "Fufu... Here comes the tentacle.♥",
                        "PlayerOrgasmNoSpiritLoss",
                        "True to her word, you feel the slimy appendage slipping inside your waiting butthole. Despite being pretty thin at the tip, it quickly becomes much thicker than her finger, filling up your ass quite strongly. The added pressure on your prostate makes you cum a little on the spot, moaning in pleasure as you spurt a single strand of white goop over her stroking tentacle.",
                        "Speaks", "Ah, I think I'll be drinking this...♥",
                        "ChangeImageLayer", "Expression", "1", "Kissy",
                        "She leans forward, catching the tip of your cock in her mouth as her tentacles keep working on your nethers slowly. Sealing her soft lips around your glans, she sucks ever so gently, lapping up the seed as it seems to drool from your cock in a constant stream now.",
                        "Speaks", "Mmh... Tashty...♥",
                        "The tentacle lodged inside your ass starts moving back and forth, slowly at first but quickly picking up pace until it rams into your prostate at a constnat, almost overwhelming speed. You moan and shiver in delight, leaking a big load into Cetty's waiting mouth which she gulps down with no hesitation.",
                        "The tentacle working on your shaft picks up pace as well, stroking you up and down with great speed. The thick coils wrapping up your cock then start undulating, adding horizontal movement to the tentaclejob, the complex, slimy sensations making you scream in pleasure as you throw your head back.",
                        "Speaks", "Mmph...♥",
                        "As more of your cum blasts into Cetty's waiting gullet, she almost sputters, struggling to gulp down the powerful stream of semen gushing out of your cock. Stubbornly, she lowers her head, pushing more of your erection into her throat with a wet gurgle. Your eyes roll back a little as the added sensation of her throat in tandem with the anal-reaming you're getting is overwhelmingly unbearable.",
                        "More and more of your cum is being squeezed out by her skilled tentacles only to be devoured by your cum-thirsty girlfriend. No longer feeling your legs, you can only moan helplessly as your entire body seems to focus on orgasming and expelling huge loads of cum, the thrusting tentacle lodged in your ass sending warm waves of unresistable lust throughout your body.",
                        "Such a wild ejaculation cannot last long, and a moment later you dimly realize that the constant stream of cum from your cock seems to dry up. Cetty whines needily over your shaft, her forked tongue flicking across your cumslit as if demanding more. Your body is wracked by yet another powerful, but completely dry orgasm as the tentacle firmly poking at your prostate seems to finally slow down...",
                        "Just as the slimy tube slips out of your well-fucked asshole, you slip into unconsciousness, finally completely overwhelmed by the intense fucking...",
                        "PlayBlackOut",
                        "ChangeBGM", "../Mods/Beach/Music/PerituneMaterial_Whisper3_loop.mp3",
                        "...",
                        "RestPlayer",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "EndBlackOut",
                        "You come to in Cetty's embrace, cradled against her soft body by all her noodly tentacles. It seems you passed out right after that last dry orgasm. Cetty is watching over you quietly with a shy smile on her face.",
                        "Speaks", "Sorry... I got a little carried away... But I hope this was as enjoyable for you as it was for me.",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "You nod firmly in response, recalling the incredible orgasms her tentacles brought you with a flush. She beams at your response and says nothing else, still cradling you in her embrace...",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "After a while, you reluctantly part yourself from Cetty and redress. She cocks her head slightly as you turn back to her, seemingly expecting you to suggest something else you could do...",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Roleplay?",
                      "theScene": [
                        "SetChoice", "8", "RoleplayDiscussed",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Ah, like when we are fighting, but just for sex? Umm, that does sound fun... Hmm...",
                        "Speaks", "I may even have a couple of ideas I'd like to try...",
                        "Cetty goes quiet for a while, lost in thoughts, until you nudge her and ask what kind of ideas are those.",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "Oh, well... P-promise not to laugh?",
                        "You nod affirmatively and try to compose yourself as much as you can, waiting for her answer.",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Speaks", "W-well... The first idea goes like this - you are a valiant hero, a real champion of virtue. And I will be a savage sea monster, wild and uncontrollable. And... I would win.",
                        "...",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "T-the other would go like this... I would be a dark queen, regal and dominant... and perhaps a little cruel. And you would be... my hapless little prey.",
                        "ChangeImageLayer", "Expression", "1", "HappyLewd",
                        "Speaks", "Or something...",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Umm, well, just tell me if those ideas sound fun...",
                        "JumpToScene", "Roleplay."
                      ]
                    },
                    {
                      "NameOfScene": "Roleplay.",
                      "theScene": [
                        "Menu",
                          "Sea monster roleplay.",
                          "Evil domme roleplay.",
                          "Return.",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "Sea monster roleplay.",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Okay... First, let's make it night... Should make it more heroic.",
                        "TimeBecomesNight",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "There!",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Next... I'll be attacking the ship from outside, like a sea serpent. You are the great Human Hero, on his campaign to defeat the Demon Queen, and are traveling on this ship to monster continent.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "So really, you'll just have to react normally... You fight off sudden attacks from monsters all the time, right?",
                        "You nod slowly, suspecting her 'normal' is quite different from what you actually do normally, but figuring you have a pretty good grasp of what she wants.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "J-just make sure you call me 'monster' and stuff, it will be more exciting that way...",
                        "ChangeImageLayer", "BikiniTop", "1", "",
                        "ChangeImageLayer", "BikiniBottom", "1", "",
                        "ChangeImageLayer", "Expression", "1", "EyesClosed",
                        "Cetty slips out of her swimwear quietly, probably as a part of assuming her role, or perhaps in preparation for what is to come.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Okay, I'll jump into water now. When I am back, I will be the sea monster, so we'll start from then...",
                        "DisplayCharacters", "EndLoop",
                        "You watch her disappear into the waters then take a step back, retreating to the ship and preparing to act mighty and heroic...",
                        "DisplayCharacters", "1", "EndLoop",
                        "ChangeImageLayer", "BikiniTop", "1", "",
                        "ChangeImageLayer", "BikiniBottom", "1", "",
                        "ChangeImageLayer", "Expression", "1", "Scary",
                        "ChangeBGM", "../Mods/Beach/Music/PerituneMaterial_Scary_loop1_BPM96.mp3",
                        "Speaks", "RAAAAAAAAAAAAAAAAWR!",
                        "A demonic sea serpent is attacking the ship! No doubt, this is the Demon Queen sending her assassins! The vile serpent climbs unto the ship, craning the entire vessel with her mighty weight.",
                        "Your heroic spirit surging, you rush up to the demon serpent, boldly pointing your finger at her!",
                        "PlayerSpeaks", "Prepare yourself, vile monster! Uoooh!",
                        "You assume a fighting stance, your trusty invisible sword in hand...",
                        "...",
                        "ChangeBGM", "music/Loss/reason.mp3",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ScaryAroused",
                        "Speaks", "Graaarh! Too weak, Hero! You are miiine now!",
                        "You were blown away by a powerful tail strike from the sea monster! Crashing into the mast you cough and slide down weakly, air knocked out of you by the attack. The monster wastes no time and attacks again, tossing you down before climbing on top of you! Her strong arms pin you down to the ship's deck and she lets out a horrifying roar!",
                        "Speaks", "Time to eat you uuup!",
                        "ChangeImageLayer", "Expression", "1", "ScaryLicc",
                        "The demon snake leans in, unhinging her monstrous maw, and the horrible forked tongue starts dragging over your cheek, leaving a trail of slime behind... You struggle violently, trying to get away from her vile touch!",
                        "PlayerSpeaks", "Let me go! I will never submit to you demons!",
                        "ChangeImageLayer", "Expression", "1", "ScaryAroused",
                        "Speaks", "Gyahahaha!",
                        "ChangeImageLayer", "Expression", "1", "ScaryLicc",
                        "Your ineffectual flailing is quickly cut short by the cackling dragon demon, her immense strength too much to overcome in your weakened state. Her tongue keeps flicking over your face in a teasing manner.",
                        "Her wicked tentacles crawl all over your body, finally pulling down your heroic swimwear. Your traitorous and painful erection springs free as if declaring your submission, much to your own horror.",
                        "ChangeImageLayer", "Expression", "1", "ScaryAroused",
                        "Speaks", "Gyahah, what's this?! Is the Hero perhaps excited to get eaten up by the dragon?",
                        "PlayerSpeaks", "Kuh...",
                        "She brings her face uncomfortably close to yours, staring you down with her glowing eyes, her sickly sweet breath tickling your face.",
                        "Speaks", "Anssweeer meeee.",
                        "You look away in horror and embarrassment, only managing to utter a quiet 'yes'. The monster guffaws in satisfaction, gripping your face with her claws, forcing you to look at her again.",
                        "ChangeImageLayer", "Expression", "1", "ScaryLicc",
                        "Speaks", "You don't get to look away, Hero.",
                        "The serpentine monster shifts and undulates over you, aligning her slimy orifice over your stiff cock, drooling her juices all over it.",
                        "ChangeImageLayer", "Expression", "1", "ScaryAroused",
                        "Speaks", "Look! Look and despair, Hero, as your pathetic cock becomes my prey!",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "You squirm weakly, but her obscenely drooling pussy slams down abruptly, completely engulfing your cock! It throbs helplessly in submissive pleasure, almost ready to spurt just from the insertion... But the monster only shivers on top of you as she comes to a complete halt...",
                        "ChangeBGM", "music/Forest/nandesuto.mp3",
                        "ChangeImageLayer", "Expression", "1", "Pleasured",
                        "...",
                        "PlayerSpeaks", "...Ms. Sea Monster?",
                        "Speaks", "Ahn...!♥",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "S-sorry, I- I actually came a little just now... G-give me a moment...",
                        "...",
                        "ChangeImageLayer", "Expression", "1", "ScaryAroused",
                        "ChangeBGM", "music/Loss/reason.mp3",
                        "Speaks", "G-gryaaah! Surrender your seed, Hero!",
                        "She sounds almost hysterical this time, clearly struggling to keep up her monster persona... but from your perspective, it only adds to the experience.",
                        "PlayerOrgasmNoSpiritLoss",
                        "The monster begins slamming her wide, powerful hips against your crotch, her sticky and slimy pussy assailing your defeated, vulnerable cock, and you can't help but spurt a small portion of cum into her waiting womb, overwhelmed on the spot by the assault.",
                        "Speaks", "Gyahaha♥, what's this, Hero, already showing your 'white flag'?♥",
                        "Speaks", "We're only getting started! I'll draainnn you drrry!",
                        "You moan weakly in response, helplessly pinned down beneath the monstrous snake, her expert sexual assault leaving your cock a leaking, throbbing mess. The soft, slightly ribbed pussy walls are scraping strongly over your twitching glans, the intense stimulation causing you to unload deep into the serpent again, flooding her tight and warm insides with more of your heroic seed.",
                        "Speaks", "Gyahaha! That's right, give up on your mission and spurt your seed to sire more monsters!♥",
                        "ChangeImageLayer", "Expression", "1", "ScaryLicc",
                        "Speaks", "Our children will be the strongest! The offspring of the Great Human Hero and the Monster God are sure to be the most powerful!♥",
                        "You're not sure when the sea monster became a monster god, but cum again anyway, the relentless mating too much to bear, the imaginary prospect of impregnating her activating your basest of instincts.",
                        "ChangeImageLayer", "Expression", "1", "Pleasured",
                        "Actually unable to control yourself anymore, you break character, hugging your lover affectionately and calling her name as you unload even more cum into her draconic pussy. Cetty gasps and quivers in your arms, taken aback by the sudden affection.",
                        "Speaks", "H-hey if you do that...",
                        "ChangeImageLayer", "Expression", "1", "LovingSex",
                        "Speaks", "H-hyaaaanh!!!♥",
                        "The sea monster god instantly turns back into Cetty, cumming her brains out on top of you as your seed is flooding her warm womb. Reduced to a mewling mess, she collapses over you, her pussy twitching weakly over your still stiff but completely spent dick...",
                        "PlayBlackOut",
                        "TimeBecomesNormal",
                        "...",
                        "RestPlayer",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "EndBlackOut",
                        "ChangeBGM", "../Mods/Beach/Music/PerituneMaterial_Whisper3_loop.mp3",
                        "You come to laying side-to-side with Cetty, both of you still naked. She caresses your chest softly and starts giggling to herself.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Well, that didn't go so well.",
                        "You object, stating that you had a lot of fun and that she did a very good job with her character.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "I suppose... Thank you. I just wish I could do this without breaking character so easily...",
                        "ChangeImageLayer", "BikiniTop", "1", "Top",
                        "ChangeImageLayer", "BikiniBottom", "1", "Bottom",
                        "Clearly not unhappy with how things went, she redresses herself then looks at you.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "What now, {ThePlayerName}?",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Evil domme roleplay.",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "O-okay... I think I'll set the ambience next.",
                        "TimeBecomesNight",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "There! This should be more fitting for our...",
                        "ChangeImageLayer", "Expression", "1", "NaughtyFace",
                        "Speaks", "Relationship.",
                        "You ask what kind of relationship it will be.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Well... I would like you to call me 'Mistress' for this. As for your name...",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "I- I don't really want to call you 'Slave' or something...",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "So how does 'Pet' sound?",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Mistress Cetuspeanna's adorable and helpless Pet {ThePlayerName}...",
                        "ChangeImageLayer", "Expression", "1", "HappyLewd",
                        "Speaks", "...Does that sound alright?",
                        "You nod, seeing nothing wrong with the setup so far, although now you are not quite sure that Cetty will manage to act as 'evil' and 'cruel' as she hopes.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Right, so the setting is... I'm a local ruler, a tyrant, and you are the favorite... boytoy... I keep around.",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "Speaks", "In the dead of the night, I demand you visit my chambers. Naturally, you answer the summons, arrive in my bedroom and... we go from there.",
                        "You ask if you should arrive in the nude.",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "Ah, y-yes, that should be fine. I wish I had some sexy costumes for this, but I do not. But we can do this in the nude, I think.",
                        "ChangeImageLayer", "BikiniTop", "1", "",
                        "ChangeImageLayer", "BikiniBottom", "1", "",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "The both of you strip naked, putting the swimsuits out of the way. You take a moment to gawk over your lover's nude form, her skin glistening in the strange artificial light that seems to brighten this underwater ocean ever so slightly at night.",
                        "Speaks", "So um, let's start I suppose...",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "Sleepy",
                        "Cetty turns away to face the ocean and you walk a couple of steps away, preparing yourself for the session. You feel a little embarrassed, assuming the role of a pet, but cannot deny the submissive arousal building in your loins in anticipation of the act.",
                        "You try to focus on that feeling, letting it become the driving force behind your actions for this. Cetty is now your mistress, and you are her adorable, helpless pet...",
                        "You gulp down and start walking towards your Mistress. Just what kind of things will she do to you tonight...? You can only tremble in fear, and shameful anticipation, as every step brings you closer...",
                        "ChangeBGM", "music/Loss/reason.mp3",
                        "And there she is, just a few steps away... with a trembling uncertainty in your voice you announce your presence before your Lady.",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "PlayerSpeaks", "Mistress? You summoned me...",
                        "ChangeImageLayer", "Expression", "1", "Haughty",
                        "she slowly turns around, silently casting a sidelong glance in your direction. You freeze up like a deer in the headlights, taken in by her perfect curves and regal stature. You feel blessed just to witness her divine beauty in the nude.",
                        "Speaks", "Ah, you are here, my Pet. Come closer now.",
                        "Mistress's arms welcome you as you approach, her hand cupping your cheek gently. You shiver from her touch, almost melting at the mere touch of your Mistress.",
                        "Speaks", "So adorable.",
                        "Her other hand ruffles your hair. You peek shyly into her eyes and dare not look away again, as if paralyzed on the spot. Your Mistress coos softly, posessively stroking your face.",
                        "Speaks", "Do you know what we are going to do today, Pet?",
                        "Her thumb slips into your mouth, opening it for her. This makes responding more difficult, but you know she doesn't care.",
                        "PlayerSpeaks", "N-no, Mishtress...",
                        "Speaks", "Really now? I thought you'd learn your role in all this by now...",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Speaks", "As always, you will be attending to all. My. Needs.",
                        "ChangeImageLayer", "Expression", "1", "Haughty",
                        "Speaks", "Right?",
                        "PlayerSpeaks", "Y-yes, Mistress...",
                        "Her fingers grasp your tongue softly. You swallow nervously, waiting with bated breath for her next move...",
                        "Speaks", "And you already know what I need from you... don't you?",
                        "She squeezes your tongue firmly. You bat your eyelids at her wordlessly, not daring to make the wrong assumption...",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Speaks", "Now, now, Pet. Don't make your Mistress spell it out for you...",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "Haughty",
                        "Her hand releases your tongue, moving to your shoulder. With a gentle but firm push she makes you kneel. Her delightfully glistening pussy at face level, your tongue still tingling from her touch, you know what she meant. You did from the start.",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "You gingerly place your tongue at her wonderfully soft pussy. Your Mistress rewards you with a pleasured coo, ruffling your hair with her hand as you plant a kiss on her stiff clit, lapping up the sweet juices running freely from her slit. Subtle taste of sea and womanly arousal fills your senses, the fragrance of her sex sending waves of submissive arousal throughout your body as you service your Mistress.",
                        "Speaks", "Good... Good pet...",
                        "Her hand pushes your face harder into her pussy, unsubtly telling you to service her more earnestly. You oblige earnestly, licking and kissing her wonderful slit with fervor, eager to pleasure your regal Mistress.",
                        "Your attention shifts momentarily to your painfully hard dick, as it drips clear fluid on the floor in an almost constant stream. You don't dare to touch yourself without her command, all your efforts must be focused on Her pleasure. You need and {i}want{/i} to bring her joy first and foremost, anything else is of no importance.",
                        "ChangeImageLayer", "Expression", "1", "Pleasured",
                        "Speaks", "Nnn...♥",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Her hand stops you. You freeze up, looking in confusion, tongue placed over her moist pussy but unmoving.",
                        "Speaks", "Stand.",
                        "ChangeImageLayer", "Expression", "1", "Haughty",
                        "You obey, stumbling to your feet, mouth tingling with aftertaste of her feminine arousal. Her hand brushes against your face, gently wiping her juices from your chin.",
                        "Speaks", "Good pet.♥ Perhaps it's time to let you place your crude {i}thing{/i} in me.♥",
                        "Your cock throbs powerfully at her words just as your heart skips a beat, the prospect of having sex with your Mistress exciting you beyond any measure.",
                        "She traces a finger over the underside of your stiff cock. It throbs powerfully in response, leaking a copious amount of precum. Scooping up a portion of the hot fluid with her hands, she looks at the sticky strands forming between her fingers with a playful frown.",
                        "Speaks", "You are a good pet, but...♥ Your unsightly cock doesn't seem to know its place yet.♥",
                        "Your Mistress slithers sensually around you, pressing her sinful body against yours from behind. You gasp as her hand reaches around and grips your erection, firmly gripping the base.",
                        "Speaks", "If I let you put it in like that... It wouldn't do a very good job now, would it? Fufu...♥",
                        "She slowly strokes your pubic area with her hand, the hand gripping your cock's base still and unmoving.",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Speaks", "There... Your mistress will hold it for you, so cum. Cum from the touch of my hand and nothing else. You can do that much, right?♥",
                        "In your overly aroused state, the sensual whispering and the soft touch of her hand may just be enough to bring you to a messy climax. You gasp as you feel a familar orgasmic heat building in your loins with minimal stimulation, whining in embarrassment as your cock begins to throb violently, ready to release everything at her command.",
                        "Speaks", "Good, good... I see that you can. Now... {i}cum{/i}.",
                        "PlayerOrgasmNoSpiritLoss",
                        "You whine pitifully as your cock erupts, shooting ropes of sticky ivory into the air, splattering fruitlessly on the wooden floor. Her hands don't move, merely touching your cock as if to guide you through the pointless ejaculation.",
                        "The ruined orgasm doesn't last long, and soon your cock is left a rapidly throbbing, needy mess, still completely erect and only a little sore.",
                        "ChangeImageLayer", "Expression", "1", "Haughty",
                        "Speaks", "Delightful.♥",
                        "Cetuspeanna releases you from her embrace, letting you stumble away gasping and still painfully aroused. You didn't realize how wobbly your legs became from that orgasm, and how much you were leaning on your Mistress for support.",
                        "She slithers around you again, loosely surrounding you in her slick coils, placing her hands on your shoulders to straighten you out.",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Speaks", "Now, now... Are you perchance done? Even though your Mistress lets you have sex with her tonight?♥",
                        "Her words jolt you awake instantly, the prospect of disappointing her terrifying to you.",
                        "PlayerSpeaks", "N-no, Mistress, I am fine! I can keep going! Please let me keep going...!",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "Haughty",
                        "Speaks", "Good.♥",
                        "Embracing you she falls behind softly, laying on her back with you stranded helplessly on top of your Mistress, limbs hanging to the sides of her large body. You try to push yourself up into a position better suited for sex, but her hands playfully fumble your attempt and you can only hug your big mistress helplessly for support.",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Speaks", "Don't try too hard now, Pet.♥",
                        "ChangeImageLayer", "Expression", "1", "Haughty",
                        "You freeze up at her words, squeezing her apologetically in response. With a sinister giggle, your Mistress coils her numerous tentacles around your thighs, pulling you lower. Your stiff cock drags slowly over her smooth abdoment, leaving behind a shameful trace of sticky precum.",
                        "Finally you arrive at the coveted destination and, with a loud moan escaping your lips, your dick slips inside her moist pussy. You crane your head up and look at your Mistress, your mouth hanging open from pleasure as her unbearably soft inner walls assault your cock. She smiles down at you, a look of condescending adoration on her beautiful pale face.",
                        "Speaks", "What's wrong?♥ Does it feel so good that my useless little Pet can't even shake his hips?♥",
                        "Whipped into action by her scornful words you thrust forward, the act being more of a pathetic, needy hump than a real thrust, but your Mistress seems delighted as she giggles softly in response.",
                        "Speaks", "That's right... Do your best~♪",
                        "You moan helplessly as her amazing pussy assaults your weakly thrusting cock, the sensations completely overwhelming your mind. You need more of this mind-numbing sensations, more of your Mistress, but you can't muster any strength to make a proper thrust. In an act of desperation you wrap your arms around her waist and attempt to thrust harder, and fail, your best effort only managing to make you nuzzle against her soft bosom.",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
                        "Speaks", "Nnn...♥ Fufu... so cute.♥",
                        "Before long, all your thoughts are replaced with irrepressible desire to give up and flood your Mistress's wondorous insides with your seed. Your Mistress is also gasping softly, and seeing the subtle effects of lust on her composed, majestic face fills you with sincere happiness and even more arousal. Her hand cups your cheek, slowly caressing your face as she speaks up in an unusually soft voice.",
                        "Speaks", "You can't take it anymore...♥ {i}Cum{/i}.♥",
                        "ChangeImageLayer", "Expression", "1", "Pleasured",
                        "Your cock erupts loosely on her command, a huge load rushing out of your cock into your Mistress's waiting womb. You cry out in pleasure, eyes rolling back as the world around you grows dim. Thick spurts of semen are shooting inside her one after another with end, your entire body working to give everything to your Mistress...",
                        "PlayBlackOut",
                        "...",
                        "TimeBecomesNormal",
                        "RestPlayer",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "Sleepy",
                        "EndBlackOut",
                        "ChangeBGM", "../Mods/Beach/Music/PerituneMaterial_Whisper3_loop.mp3",
                        "You come to laying side-to-side with Cetty, both of you still naked, bodies pressed tightly together. She seems to be sleeping quietly, a familiar happy and relaxed expression on her face, the Dark Queen already gone without a trace... Recalling the moments of your passionate submission you can only shiver slightly, still amazed how well she handled her role, and what an effect it had on you.",
                        "Hugging her closer, you plant a soft kiss on her lips, causing your lover to murmur softly and stir awake.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Ah...",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Well, that went really well.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Did you enjoy yourself?",
                        "You nod and kiss her again, relaying your thoughts on the passionate roleplay session, praising her performance and how it helped you get into your own role.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Yeah... I even surprised myself, honestly. I was super aroused since the very beginning, so I half-expected to become a mewling mess pretty fast... Who would've thought I'd manage the whole thing?",
                        "ChangeImageLayer", "BikiniTop", "1", "Top",
                        "ChangeImageLayer", "BikiniBottom", "1", "Bottom",
                        "Deciding to take a little break both of you get up, redressing yourselves. Clearly happy with how the little roleplay went, Cetty hums a happy little tune as she slithers around you, still readjusting the straps of her bikini.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "What next, {ThePlayerName}? Maybe more roleplay?♥",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Magic play.",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Ah, you're interested? I really want to try a couple of ideas I came up with!",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "She slips up behind you, wrapping your upper body with her arms in a warm embrace.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "This may get a little intense, so let's get comfortable and relaxed, okay?",
                        "You nod, reclining backwards into her soft body and stretch your legs. Cetty shifts behind a little, giving you more space, and her tentacles expertly slip your speedo off of you.",
                        "ChangeImageLayer", "Expression", "1", "NaughtyFace",
                        "Speaks", "We won't be needing that...",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Resting her hands on your shoulders she gives them a little squeeze. You relax even more, really melting into your lover's comfortable embrace.",
                        "Speaks", "Alright, you seem ready... Here's a little magic. Close your eyes.",
                        "PlayBlackOut",
                        "She places two of her fingers over each of your eyes. You don't feel anything else and simply wait.",
                        "Speaks", "Here comes a little enchantment... There.",
                        "You feel a brief tingle in your eyes, then nothing else again. Her fingers move away, but you don't open your eyes yet, awaiting further instructions.",
                        "Speaks", "It's done, you can open your eyes now.",
                        "DisplayCharacters", "1", "1", "EndLoop",
                        "ChangeImageLayer", "Base", "2", "BaseFlush",
                        "ChangeImageLayer", "Expression", "2", "SoftSmile",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "NaughtyFace",
                        "ChangeImageLayer", "BikiniTop", "1", "",
                        "ChangeImageLayer", "BikiniBottom", "1", "",
                        "EndBlackOut",
                        "You are greeted to the sight of another Cetty, nude and aroused right in front of you. You crane your head back in confusion to make sure the real Cetty is still there. She peers down at you playfully, seemingly having fun with your reactions.",
                        "Speaks", "That's right, I'm still here. And the other Cetty is a little illusion. How does she look to you?",
                        "You look back to the magical construct again not really sure how to answer...",
                        "Menu",
                          "'She looks exactly the same.'",
                          "'The real you is more beautiful.'",
                          "'She's even prettier than you!",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "'She looks exactly the same.'",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "2", "Happy",
                        "Speaks", "Okay, that's good! That was the intent.",
                        "JumpToScene", "MagicScene"
                      ]
                    },
                    {
                      "NameOfScene": "'The real you is more beautiful.'",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "2", "ShySmile",
                        "Speaks", "Aww...♥ You're so sweet.",
                        "JumpToScene", "MagicScene"
                      ]
                    },
                    {
                      "NameOfScene": "'She's even prettier than you!",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "2", "Shy",
                        "Speaks", "D-don't say that... I know you're being silly but it's upsetting to imagine someone who is a better... me.",
                        "JumpToScene", "MagicScene"
                      ]
                    },
                    {
                      "NameOfScene": "MagicScene",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "2", "SoftSmile",
                        "Speaks", "Well, let's see what she can do... What do you want?",
                        "Speaks", "The lewd magical Cetty will do anything you desire... Just say the word.♥",
                        "ChangeImageLayer", "Expression", "1", "BigLicc",
                        "The magical projection cups her full breasts lewdly, as if offering them for ogling. Her long forked tongue slips out of her mouth and hangs down dripping wet with saliva...",
                        "Menu",
                          "Titfuck.",
                          "Tonguejob.",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "Titfuck.",
                      "theScene": [
                        "In response to your request the other Cetty shifts down, bringing her full bosom closer to your already erect dick... Squeezing her full breasts with her hands, she closely wraps them around your cock...",
                        "JumpToScene", "ActualScene"
                      ]
                    },
                    {
                      "NameOfScene": "Tonguejob.",
                      "theScene": [
                        "In response to your request the other Cetty shifts down, bringing her lewdly hanging tongue closer to your already erect dick... Dripping wet with obscene amounts of saliva, it closely wraps around your cock...",
                        "JumpToScene", "ActualScene"
                      ]
                    },
                    {
                      "NameOfScene": "ActualScene",
                      "theScene": [
                        "...And you don't feel anything.",
                        "ChangeImageLayer", "Expression", "2", "Happy",
                        "Speaks", "Hehe, tricked you~♪",
                        "ChangeImageLayer", "Expression", "2", "ShySmile",
                        "Speaks", "Sorry, the illusion is actually intangible.",
                        "True enough, you don't feel even a slight breeze on your dick, all as you watch the fake Cetty go town on it. It is actually quite a bizarre experience.",
                        "ChangeImageLayer", "Expression", "2", "Happy",
                        "Speaks", "Buuut...",
                        "All of a sudden, the illusionary dragon stops what she was doing and wraps both of her hands around your rigid length. And this time, you {i}feel{/i} it!",
                        "ChangeImageLayer", "Expression", "2", "ShySmile",
                        "Speaks", "Hehe... I am secretly using a little magic spell here. I can only make it feel like a handjob though, so that's all my illusion will do too.",
                        "ChangeImageLayer", "Expression", "2", "SoftSmile",
                        "The fake Cetty starts pumping her hands up and down slowly, the magically-illuisonary handjob feeling quite good, the soft touch of her hands feeling just like the real thing.",
                        "Speaks", "I know witches, succubi mages and other dark magic spellcasters can make this work better, but I was never good with dark magic. I also don't generate any spiritual energy, just like any monster wouldn't, so where my 'holy' element comes from is a little unclear...",
                        "ChangeImageLayer", "Expression", "2", "ShySmile",
                        "Speaks", "Oh, and ninjas can do this too, and the principle is apprently slightly different from both mine and succubi versions, but it is a well-guarded secret art so they refused to teach me... So as a magician who is purely a mana user, I...",
                        "ChangeImageLayer", "Expression", "2", "SoftSmile",
                        "The pumping hands get faster and faster even as Cetty babbles on and on about magical nature of this experience. Your throbbing cock makes it a little hard to focus on her explanation, especially with a lewd, disheveled image of your lover working your erection earnestly.",
                        "With her hands gliding smoothly and quickly across your length for quite some time now, you are already approaching a powerful and likely messy climax.",
                        "PlayerSpeaks", "Ahh, Cetty...",
                        "Speaks", "Mmm? Oh! W-wait!",
                        "ChangeImageLayer", "Expression", "2", "Panic",
                        "She snaps out of her monologue and stops her spell, leaving you at the edge of an orgasm. The illusion keeps ineffectually wacking your cock, however, so you look away from it to calm down.",
                        "ChangeImageLayer", "Expression", "2", "ShySmile",
                        "Speaks", "S-sorry, I have more spells to show but I got distracted and almost made you cum unintentionally... Let's hide the illusion now.",
                        "DisplayCharacters", "1", "EndLoop",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "With a snap of her fingers the illusionary Cetty disappears, leaving behind a shiny blue mist that disappiates quickly. Your cock throbs wistfully, feeling a little lonely, but at least you manage to focus on your conversation again.",
                        "Speaks", "Here's the next spell... It is a tiny-tiny version of the human-developed arouse spell that I'll fire rapidly at your penis. It should feel pretty good...",
                        "She hovers both her hands around your cock. They start glowing with a light pink light, and you start feeling the effects of the spell quite quickly. The sensations is pretty much what you expected from the explanation, with tiny pin-pricks of pleasure barreling down on your cock at rapid speed.",
                        "It actually feels really good, being especially intense around your glans. You moan as your previously denied cock threatens to spurt again. Cetty seems to take notice, switching one of her hands beneath your dick to catch any escaping seed cum.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Right, I can just make you cum several times... There was no sense edging you I suppose.",
                        "PlayerOrgasmNoSpiritLoss",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "With the spell coming from her waiting hand now also hitting the underside of your cock, you quickly arrive at a strong climax and erupt with hot seed, splattering her large waiting hand with a load of thick, sticky sperm. The spell seems to intensify a little during your orgasm, stimulating you nicely throughout the climax.",
                        "As your orgasm subsides you lean back into your lover relaxedly, taking note of how this orgasm didn't make you feel sore at all. Cetty nods thoughtfully as you relay the information to her.",
                        "Speaks", "Yeah, the stimulation from both spells was purely magical so it puts no real strain on your body.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "I could make you orgasm pleasantly forever! The wonders of magic. Now, give me a moment...",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "You gulp, a little nervous at the prospect of pleasantly cumming forever. Cetty scoops up most of your mess into her hand, taking a moment to drink your seed.",
                        "Speaks", "Can't let it go to waste after all.♥",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Puah~... Now, where was I... Right, the next spell.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "She hovers your hand over your dick again, wiggling her fingers a little. A number of thin, pink and slimy-looking tendrils shoot out of her fingertips, quickly wrapping up your penis from all sides.",
                        "Speaks", "This is a tweaked version of the Magical Binding spell. Instead of ropes there's these weirdly pink slimey tentacles, they're smaller and I have pretty great control over them too~♪",
                        "As she says, they begin to move up and down like a strange cocksleeve, deftly following the motions of her fingers. The tentacley mass feels like a luxurious onahole, the thin tendrils swirling and undulating as they drag across your length, each and every touch sending shivers of pleasure through your engorged dick.",
                        "Speaks", "Up and down, up and down... I am making them swirl too, does that feel good?♥",
                        "The sensations are downright alien and quickly become quite overwhelming. You shudder in her embrace, barely managing to formulate a response as your cock is assaulted by these thin noodly appendages.",
                        "PlayerSpeaks", "Y-yeah... It's- amazing...",
                        "ChangeImageLayer", "Expression", "1", "NaughtyFace",
                        "Speaks", "Okay... I can hear it in your voice, hehe. Now let's make you cum.♥",
                        "PlayerSpeaks", "H-hyahn!♥",
                        "The change in the mass of tentacles is sudden and unexplainable, raising a strange cry from you as you begin cumming on the spot. You look down in incoherent confusion, witnessing the tentacley mass pulsate and grow slightly, becoming covered in soft round bumps as they keep rotating rapidly around your orgasming cock.",
                        "Speaks", "Hehe...♥ That's a cute cry. Does it feel {i}that{/i} good?♥",
                        "PlayerSpeaks", "Y-yessh!♥",
                        "Your cock is erupting like crazy, jets of white cum rapidly flying in all directions from the ball of tentacles. Your orgasm doesn't stop there, wrecking you with unbearable pleasure as your cock begins spraying a second load right away.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Cetty slows down the arcane tentacles, milking out the second load in a more gentle fashion, and then the tentacles disappear, leaving behind your rapidly deflating dick, thoroughly stained in slime and cum...",
                        "PlayBlackOut",
                        "...",
                        "RestPlayer",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "EndBlackOut",
                        "ChangeBGM", "../Mods/Beach/Music/PerituneMaterial_Whisper3_loop.mp3",
                        "You wake up in the same position, still in Cetty's gentle embrace. She is stroking your head quietly, not saying anything until you move a little.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Ah, are you awake?",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "That was quite something else, huh?",
                        "You utter a shy 'yeah' in response, feeling a bit embarrassed by your helpless cries as the tentacle mass worked its magic on your cock.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Thank you for letting me play around with my magic, {ThePlayerName}. It was fun.♥",
                        "She kisses the top of your head softly.",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Horn machine...?",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Eh? What about it?",
                        "You ask if she wants to use it for something sexy. She seemed to enjoy it during the demonstration.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "I- I suppose I did. Well, if you're interested...",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "Speaks", "Be gentle though, okay? Electricity is kinda scary to me.",
                        "JumpToScene", "Horn machine play."
                      ]
                    },
                    {
                      "NameOfScene": "Horn machine play.",
                      "theScene": [
                        "ChangeBGM", "music/Casino/BGM06_sink.mp3",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "R-right, give me a moment to fetch it.",
                        "DisplayCharacters", "EndLoop",
                        "SwapLineIf", "Choice",
                          "10", "ZapperExamined", "Cetty gracefully slithers inside the ship, disappearing from view and leaving you alone for a while. You spend the time idly wondering how to use the strange toy, given how different it is, and how sensitive Cetty is to electricity and just pleasure in general.",
                          "10", "ZapperDiscussed", "Cetty gracefully slithers inside the ship, disappearing from view and leaving you alone for a while. You kick back and relax, figuring she'll be wiping herself off again in preparation, idly wondering if you should've helped her with that.",
                        "EndLoop",
                        "SwapLineIf", "Choice",
                          "10", "ZapperExamined", "You wait and wait, feeling a little worried over how long she's been gone by now. Finally, you hear her moving through the ship upstairs, the slimy, dragging sound of her thick tail becoming familiar to you by now.",
                          "10", "ZapperDiscussed", "Finally, you hear her moving through the ship upstairs, the slimy, dragging sound of her thick tail unmistakable to you.",
                        "EndLoop",
                        "DisplayCharacters", "1", "EndLoop",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "She emerges from the ship, the ancient device in hand, looking at you sheepishly.",
                        "Speaks",
                        "SwapLineIf", "Choice",
                          "10", "ZapperExamined", "S-sorry I took a while. I wiped myself off with a towel, it should make the electricity less... overwhelming.",
                          "10", "ZapperDiscussed", "Sorry it takes a while to wipe myself off, but I think it really helps with the toy.",
                        "EndLoop",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "SwapLineIf", "Choice",
                          "10", "ZapperExamined", "She hands you the toy and simply stands there, uncertain how to proceed. You sit down and beckon her to your lap, figuring it'd be better for her to lay down for this. Shy blushes but does as you say, resting her larger upper body against your own. She is quite heavy, but you prop your back against the ship's port for support.",
                          "10", "ZapperDiscussed", "She hands you the toy and waits for you to sit down with a smile. You lean against the ship's port again, beckoning her to your lap. Cetty moves and rests her larger body against yours, playfully rubbing her head against your chest.",
                        "EndLoop",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "You pat her head gently, drawing a girlish giggle from your lover, and begin fiddling with the electric toy.",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "SwapLineIf", "Choice",
                          "10", "ZapperExamined", "A rotating part near the toy's handle seems to control how much electricity the toy will release on use. Right now, it is set to a middle value, with no special icons indicating what that means. On other hand, the min and max values have little icons next to them, both depicting Voltlin faces. The face next to 'min' wears a loose, slutty expression clearly overwhelmed by pleasure, while the 'max' one has a more focused, hungry look.",
                          "10", "ZapperDiscussed", "",
                        "EndLoop",
                        "SwapLineIf", "Choice",
                          "10", "ZapperExamined", "You idly wonder if the icons are not supposed to be the other way around, and also if the toy will even have same results on a Sea Slug-Dragon as it does on Voltlins, but figure that you'll learn soon enough...",
                          "10", "ZapperDiscussed", "",
                        "EndLoop",
                        "SetChoice", "10", "ZapperDiscussed",
                        "Which setting do you use today?",
                        "Menu",
                          "Low setting, slutty Voltlin.",
                          "High setting, horny Voltlin.",
                        "EndLoop"
                      ]
                    },
                    {
                      "NameOfScene": "Low setting, slutty Voltlin.",
                      "theScene": [
                        "Turning the handle all the way to 'min', you give the power button an experimental press. A small electrical charge runs through the device, forming a tiny crackling ball at the horn's tip. Cetty's ear tentacles start wiggling worriedly as she hears the sound, but she does not move. You take her hand and silently give it a reaffirming squeeze, and she squeezes back affectionately.",
                        "PlayerSpeaks", "Here goes...",
                        "Speaks", "O-okay...",
                        "You softly tap the tip of Cetty's cutely orange horns with the device, sending the charge into her body. She startles and shivers a little in your hands, but doesn't even make a squeak otherwise. You ask how she is feeling.",
                        "Speaks", "...Nothing special? I think. There's this nice, subtle heat in my body, but I don't feel different otherwise.",
                        "You zap her other horn in a similar manner. Hher ear tentacles straighten out for a moment, but start wiggling as usual soon enough.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Still nothing... Are you using low power mode? Maybe try switching it up?",
                        "With a hum you take the metal device to her horn again, for a longer period this time. Her body jolts like before at the initial contact, but manages to relax over time, even as you keep the device in contact with her.",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "MildlyAroused",
                        "Cetty seems to blush harder, seemingly starting to feel the effects more. You switch to her other horn and keep charging her up, carefully looking over her reactions. You ask how she feels again.",
                        "Speaks", "I-I-i-i-iiiii...",
                        "ChangeImageLayer", "Expression", "1", "HappyLewd",
                        "She doesn't seem able to speak with the electrical currents rushing through her body right now, and simply breaks into a giggling fit. You pull the horn away with a chuckle and ask again.",
                        "Speaks", "Heeheehee... That was funny...",
                        "ChangeImageLayer", "Expression", "1", "MildlyAroused",
                        "Speaks", "I'm definitely feeling it now. I guess that's how low power mode has to be used... Do that again!",
                        "You oblige her request, zapping the tip of her horn yet again. She doesn't jump up this time, simply enjoying the sensations as more and more electricity runs through her head...",
                        "ChangeImageLayer", "Base", "1", "BaseFullBodyBlush",
                        "ChangeImageLayer", "Tits", "1", "",
                        "ChangeImageLayer", "ArmsBase", "1", "",
                        "ChangeImageLayer", "ArmsTop", "1", "",
                        "ChangeImageLayer", "Expression", "1", "Pleasured",
                        "You held it in place for a good minute now, and the effects really start showing. Cetty's body is flushed the deepest purple you've ever seen on her, a loose panting expression of pleasure plastered on her face.",
                        "Speaks", "Ahhh...♥ {TPN}-{TPN}-{TPN}-{ThePlayerName}, I feel really weird...♥",
                        "ChangeImageLayer", "Expression", "1", "Aroused",
                        "Speaks", "Like... I'm cumming but can't cum...? Touch me?♥",
                        "You nod and set aside the mechanical horn, making sure you turned it off. Returning your attention to your horny, over-charged sea dragon, you softly place your hands on her tits. She shivers at your touch, moaning loudly as her hands grip yours.",
                        "ChangeImageLayer", "BikiniTop", "1", "",
                        "You slip her top to the side, allowing her wonderful bosom to bounce free. Her skin is hot to the touch, much hotter than it normally is. Cetty mewls quietly as you flick across her stiff nipples, and gasps sharply when you give her boobs a firm squeeze.",
                        "ChangeImageLayer", "Expression", "1", "Pleasured",
                        "Speaks", "W-wow this feels really, really intense...♥ Rub them more, {ThePlayerName}...♥",
                        "You wrap your arms beneath her soft boobs, tugging her upwards now that you don't need to focus on her horns. Cetty whines needily when you do that, clearly desperately longing for your touch. You whisper a soothing encouragement and squeeze her breasts again, making her moan and start panting even harder than before.",
                        "You shift one of your hands lower, slipping it into her drenched bikini bottoms. It is a little far, given how large your lover is, but you manage.",
                        "ChangeImageLayer", "Expression", "1", "Helpless",
                        "Her drooling pussy is scaldingly hot, and seems to start cumming as soon as your fingers brush up against her clit.",
                        "Speaks", "Hiiii~♥",
                        "Your fingers are instantly sprayed with copious amounts of pussy juice. Surprisingly enough, her body does not convulse as much as it does when she orgasms normally. You hold her tighter, squeezing her stiff nipple as she rides out an intense orgasm in your embrace.",
                        "Speaks", "Mooore, more!♥",
                        "ChangeImageLayer", "Expression", "1", "Oface",
                        "Not waiting for her orgasm to subside you slip your fingers into her convulsing pussy, three of them slipping into her drenched sex with smooth ease. She cums again, and seemingly keeps cumming every time you thrust your fingers, her loud and incoherent screams resounding through the underwater room without end.",
                        "As she is cumming, you note that her body seems to cool down a little every time. Resolving to make her cum her brains out until she becomes nice and cool to the touch as usual, you redouble your fingering efforts. Cetty is needily screaming for more, completely on board with your plan.",
                        "Speaks", "{ThePlayerName}, thish is sho good!♥ {ThePlayerName}!!!♥",
                        "You place your thumb over her clit, rubbing it in slow circular motions as your fingers keep massaging her warm, moist inner walls. She cums harder and harder every time, and her body starts flailing around more as well, making it difficult to keep holding her.",
                        "The electrical heat almost gone from her body, you decide to send her off with one last intense orgasm, squeezing her nipple and her clit, clamping down on the stiff nubs powerfully. Cetty's scream becomes so high-pitched you can no longer hear it, her tail smacking across the ship's mast so powerfully you worry she might break it.",
                        "ChangeImageLayer", "Expression", "1", "Torogao",
                        "Finally she collapses in your arms, and you pull your hands away from her over-stimulated pussy and bosom. Cetty is drooling a little, giggling softly as she pants for breath in your embrace...",
                        "PlayBlackOut",
                        "...",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "BikiniTop", "1", "Top",
                        "ChangeImageLayer", "Tits", "1", "Titties",
                        "ChangeImageLayer", "ArmsBase", "1", "ArmsRest",
                        "ChangeImageLayer", "Expression", "1", "Sleepy",
                        "EndBlackOut",
                        "ChangeBGM", "../Mods/Beach/Music/PerituneMaterial_Whisper3_loop.mp3",
                        "Cetty passed out in your embrace for a while. You took the chance to redress her and waited for her to wake up, soothingly stroking your lover as she slept.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Speaks", "Nnn...?",
                        "ChangeImageLayer", "Expression", "1", "ShySmile",
                        "Speaks", "Ah...",
                        "Speaks", "That was... amazing. I don't think I can cum so many times in a row normally...",
                        "ChangeImageLayer", "Expression", "1", "Sleepy",
                        "You lean down and plant a gentle kiss on her lips. She kisses back softly, her hands caressing your face.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Your lips part slowly. You can't help but smile as you see her happy face, her eyes glittering as she looks back at you lovingly.",
                        "Speaks", "Thank you for this, {ThePlayerName}. I liked being in your control like that.♥",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "High setting, horny Voltlin.",
                      "theScene": [
                        "You crank the power all the way up and press the power button. The device crackles loudly, a large lightning ball forming at its tip, with bright charges running across the entire length.",
                        "Cetty's ear tentacles start wiggling worriedly as she hears the sound, but she does not move. You take her hand and silently give it a reaffirming squeeze, and she squeezes back affectionately.",
                        "PlayerSpeaks", "Here goes...",
                        "Speaks", "O-okay...",
                        "You touch the tips of the fake horn and her real one, and her entire body jerks powerfully from the charge. She gasps a little, but doesn't react much otherwise, much to your surprise.",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "Pleasured",
                        "You charge up the device and tap the other horn in the same manner, getting a little more reaction this time. She lets out a sharp gasp, followed by a long moan and squeezes your hand powerfully. You power down the device for now and ask how she feels.",
                        "ChangeImageLayer", "Expression", "1", "NaughtyFace",
                        "Speaks", "...",
                        "Her silence worries you at first, but then she lets out a giggle. A high-pitched, almost hysterical giggle...",
                        "ChangeImageLayer", "Base", "1", "BaseFullBodyBlush",
                        "ChangeImageLayer", "Tits", "1", "",
                        "ChangeImageLayer", "ArmsBase", "1", "",
                        "ChangeImageLayer", "ArmsTop", "1", "",
                        "ChangeImageLayer", "Expression", "1", "Charmed",
                        "Speaks", "{TPN}-{TPN}-{TPN}-{ThePlayerName}, we're fucking now.♥",
                        "Before you manage to react, Cetty squirms around in your embrace, before grabbing you and tossing you to the deck forcefully.",
                        "ChangeImageLayer", "BikiniTop", "1", "",
                        "ChangeImageLayer", "BikiniBottom", "1", "",
                        "Descending on top of you, she tears away your swimsuits and manages to plunge your still flaccid cock into her pussy. Everything happens so fast that you can barely register what is happening, and the first thing you notice consciously is how unbearably {i}hot{/i} her body is.",
                        "A spell hits you all of a sudden, sending shivers of pleasure through your body, and a rush of blood to your dick. You look up in confusion and see Cetuspeanna readying another powerful-looking spell in her hands, a crazied lustful expression on her face",
                        "Speaks", "Hurry and get hard.♥",
                        "PlayerOrgasm", "1",
                        "She doesn't wait for a response and unleashes the spell, wracking your body with another forceful wave of arousal. Your dick cums a little on the spot, spurting a rope of sticky seed inside her abnormally heated pussy, but becomes painfully hard. Cetty smiles loonily starts rocking her hips, seemingly satisfied with your erection.",
                        "Speaks", "I'll apologize later but right now you're my toy.♥",
                        "She talks and acts unusually fast, as if super-charged by the toy's electrical currents. Her hips almost a blur as she mashses her tight, hot and drenched pussy against your pelvis, your cock hopelessly trapped inside her.",
                        "Your mind finally catching up with the sudden attack, you start feeling a sense of helpless submissive pleasure welling inside of you, as your body is assaulted by your overly aroused lover. You try to thrust back, but it's almost impossible to keep up with her crazied pace.",
                        "Cetty seems to be cumming non-stop, her pussy convulsing around your shaft like crazy even as she thrusts her hips at a breakneck pace. You can only moan and kick back, the overwhelming intensity of this coupling quickly becoming too much for you.",
                        "PlayerOrgasm", "1",
                        "You shudder and cum again, a load of cum quickly squeezed out by the intense sex. Cetty doesn't seem to notice, still fucking you wildly like a woman posessed even as some of your cum sprays out of her pussy.",
                        "ChangeImageLayer", "Expression", "1", "LovingSex",
                        "A moment later she cums as well, more powerfully than the other orgasms she seemd to be having. Her back arches as she throws her head back and screams on top of her lungs. Your cock is almost crushed inside her powerfully squeezing dragon pussy, but she quickly falls on top of you, suddenly completely loose and unresponsive.",
                        "Speaks", "Aaaaaaaaa...♥",
                        "PlayBlackOut",
                        "...",
                        "RestPlayer",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Tits", "1", "Titties",
                        "ChangeImageLayer", "ArmsBase", "1", "ArmsRest",
                        "ChangeImageLayer", "BikiniTop", "1", "Top",
                        "ChangeImageLayer", "BikiniBottom", "1", "Bottom",
                        "ChangeImageLayer", "Expression", "1", "Panic",
                        "EndBlackOut",
                        "ChangeBGM", "../Mods/Beach/Music/PerituneMaterial_Whisper3_loop.mp3",
                        "Speaks", "S-sooorry!!! I'm so sorry {ThePlayerName}, I didn't want to hurt you...",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "You reassure her that you are fine, admitting to how much you enjoyed the 'assault' to reassure her further. She blushes more at that, but otherwise seems to calm down a little.",
                        "ChangeImageLayer", "Expression", "1", "PoutAvert",
                        "Speaks", "Okay...",
                        "Speaks", "I mean... It was kind of amazing, but let's be more careful with the toy...",
                        "JumpToScene", "MainHubHome"
                      ]
                    },
                    {
                      "NameOfScene": "Return.",
                      "theScene": [
                        "JumpToScene", "SexMenu"
                      ]
                    },
                    {
                      "NameOfScene": "Leave.",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "You stand up, stating that you should be leaving now. Cetty looks a little sad but nods and gets up as well.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks", "Okay, I'll take you back to the island then.",
                        "ChangeImageLayer", "Expression", "1", "SoftSmile",
                        "Cetty picks you up gently, wrapping you in her tentacles first and in the magic shield next, and takes off...",
                        "ChangeBG", "../Mods/Beach/Images/underwater.png",
                        "...",
                        "ChangeBG", "../Mods/Beach/Images/surface.png",
                        "...",
                        "ChangeBG", "../Mods/Beach/Images/altar.png",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "After another speedy and very scenic but overall uneventful journey, you arrive back at the altar island. Setting you to the land, Cetty retreats back into the water and gives you a little wave.",
                        "Speaks", "Come see me soon, okay?"
                      ]
                    }
                ]
}
