{
    "name": "Underwater Cave",
    "CardType": "Event",
    "CardLimit": "1",
    "Description": "A partially explored cavern stands by the oceanside. Adventurers reported creepy sounds coming from the inside.",
    "requires": [""],
    "Speakers": [
                  {
                    "name": "Messina",
                    "postName": "",
                    "SpeakerType": "Monster"
                  },
                  {
                    "name": "???",
                    "postName": "",
                    "SpeakerType": "?"
                  },
                  {
                    "name": "MessinaSpook",
                    "postName": "",
                    "SpeakerType": "Monster"
                  },
                  {
                    "name": "Nereid",
                    "postName": "",
                    "SpeakerType": "Monster"
                  }
                ],
    "EventText": [
                    {
                        "NameOfScene": "EventStart",
                        "theScene":[  "As you trek through the beach, the sand gets gradually replaced with a more rocky terrain. Eventually you spot a small cavern up ahead, located on a rocky cliff.",
                                      "AllowInventory",
                                      "Its entrance faces upwards at an angle, and seawater occasionally splashes inside when brought by waves. You suspect the cavern must get flooded completely when the tide rises. Faint sounds can be heard from the inside, a quiet gurgling sound and occasional splashes.",
                                      "Menu",
                                        "Explore the cave!",
                                        "Ignore...",
                                      "EndLoop"
                                  ]
                    },
                    {
                        "NameOfScene": "Ignore...",
                        "theScene":[  "DenyInventory",
                                      "Deciding not to enter the cavern, you climb over the rocky cliff and keep walking until it disappears from view. Oddly enough, there wasn't anyone around.",
                                      "After taking a short breather you continue to explore the sandy beach."
                                  ]
                    },
                    {
                        "NameOfScene": "Explore the cave!",
                        "theScene":[  "DenyInventory",
                                      "ChangeBG",
                                      "templeBlue.png",
                                      "ChangeBGM", "music/Caverns/Purple Planet Music - Tense - Melancholia (1_24) 96bpm.mp3",

									  "ProgressEquals", "1",
										"Meeting Again",

									  "ProgressEquals", "2",
										"SecondMeetingDeclinedMassage",

									  "ProgressEquals", "3",
										"Repeated Meeting",

									  "Descending into the cavern you find yourself stepping on wet, rocky steps. They seem to form a natural staircase, making the descent easier.",
                                      "As you proceed deeper, the bright sunlight slowly disappears, giving place to opressive darkness. The cave is damp, narrow and it gets increasingly difficult to breathe.",
									  "Soon enough your descent is halted as you arrive at the bottom. The cavern continues further in at a more comfortable angle. It never gets too dark as you keep going, due to occasional sun ray breaking into the cavern through narrow cracks in the ceiling.",
                                      "Eventually you arrive at a fork. The main path descends lower again, and is completely flooded, preventing you from following it.",
									  "The side path is located on the wall near the ceiling, and leads slightly upwards. Climbing inside, you find yourself crouching in front of a narrow passage. For a moment you wonder if you should just give up and turn back but decide to see this through.",
									  "The passage is short, and after a few turns you arrive in a spacious room. The room is better lit than the rest of the cave, thanks to a large hole in the ceiling at the room's corner.",
									  "Most of the room is dominated by a large underground lake. Approaching it, you notice something floating inside...",

                                      "SetProgress",
                                      "1",
                                      "JumpToScene",
                                      "First Squiding"
                                    ]
                    },
                    {
                        "NameOfScene": "First Squiding",
                        "theScene":[  "ChangeBGM",  "../Mods/Beach/Music/In_The_Terror.mp3",


									  "DisplayCharacters", "3", "EndLoop",
                                      "A body... There is a body floating in the lake!",
                                      "Pale skin... and long, dark hair splayed over the water's surface... Floating face down, the figure appears completely lifeless.",
									  "...Did somebody drown?",
									  "...",
									  "...How unfortunate.",
									  "In that case, you should deliver their body back to the town. They deserve a proper burial at least, and their family needs to know...",
									  "This is what a Hero should do after all.",
									  "Resolving yourself to the grim task you gulp down and carefully enter the lake. It's not very deep, but the water's biting chill sends a shiver up your bones.",
									  "Carefully, slowly you take each step to make sure the lake's depth does not change suddenly. Thankfully the change is slow with no pitfalls. Soon enough you are chest-deep in water. The cold is becoming almost unbearable, but you force yourself to keep a proper pace.",
									  "Finally you make it to your grim destination. On a closer inspection the body appears to be female, and completely naked.",
									  "You gently tap on her shoulder and turn her body over. Most of her face is concealed by the long hair. Putting your arm under her, you raise her torso from the water. She is cold to touch...",
									  "ChangeBGM",  "../Mods/Beach/Music/In_The_Terror.mp3",
									  "ChangeImageLayer", "Expression", "1", "Crooked",
									  "The body shifts, her head turning to face you, a crooked smile forming on her lips as she speaks!",
                                      "Speaks2",
									  "My prince charming...",
									  "PlayerSpeaks",
									  "AAAAAAAHH!",
									  "ChangeBGM", "music/Battle/Goodbye.mp3",
									  "You panic, pushing away the 'corpse' and try to get away. However, numerous tentacles shoot out of the water, preventing your escape!",
									  "ChangeImageLayer", "Base", "1", "Spooky Tentacles",
									  "Mercilessly they grab you, restraining your limbs and forcing you back to face the floating thing.",
									  "As you flail and struggle fruitlessly, the pale figure closes in, her thin arms reaching out, grasping, clawing...",
									  "PlayerSpeaks",
									  "NOOOO!",
									  "ChangeImageLayer", "Base", "1", "Submerged",
									 "ChangeImageLayer", "Expression", "1", "Base_Submerged",
									  "Her hands rest on your chest, her long fingers tracing your exposed pecs gently and almost... apologetic?",
                                      "Menu",
                                        "Huh?",
									    "AaAAAAaAaaAahhH!",
                                      "EndLoop"
                                    ]
                    },
					{
					"NameOfScene": "Huh?",
                                "theScene":["...",
									  "PlayerSpeaks",
									  "...Huh?",
									  "ChangeBGM", "music/Relaxing/Purple Planet Music - Gentle - Meltwater (1_38) (L).mp3",
									 "ChangeImageLayer", "Expression", "1", "Embarrassed_Submerged",
									  "When you take a closer look at her she doesn't look as terrifying as you thought at first, and her flushed face is anything but corpse-like.",
									  "Speaks2",
                                      "Fufu... Sorry...",
									  "She speaks in a small voice, very slowly. You'd have trouble hearing her if she wasn't so close.",
									  "Speaks2",
                                      "Did I... startle you..?",
                                      "Menu",
									    "Y- yes!",
                                        "N- no, not at all.",
                                      "EndLoop"
                                        ]
							},
                            {
                                "NameOfScene": "Y- yes!",
                                "theScene":[  "She gets closer, her nude body almost pressing against yours. Her hands still caress you subtly, as if trying to soothe you.",
                                              "Speaks2",
                                              "There... there... It's okay, I am not scary... am I..?",
											  "PlayerSpeaks",
											  "...I guess not?",
											  "ChangeImageLayer", "Expression", "1", "HappyBlushSubmerged",
											  "Speaks2",
											  "...Yay♪.",
                                              "JumpToScene",
                                              "Finally Introduction"
                                          ]
                            },
                            {
                                "NameOfScene": "N- no, not at all.",
                                "theScene":[
											  "ChangeImageLayer", "Expression", "1", "HappySubmerged",
                                              "Speaks2",
                                              "Hehe... Okay...",
                                              "JumpToScene",
                                              "Finally Introduction"
                                            ]
                            },
                            {
                                "NameOfScene": "AaAAAAaAaaAahhH!",
                                "theScene":[
											  "ChangeImageLayer", "Expression", "1", "PanicSubmerged",
											  "You flail and struggle fruitlessly in the grasp of tentacles, sending the cold water splashing everywhere.",
                                              "Speaks2",
                                              "Ah... P- please, don't...",
											  "The pale woman recoils back, waiting patiently for your outburst to die down...",
											  "After another moment you finally manage to calm yourself, but the firm grasp of tentacles on your limbs keeps you uneasy.",
											  "ChangeBGM", "music/Relaxing/Purple Planet Music - Gentle - Meltwater (1_38) (L).mp3",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed_Submerged",
											  "The pale woman draws closer again. Taking a closer look at her, she doesn't look as terrifying as you thought at first. Her flushed face is anything but corpse-like.",
											  "Speaks2",
											  "Fufu... I am sorry... for startling... you...",
											  "She speaks in a small voice, very slowly. You'd have trouble hearing her if she wasn't so close.",
                                              "JumpToScene",
                                              "Finally Introduction"
                                            ]
                            },
                            {
                                "NameOfScene": "Finally Introduction",
                                "theScene":[  "With the adrenaline rush after the initial shock gone, you start feeling cold again. Very cold in fact, as you find your teeth chattering and body shivering.",
												"ChangeEnergy",
												"-50",
											  "ChangeImageLayer", "Expression", "1", "WorrySubmerged",
                                              "She looks at you worriedly.",
                                              "Speaks2",
                                              "...Oh no... You are cold. Here, grab on me...",
											  "The tentacles push you unto her before receding and letting you go. You wrap your arms around her neck for support, as remaining upright otherwise is difficult in this cold. She hugs back, holding you close.",
											  "You feel a sudden jerk as the woman moves, easily speeding through the water and arriving at the shore in a single push.",
											  "Still holding you she slowly moves over the ground for a while before putting you down in the sunlit portion of the room.",
											  "DisplayCharacters", "1", "EndLoop",
											  "ChangeImageLayer", "Base", "1", "Base",
											  "ChangeImageLayer", "Expression", "1", "Worry",
												"Now that you're out of water, it is obvious the tentacles belong to her. This pale woman is obviously some kind of aquatic monster.",
												"After putting you down she retreats some distance away and sits down neatly, looking at you quietly.",
                                              "Speaks2",
											  "Are you feeling... warmer...?",
											  "Feeling a little better but still shivering you only manage a shaky nod in response.",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "She gives a tiny smile in response and waits patiently as some time passes before you warm up enough to speak...",
											  "PlayerSpeaks",
											  "Who- who are you?",
                                              "Speaks2",
											  "I am... Messina. A sea Scylla...",
											  "PlayerSpeaks",
											  "Nice to meet you, Messina... I am {ThePlayerName}.",
											  "ChangeImageLayer", "Expression", "1", "Happy",
                                              "Speaks",
											  "Okay♪. Nice... to meet you... {ThePlayerName}.",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "...",
											  "Another moment passes in awkward silence. Or it is only awkward for you, as the Scylla seems content to remain silent as she looks over you.",
											  "PlayerSpeaks",
											  "So umm... What were you doing in there?",
                                              "Speaks",
											  "I was... sleeping... Why did you... try to... pick me up..?",
											  "PlayerSpeaks",
											  "Uhh... Sorry. I saw you and thought someone had drowned, and...",
											  "ChangeImageLayer", "Expression", "1", "Worry",
                                              "Speaks",
											  "Oh... I understand. I should be... more careful, not to confuse people...",
											  "ChangeImageLayer", "Expression", "1", "AvertBlush",
											  "...",
											  "She looks away and her face gets red again...",
											  "PlayerSpeaks",
											  "Umm... you seem pretty flushed, are you okay?",
											  "ChangeImageLayer", "Base", "1", "Shy",
											  "ChangeImageLayer", "Expression", "1", "ShyCoveredBlush",
											  "She blushes even harder and covers her face with her hands.",
                                              "Speaks",
											  "I am... naked in front of a man... It is embarrassing, so...",
											  "PlayerSpeaks",
											  "A- ah, s- sorry. I am okay now so you don't have to-",
											  "She nods and slithers back to the lake, slipping soundlessly into the water, completely disappearing under its surface.",
											  "DisplayCharacters", "2", "EndLoop",
											  "Deciding it might be time to leave, you get up and walk up to the lake.",
											  "PlayerSpeaks",
											  "So umm... I'll be going now.",
											  "She pops her head out of water.",
                                              "Speaks",
											  "Okay... come visit again... {ThePlayerName}.",
											  "You nod and bid farewell to the quiet Scylla. On your way out of lake room, you still feel a little awkward over the entire interaction. At least there weren't any corpses.",
											  "JumpToScene",
											  "Leave"
                                            ]
                            },
							{
								"NameOfScene": "Meeting Again",
								"theScene":[  "Deciding to meet Messina again you navigate through familiar caverns and quickly arrive at her underground lake.",
											  "DisplayCharacters", "1", "EndLoop",
											  "She is sitting on the rocks by the lake, her numerous tentacles folded neatly around her. She notices your presence and gives you a small smile.",
											  "ChangeBGM", "music/Relaxing/Purple Planet Music - Gentle - Meltwater (1_38) (L).mp3",
											  "Speaks",
											  "Hello... {ThePlayerName}.",
											  "Menu",
												"You're not naked today.",
												"Cute swimsuit.",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "You're not naked today.",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "I was... hoping you'd visit... so...",
											  "She trails off and goes quiet.",
											  "JumpToScene",
											  "HelpOffer"
											]
							},
							{
								"NameOfScene": "Cute swimsuit.",
								"theScene":[ "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Thank you... I bought... a new one for...",
											  "She trails off and goes quiet.",
											  "...",
											  "JumpToScene",
											  "HelpOffer"
											]
							},
							{
								"NameOfScene": "HelpOffer",
								"theScene":[ "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "HEY-",
											  "ChangeImageLayer", "Expression", "1", "Panic",
											  "Speaks",
											  "Ah- umm, sorry... I didn't mean to speak... so loudly.",
											  "ChangeImageLayer", "Base", "1", "Shy Bikini",
											  "ChangeImageLayer", "Expression", "1", "ShyCoveredBlush",
											  "Speaks",
											  "...",
											  "PlayerSpeaks",
											  "That's okay... What did you want to say?",
											  "ChangeImageLayer", "Base", "1", "Bikini",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "Are you... a hero? An adventurer?",
											  "You nod in response and she claps her hands together happily.",
											  "Speaks",
											  "Then... maybe you need help?",
											  "PlayerSpeaks",
											  "...Sure.",
											  "Speaks",
											  "Okay, then...",
											  "She pulls out a potion from behind a rock and hands it to you.",
											  "GiveItem",
											  "1",
										      "Calming Potion",
											  "Speaks",
											  "I hope this helps...",
											  "PlayerSpeaks",
											  "Thank you!",
											  "Speaks",
											  "I can also...",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Give you... a- a m-massage...",
											  "Menu",
												"Yes, please.",
												"...Are you implying something sexual?",
												"No, thank you.",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "Yes, please.",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "HappyBlush",
											  "Speaks",
											  "...Yay♪.",
											  "Speaks",
											  "Then... come over here.",
											  "JumpToScene",
											  "FirstMassage"
											]
							},
							{
								"NameOfScene": "...Are you implying something sexual?",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "ShyBlush",
											  "Speaks",
											  "Nooo... My massage will help you relax, make you stronger... A hero should be strong, right..?",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "But if you get... aroused... I can- ah... help too...",
											  "Speaks",
											  "Um... so, do you want a... massage?",
											  "Menu",
												"Yes, please.",
												"No, thank you.",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "No, thank you.",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Sad",
											  "She looks a little disappointed, her shoulders slumping.",
											  "Speaks",
											  "Okay... Maybe some other time...",
											  "JumpToScene",
											  "WrapupDeclinedMassage"
											]
							},
							{
								"NameOfScene": "FirstMassage",
								"theScene":[ "Messina leads you to a large, smooth boulder. It is pretty round, so you imagine lying down on it might be a little awkward.",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Sorry... There is no better place here...",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "Umm... Lie on your stomach, please.",
											  "You do as instructed and lie down, glad to discover that the rock isn't as chilly as you could expect.",
											  "PlayerSpeaks",
											  "Ah-!",
											  "The hands that rest on your back, however, are rather cold, having made you yelp in surprise. She removes her hands in a hurry.",
											  "ChangeImageLayer", "Expression", "1", "WorryBlush",
											  "Speaks",
											  "Is- is something wrong..?",
											  "PlayerSpeaks",
											  "Your hands are quite cold...",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Ah, oh, I am sorry...",
											  "Speaks",
											  "I'll warm them up... Haaa... haaa...",
											  "She breathes on her hands and rubs them together for a moment.",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "Here...",
											  "She places her hands on your back again, her long fingers caressing your body gently, letting you get used to her touch.",
											  "Gradually she increases the force behind her movements, massaging out the tension in your muscles with her skilled touch.",
											  "As her hands work your upper back and neck, you feel wet, slimy appendages begin to massage your legs...",
											  "IfFetishLevelEqualOrGreater", "Monstrous", "3", "MassageFetishIntro",
											  "Menu",
												"Let her continue.",
												"Tentacles?",
												"Fantasize...",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "MassageFetishIntro",
								"theScene":[
								"You gulp down at the first touch of her wet appendages. Unbidden fantasies of losing yourself in a myriad of slick scylla tentacles flood your mind and your body heats with arousal.",
											  "IfFetishLevelEqualOrGreater", "Monstrous", "10", "FetishFail",
											  "Menu",
											    "RequiresStat", "Willpower", "10",
												"Calm yourself.",
												"Tentacles...",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "Calm yourself.",
								"theScene":[
												"Despite your inclinations you take a quiet, deep breath and resolve yourself to a normal massage. It is the polite thing to do, probably.",
												"JumpToScene",
												"Let her continue."
											]
							},
							{
								"NameOfScene": "Tentacles...",
								"theScene":[
												"JumpToScene",
												"FetishFail"
											]
							},
							{
								"NameOfScene": "FetishFail",
								"theScene":[
								"Your intense desire for the monstrous quickly overwrites all reason and you fail to control yourself, shuddering in pleasure under the slithering carress.",
											    "JumpToScene",
											    "MassageFetish"
											]
							},
							{
								"NameOfScene": "Let her continue.",
								"theScene":[
												"The suction effect of her suckers combined with slimy undulating caress of her tentacles is oddly calming and honestly feels amazing, as all stress and tension seems to melt under her tentacles.",
												"ChangeArousal",
												"30",
											    "ChangeImageLayer", "Expression", "1", "Base",
											    "Speaks",
												"Hmm mm♪",
												"Messina hums a quiet tune as she works on your muscles, timing her movements in tact with the song.",
												"Mostly done with your legs and back, her unoccupied tentacles begin to slip underneath you, briefly touching on your obliques.",
												"ChangeArousal",
												"20",
											    "Speaks",
											    "Okay... Turn over now, I'll do your front...",
												"IfPlayerArousalOverPercentOfMax",
												"50",
												"HappyEnding",
											    "JumpToScene",
											    "NormalEnding"
											]
							},
							{
								"NameOfScene": "Tentacles?",
								"theScene":[ "Feeling a little worried you spoke up.",
											    "Speaks",
											    "Yes... It is... part of the massage.",
											    "ChangeImageLayer", "Expression", "1", "Worry",
											    "Speaks",
												"You don't like them..?",
												"PlayerSpeaks",
												"No, it's fine.",
											    "ChangeImageLayer", "Expression", "1", "Base",
												"You relax and give in to her touch and the alien sensations on your legs quickly prove to be rather pleasant.",
											  "Menu",
												"Let her continue.",
												"Fantasize...",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "Fantasize...",
								"theScene":[ "You relax and bask in her touch, the alien sensations of her tentacles quickly proving as pleasant as you had hoped.",
												"The suction effect of her suckers combined with slimy undulating caress of her tentacles would be calming if it wasn't so arousing, as you let your mind wander and imagine the pale Scylla caressing your body more intimately.",
												"ChangeArousal",
												"50",
											    "ChangeImageLayer", "Expression", "1", "NaughtyBlush",
											    "Speaks",
												"Hmm mm♪",
												"Seemingly oblivious to your growing arousal Messina hums a quiet tune as she works on your muscles, timing her movements in tact with the song. Your imagination runs wild as you picture her squiggly wet tentacles slithering all over your crotch, milking out a thick load and making a huge sticky mess of your cum and her mucus...",
												"Mostly done with your legs and back, her unoccupied tentacles begin to slip underneath you, briefly touching on your obliques. You supress a moan and gulp down as you long for her slick tentacles to worm in deeper underneath you, to caress and wrap around your painfully hard erection...",
												"ChangeArousal",
												"70",
											    "Speaks",
											    "Okay... Turn over now, I'll do your front...",
											    "IfPlayerArousalOverPercentOfMax",
												"40",
												"HappyEnding",
											    "JumpToScene",
											    "NormalEnding"
											]
							},
							{
								"NameOfScene": "MassageFetish",
								"theScene":[
								 "ChangeImageLayer", "Expression", "1", "Embarrassed",
								"Your arousal builds fast, and being in such intimate proximity with her wonderful, slimy monster appendages proves too much for you as you shiver uncontrollably and fail to supress a moan.",
								"Messina leans in closer, her hot breath tickling your ear as she whispers.",
								 "ChangeImageLayer", "Expression", "1", "NaughtyBlush",
								"Speaks",
								"Naughty... boy...♥",
											  "Menu",
											   "RequiresStat", "Willpower", "8",
												"Sorry.",
												"Ahhh... Tentacles...",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "NormalEnding",
								"theScene":[ 	"You nod and roll over, having a little difficulty to settle in a comfortable position on the rounded boulder. Messina senses your discomfort and slips in one of her thicker tentacles underneath your shoulders. With your upper body supported like that you feel snug and comfy.",
								"PlayerSpeaks",
								"Thank you.",
								 "ChangeImageLayer", "Expression", "1", "Happy",
								"She nods briefly and gets back to work, her tentacles resuming massaging your legs and shoulders as her hands now focus on your chest.",
								"As the massage goes on you feel completely relaxed, almost as if you are melting from her touches. She really is good at this.",
								"You feel completely rejuvenated and invigorated with newfound energy!",
								"ChangeEnergyByPercent",
								"100",
								 "ChangeImageLayer", "Expression", "1", "Embarrassed",
								"The massage goes lower and lower, reaching your lower abdomen and you idly wonder if she's going to do something naughty next. You realize she could do anything she wanted with you at this point, given how relaxed you are right now.",
								"Her hands go over your crotch and shift lower, meeting with her tentacles at your thighs before leaving your body.",
								 "ChangeImageLayer", "Expression", "1", "Base",
								"MODDER NOTE: this should also give a temporary stat buff once Thresh implements them. Sorry for the immersion-breaking interjection, carry on!",
								"Speaks",
								"There... all done... How do you feel?",
											  "Menu",
											   "RequiresStat", "Allure", "10",
												"You skipped a part...",
												"That was great, thank you.",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "You skipped a part...",
								"theScene":[ "Speaks",
									"...",
								    "ChangeImageLayer", "Expression", "1", "Embarrassed",
									"Speaks",
									"...Yes.",
								    "ChangeImageLayer", "Expression", "1", "Erotic",
								    "Her hands rest right on your crotch, only a thin piece of fabric separating her long fingers from your dick.",
									"Speaks",
									"This part... Right here... Yes?",
									"Speaks",
									"It didn't seem... stiff enough for a massage... But maybe I was wrong...♥",
									"She pulls off your swimwear, wraps both of her hands over your rapidly growing erection and gives it a couple of experimental long strokes.",
									"Speaks",
									"Hehe, it got stiff quickly...♥",
									"As the slow, gentle handjob gradually picks up pace her tentacles grow restless as well, crawling and wrapping around your limbs and torso as well.",
									"One of the tentacles slips lower, resting beside her arms and caressing your thigh.",
									"Speaks",
									"I can think... of more than one part... that I skipped...♥",
									"IfSensitivityEqualOrGreater", "Ass", "120", "ProstateMassageNoQuestion",
									"One of her hands leaves your dick and squeezes one of your butt cheeks gently.",
											  "Menu",
												"Let's skip that one thing.",
												"Sounds good...",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "Let's skip that one thing.",
								"theScene":[
								    "ChangeImageLayer", "Expression", "1", "Embarrassed",
									"Speaks",
									"...Okay.",
									"She gives a little shrug and returns her hand to your dick, placing her palm on your glans and rubbing the tip in circular motions as her other hand works your shaft.",
								"ChangeArousalQuietly", "15",
								"Her gaze remains glued to your dick as she begins to stroke it with her hand. Just like the massage before, her handjob feels really good and your dick throbs in delight from her expert touch.",
								"ChangeArousalQuietly", "30",
								"Stroking it up and down in loose, somewhat business-like manner with one hand, she caresses your abdomen slowly with the other.",
								"ChangeArousalQuietly", "40",
								"Her index finger shifts and caresses your glans and frenulum gently as the rest of her hand works your throbbing shaft and you gasp quietly in delight, a droplet of precum forming at your tip.",
								"ChangeArousalQuietly", "50",
								"Just like during the massage Messina chooses to remain completely quiet and only lewd, wet sounds of the handjob resound in the dark cave as she speeds up her strokes.",
								"ChangeArousalQuietly", "75",
								"With your arousal building for a while before, it doesn't take long for your dick to twitch in anticipation of spilling its hot load. Before you can even warn your 'masseuse' of the impending orgasm, she points your dick up towards your stomach and cups her free hand beneath its engorged tip.",
								"PlayerOrgasmNoSpiritLoss",
								"Your cock finally erupts with a thick load, which she expertly guides into her waiting hand, somehow not spilling a drop despite the impressive force and volume of your ejaculation.",
								"She keeps stroking as she squeezes out the last droplets of spunk from your softening dick and then lets go, to bring her hands together and better cup your load.",
								"ChangeImageLayer", "Expression", "1", "Erotic",
								"Still not uttering a word she gulps everything down, letting out uncharacteristically lewd, gulping sounds as she laps up your sticky ejaculate from her palms.",
								"ChangeImageLayer", "Expression", "1", "Embarrassed",
								"Speaks",
								"Thank you... for the meal...",
								"Speaks",
								"Did you... enjoy the massage... and the 'massage'..?",
								"PlayerSpeaks",
								"Yes... That was great, thank you.",
											    "JumpToScene",
												"That was great, thank you."
											]
							},
							{
								"NameOfScene": "ProstateMassageNoQuestion",
								"theScene":[
									"One of her hands leaves your dick and squeezes one of your butt cheeks gently. Her touch emits a quiet pleasured moan from your lips.",
									"Messina smiles and rests her middle finger against your anus, making you twitch in anticipation. Her other hand slowly works over your shaft, urging on your excitement.",
									"Speaks",
									"I see you really... need that massage...♥",
											    "JumpToScene",
												"Prostate Massage"
											]
							},
							{
								"NameOfScene": "Sounds good...",
								"theScene":[
								    "ChangeImageLayer", "Expression", "1", "Erotic",
									"Speaks",
									"Yes... I'll make it good... really good...♥",
											    "JumpToScene",
												"Prostate Massage"
											]
							},
							{
								"NameOfScene": "Prostate Massage",
								"theScene":[
								    "ChangeImageLayer", "Expression", "1", "Erotic",
									"Her long finger slips into your anus smoothly, gradually sliding deeper until it rests against your prostate. Your dick twitches and drools a droplet of precum in response.",
									"ChangeArousalQuietly", "25",
									"Sloppy wet sounds fill the air as her handjob smears your precum over your dick slowly. You moan quietly as the finger lodged in your ass begins to move and gently massage your sensitive prostate.",
									"ChangeArousalQuietly", "45",
									"Her handjob never speeds up and remains slow, teasing but really pleasureful. On the other hand, the fingers gently knocking against your prostate get more insistent and bold, rolling around and teasing your overfilled gland in an almost obsessive manner. Your lower body is flooded with pleasant heat as your dick drools clear liquid without end",
									"ChangeArousalQuietly", "90",
									"The hand stroking your dick gets ever slower but you don't care, as the attack on your ass leaves your legs quaking and your desire to cum becomes almost unbearable. You feel overwhelmed, weak, and incredibly aroused.",
									"ChangeArousalQuietly", "180",
									"Her tentacles wrap around your legs slowly, as if offering gentle, reassuring support. The handjob slows down to the occasional long sensual stroke, only serving to keep you on the edge. Your head feels hot and it is difficult to focus on anything but the burning heat inside your prostate. You whine quietly and thrust your hips weakly, uncertainly seeking release, or perhaps more teasing, denying pleasure.",
									"ChangeArousalQuietly", "360",
									"Speaks",
									"Shh...♥ It's... okay... just let go and enjoy... feel really good...",
									"The handjob stops. The skilled finger in your ass get even wilder than before, knocking on your prostate and sending pleasant shivers through your entire body, but for some reason you still cannot cum.",
									"ChangeArousalQuietly", "720",
									"Messina leans in, her long hair draping over you as she whispers quietly.",
									"Speaks",
									"Okay...♥ now... cum... Cum for Messina...♥",
									"PlayerOrgasmNoSpiritLoss",
									"Her words send you off and you cum, hard, spilling impossible amounts of seed on your stomach as she plants a chaste kiss on your forehead.",
									"You just keep cumming, the intruding finger making you shoot weakly with each prode, again and again. You cum so much that your seed spills to the sides from your stomach, soiling Messina's tentacles and the ground.",
									"Finally your orgasm stops, leaving you panting for air, sweaty but also completely relaxed and satisfied.",
									"Messina pulls away, her lips leaving a pleasant tingling on your forehead. Her finger slips out of your anus, her hand giving your butt a little appreciative pat.",
									"Her tentacles move and quickly wipe off your cum from your stomach with surprising effectiveness.",
								    "ChangeImageLayer", "Expression", "1", "Embarrassed",
									"Speaks",
									"Okay... All done now...♥ Did you enjoy... cumming like that..?♥",
									"You manage to nod weakly in response.",
									"Speaks",
									"Okay... I enjoyed it too...♥",
									"She helps you off the rock, supporting you with her tentacles until your legs stop shaking and you can stand on your own.",
								    "ChangeImageLayer", "Expression", "1", "AvertBlush",
									"Speaks",
									"Hehe... sorry... That might have been too much...",
								    "ChangeImageLayer", "Expression", "1", "Base",
									"Speaks",
									"Okay... now...",
											    "JumpToScene",
												"MassageWrapup"
											]
							},
							{
								"NameOfScene": "HappyEnding",
								"theScene":[
								"You nod and roll over, having a little difficulty to settle in a comfortable position on the rounded boulder. Your semi-erect cock straining against the swimsuit isn't helping your cause either. Messina senses your discomfort and slips in one of her thicker tentacles underneath your shoulders. With your upper body supported like that you feel snug and comfy.",
								"PlayerSpeaks",
								"Thank you.",
								 "ChangeImageLayer", "Expression", "1", "Happy",
								"She nods briefly and gets back to work, her tentacles resuming massaging your legs and shoulders as her hands now focus on your chest.",
								 "ChangeImageLayer", "Expression", "1", "Embarrassed",
								"She seems to be doing her best to ignore your hard-on, but you notice her shooting it a few quick glances as she goes.",
								"As the massage goes on, with the exception of your dick you feel completely relaxed, almost as if you are melting from her touches. She really is good at this.",
								"You feel completely rejuvenated and invigorated with newfound energy!",
								"ChangeEnergyByPercent",
								"100",
								"MODDER NOTE: this should also give a temporary stat buff once Thresh implements them. Sorry for the immersion-breaking interjection, carry on!",
								"Her hands shift lower and lower, reaching your lower abdomen and you idly wonder if she's going to do something about your erection next.",
								 "ChangeImageLayer", "Expression", "1", "Embarrassed",
								"She stops her hands at your crotch and silently looks up at you for confirmation.",
								"Speaks",
								"...?♥",
											  "Menu",
												"Nod...",
												"Shake your head.",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "Nod...",
								"theScene":[
								"You nod and she silently squeezes your dick through the swimwear. Without saying anything she pulls them down, letting your erection bounce free.",
								"Her gaze remains glued to your dick as she begins to stroke it with her hand. Just like the massage before, her handjob feels really good and your dick throbs in delight from her expert touch.",
								"ChangeArousalQuietly", "30",
								"Stroking it up and down in loose, somewhat business-like manner with one hand, she caresses your abdomen slowly with the other.",
								"ChangeArousalQuietly", "40",
								"Her index finger shifts and caresses your glans and frenulum gently as the rest of her hand works your throbbing shaft and you gasp quietly in delight, a droplet of precum forming at your tip.",
								"ChangeArousalQuietly", "50",
								"Just like during the massage Messina chooses to remain completely quiet and only lewd, wet sounds of the handjob resound in the dark cave as she speeds up her strokes.",
								"ChangeArousalQuietly", "75",
								"With your arousal building for a while before, it doesn't take long for your dick to twitch in anticipation of spilling its hot load. Before you can even warn your 'masseuse' of the impending orgasm, she points your dick up towards your stomach and cups her free hand beneath its engorged tip.",
								"PlayerOrgasmNoSpiritLoss",
								"Your cock finally erupts with a thick load, which she expertly guides into her waiting hand, somehow not spilling a drop despite the impressive force and volume of your ejaculation.",
								"She keeps stroking as she squeezes out the last droplets of spunk from your softening dick and then lets go, to bring her hands together and better cup your load.",
								"ChangeImageLayer", "Expression", "1", "Erotic",
								"Still not uttering a word she gulps everything down, letting out uncharacteristically lewd, gulping sounds as she laps up your sticky ejaculate from her palms.",
								"ChangeImageLayer", "Expression", "1", "Embarrassed",
								"Speaks",
								"Thank you... for the meal...",
								"Speaks",
								"Did you... enjoy the massage... and the 'massage'..?",
								"PlayerSpeaks",
								"Yes... That was great, thank you.",
											    "JumpToScene",
												"That was great, thank you."
											]
							},
							{
								"NameOfScene": "Sorry.",
								"theScene":[
												"Speaks",
												"Okay... then be a good client... and enjoy the massage... And maybe something good will happen later...♥",
												"You shiver as her hands and tentacles return to work, marveling at the alien sensations of her tentacles touching your body, awash with pleasure, and hopes and anticipation for whatever will happen later.",
												"The suction effect of her suckers combined with slimy undulating caress of her monstrous tentacles is incredibly arousing and honestly feels amazing, flooding you with obscene lust and desire.",
												"At the same time, you feel completely rejuvenated and invigorated with newfound energy!",
												"ChangeEnergyByPercent",
												"100",
												"MODDER NOTE: this should also give a temporary stat buff once Thresh implements them. Sorry for the immersion-breaking interjection, carry on!",
												"ChangeArousal",
												"70",
											    "ChangeImageLayer", "Expression", "1", "Naughty",
											    "Speaks",
												"Hmm mm♪",
												"Messina hums a quiet tune happily as she works on your muscles, timing her movements in tact with the song and seemingly ignoring your aroused panting. Some of her tentacles play around, teasingly stroking your buttocks, wrapping around your arms, patting your head...",
												"ChangeArousal",
												"90",
												"Finally done with the massage, her unoccupied tentacles slip underneath you, touching on your obliques as she leans in.",
												"ChangeArousal",
												"120",
											    "Speaks",
											    "Okay, good job enduring all that...♥ Turn over now, and I'll do something really nice...♥",
												"With haste you roll over, making the Scylla giggle in amusement as she settles you down in her numerous appendages. Wasting no time she pulls off your swimwear and rests four of her tentacles around your stiff erection.",
											    "ChangeImageLayer", "Expression", "1", "Erotic",
											    "Speaks",
											    "Okay, and now...♥ I will stroke... all over your penis...♥ with my tentacles...♥",
												"You gulp down, your dick throbbing in anticipation at her words, almost ready to burst just from her words.",
											    "Speaks",
											    "It will feel really good... so... here...♥",
												"She takes both your hands in her own, squeezing them lightly before giving you a reassuring smile.",
											    "ChangeImageLayer", "Expression", "1", "NaughtyBlush",
											    "Speaks",
											    "Something to hold unto...♥ And... feel free to moan as much as you want...♥",
												"Her tentacles move quickly, wrapping around your dick and smearing it completely in mucus. Sliding smoothly over your length they begin to dance, rolling into slick coils to stroke and fuck your instantly overwhelmed erection.",
											    "ChangeImageLayer", "Expression", "1", "Erotic",
												"ChangeArousal",
												"150",
												"The coiling tentacles shiver, vibrate and undulate, never stopping to stroke you up and down, left and right, sending shivers of pleasure through your entire being as you moan and grasp at her hands desperately for support.",
												"PlayerOrgasmNoSpiritLoss",
												"One of the tentacles slips into the coils from the top, playfully poking and teasing at your frenulum and sends you over the edge, making you spray semen everywhere from the tight coils as your jaw goes slack with pleasure.",
												"The tentaclejob doesn't stop as you orgasm, the cum-smeared tentacles seemingly intend to overwhelm you completely and continue their sloppy, slick dance of coils and you keep cumming uncontrollably, your loud moans echoing in the empty cavern.",
												"ChangeArousalQuietly",
												"1000",
											    "Speaks",
											    "Good job...♥ You're letting out such nice sounds...♥ I'll keep stroking so moan some more for me..!♥ Keep soiling my tentacles!♥♥",
											    "PlayerSpeaks",
											    "Ahh! C-cumming again!!♥♥",
												"PlayerOrgasmNoSpiritLoss",
												"You splooge again without finishing your previous orgasm, splattering everything around the two of you with hot semen.  Messina coos and giggles quietly, the intense tentaclejob finally slowing a bit as she brings you down from your orgasm high.",
												"The tentacles uncoil and release your sore dick, baring your completely cum-soaked crotch for both of you to see.",
											    "Speaks",
											    "Fufu...♥ Look at this mess...♥ I am glad you liked it so much...♥",
											    "PlayerSpeaks",
											    "Aahh...♥",
												"JumpToScene",
												"FetishPathWrapup"
											]
							},
							{
								"NameOfScene": "Ahhh... Tentacles...",
								"theScene":[ "Already somewhat delirious you needily grasp on her tentacles, making Messina gasp cutely in response.",
												"ChangeArousal",
												"50",
											    "ChangeImageLayer", "Expression", "1", "AvertBlush",
									"Speaks",
									"Aww... you are hopeless...♥",
									"ChangeImageLayer", "Expression", "1", "NaughtyBlush",
									"Speaks",
								"Then... we'll just have to combine... the massages.♥",
								"She slithers behind you and flips you over, resting your head on her breasts and rest of your body on her tentacles.",
								"ChangeArousal",
								"15",
								"All her tentacles wrap around your body, pulling off your swimwear and begin to rub you everywhere, making you gasp in pleasure. She leans in and whispers hotly as her hands massage your shoulders.",
								"ChangeArousal",
								"25",
								"Speaks",
								"I will massage... everything...♥ and tease your penis a lot...♥ so behave now... okay..?♥",
								"ChangeArousal",
								"35",
								"You shudder and only manage a nod in response as her tentacles work your body mercilessly.",
								"ChangeArousal",
								"45",
								"The tentacle wrapped around your dick is pumping it methodically. The undulating motion intermixed with her slimy suckers sticking to your dick feels amazing, making you spurt prematurely on the spot.",
								"PlayerOrgasm", "1",
								"ChangeImageLayer", "Expression", "1", "HappyBlush",
								"Speaks",
								"Soo... needy...♥ Sorry, let's slow down...♥",
								"ChangeImageLayer", "Expression", "1", "NaughtyBlush",
								"The pumping tentacle simmers down, gently squeezing out the last of your spunk before resuming the tentaclejob slowly.",
								"Speaks",
								"Here... I'll pump nice and slow...♥ so you can last through the massage.♥",
								"The rest of her monstrous tentacles pick up the pace, the dancing movements of her skillful massage flooding you with obscene lust and desire.",
								"At the same time, you feel completely rejuvenated and invigorated with newfound energy!",
								"ChangeEnergyByPercent",
								"100",
								"MODDER NOTE: this should also give a temporary stat buff once Thresh implements them. Sorry for the immersion-breaking interjection, carry on!",
								"With the tension in your muscles gone completely, her tentacles stop working and rest on your body. All except one, that keeps methodically pumping your stiff prick.",
								"Speaks",
								"Almost done...♥ Now let's make you spurt again...♥",
								"The rest of her tentacles crawl closer to your crotch, slithering between the coils of the pumping tentacle as it picks up pace. You moan loudly and Messina leans in, planting a brief kiss on your lips, sending you over the edge.",
								"PlayerOrgasmNoSpiritLoss",
								"You flood the tentacle coils with another load, amazed at how good it feels to spill everything in their tight prison.",
								"As your orgasm ends the tentacles pull away, revealing your cum-soaked crotch.",
								"Speaks",
								"Look at that mess...♥ You must really like tentacles... You big pervert...♥",
								"PlayerSpeaks",
								"Aahh...♥",
								"IfPlayerSpiritGone",
                                "RefillSpirit",
								"JumpToScene",
								"FetishPathWrapup"
											]
							},
							{
							"NameOfScene": "RefillSpirit",
								"theScene":[
								 "ChangeSpirit",
								"1",
								"JumpToScene",
								"FetishPathWrapup"
											]
							},
							{
								"NameOfScene": "FetishPathWrapup",
								"theScene":[
												"You are still overwhelmed and fail to make a meaningful response, making the Scylla giggle again.",
												"Shifting she helps you get up, supporting you until you regain your senses enough to stand on your own.",
												"Speaks",
												"I am glad... you enjoyed yourself...",
												"ChangeImageLayer", "Expression", "1", "Base",
												"Speaks",
												"Okay... now...",
											    "JumpToScene",
												"MassageWrapup"
											]
							},
							{
								"NameOfScene": "That was great, thank you.",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Happy",
											  "Speaks",
											  "I am... glad...",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Messina's tentacles recede and she helps you get up from the boulder. She appears lost in thought as her hands linger on your torso for a while longer before she snaps back to attention and removes them hastily.",
											    "JumpToScene",
												"MassageWrapup"
											]
							},
							{
								"NameOfScene": "WrapupDeclinedMassage",
								"theScene":[ "Messina's tentacles fidget with uncertainty before waving you away in a gentle motion.",
											  "Speaks",
											  "Well, you should go and... finish your adventure... But I'd be glad to see you again.",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Maybe you'll be up for a massage next time...",
											  "PlayerSpeaks",
											  "Will I find you here again?",
											  "ChangeImageLayer", "Expression", "1", "Sad",
											  "Speaks",
											  "Yes... I will be here... for a while.",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "Please come... and visit.",
											  "You nod and wave a goodbye to the timid Scylla, intent on finishing your adventure.",
											  "SetProgress",
											  "2",
											    "JumpToScene",
												"Leave"
											]
							},
							{
								"NameOfScene": "WrapupDeclinedMassageAgain",
								"theScene":[ "Messina's tentacles fidget with uncertainty before waving you away in a gentle motion.",
											  "Speaks",
											  "Well, you should go and... finish your adventure... But I'd be glad to see you again.",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Maybe you'll be up for a massage next time...",
											  "Speaks",
											  "Please come... and visit.",
											  "You nod and wave a goodbye to the timid Scylla, intent on finishing your adventure.",
											  "SetProgress",
											  "2",
											    "JumpToScene",
												"Leave"
											]
							},
							{
								"NameOfScene": "SecondMeetingDeclinedMassage",
								"theScene":[ "Deciding to meet Messina again you navigate through familiar caverns and quickly arrive at her underground lake.",
											  "DisplayCharacters", "1", "EndLoop",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "She is sitting on the rocks by the lake, her numerous tentacles folded neatly around her. She notices your presence and gives you a small smile.",
											  "ChangeBGM", "music/Relaxing/Purple Planet Music - Gentle - Meltwater (1_38) (L).mp3",
											  "Speaks",
											  "Hello... {ThePlayerName}.",
											  "ChangeImageLayer", "Expression", "1", "Worry",
											  "Speaks",
											  "Would you like... a massage now..?",
											  "Menu",
												"Yes.",
												"Not today, thank you.",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "Yes.",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Happy",
											  "Speaks",
											  "...Yay♪.",
											  "Speaks",
											  "Then... come over here.",
											  "JumpToScene",
											  "FirstMassage"
											]
							},
							{
								"NameOfScene": "Not today, thank you.",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Sad",
											  "She looks a little disappointed, her shoulders slumping.",
											  "Speaks",
											  "Aww... Okay... Maybe next time...",
											  "JumpToScene",
											  "WrapupDeclinedMassageAgain"
											]
							},
							{
								"NameOfScene": "MassageWrapup",
								"theScene":[
											"ProgressEquals",
											"3",
											"RepeatMassageWrapup",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "You should go and... finish your adventure... But I'd be glad to see you again.",
											  "PlayerSpeaks",
											  "Will I find you here again?",
											  "ChangeImageLayer", "Expression", "1", "Sad",
											  "Speaks",
											  "Yes... I will be here... for a while.",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "Please come... and visit.",
											  "You nod and wave a goodbye to the timid Scylla, feeling energized and ready to finish your adventure.",
											  "SetProgress",
											  "3",
											"JumpToScene",
											"Leave"
											]
							},
							{
								"NameOfScene": "Repeated Meeting",
								"theScene":[ "Deciding to meet Messina again you navigate through familiar caverns and quickly arrive at her underground lake.",
											  "DisplayCharacters", "1", "EndLoop",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "She is sitting on the rocks by the lake, her numerous tentacles folded neatly around her. She notices your presence and gives you a small smile.",
											  "ChangeBGM", "music/Relaxing/Purple Planet Music - Gentle - Meltwater (1_38) (L).mp3",
											  "Speaks",
											  "Hello... {ThePlayerName}.",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Here... take this.",
											  "JumpToScene",
											  "RandomItem"
											]
							},
							{
								"NameOfScene": "RandomItem",
								"theScene":[ "JumpToRandomScene",
											"CalmingPotion",
											"CalmingPotion",
											"EnergyPotion",
											"EnergyPotion",
											 "SoothingPotion",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "CalmingPotion",
								"theScene":[ "GiveItem", "1", "Calming Potion",
											  "JumpToScene",
											  "Received Item"
											]
							},
							{
								"NameOfScene": "EnergyPotion",
								"theScene":[ "GiveItem", "1", "Energy Potion",
											  "JumpToScene",
											  "Received Item"
											]
							},
							{
								"NameOfScene": "SoothingPotion",
								"theScene":[ "GiveItem", "1", "Soothing Potion",
											  "JumpToScene",
											  "Received Item"
											]
							},
							{
								"NameOfScene": "Received Item",
								"theScene":[ "PlayerSpeaks",
											  "Thank you!",
											  "ChangeImageLayer", "Expression", "1", "Happy",
											  "Speaks",
											  "You're... welcome...",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Menu",
												"Chat with Messina.",
												"RequiresChoice", "2", "Battlefucking",
												"Spar",
												"Ask for a massage.",
												"Leave the cave.",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "MainHub",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Menu",
												"Chat with Messina.",
												"Ask for a massage.",
												"RequiresChoice", "2", "Battlefucking",
												"Spar",
												"Leave the cave.",
											  "EndLoop"
											]
							},
							{
								"NameOfScene": "Chat with Messina.",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Menu",
												"What are you doing in this cave?",
												"Why don't you attack me?",
												"RequiresChoice", "1", "Vacation",
												"Vacation?",
												"RequiresChoice", "2", "Confidence",
												"Confidence?",
												"RequiresChoice", "2", "Nanpa",
												"Up for more confidence training?",
												"RequiresChoice", "2", "Battlefuck",
												"We should change our training regimen.",
												"RequiresChoice", "2", "BattlefuckAllowed",
												"I spoke with Tina...",
                                                "Done talking.",
											  "EndLoop"
										  ]
							},
							{
								"NameOfScene": "What are you doing in this cave?",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "Umm... I am on a vacation...",
											  "SetChoice", "1", "Vacation",
											  "PlayerSpeaks",
											  "Wouldn't it be more fun on the beach?",
											  "ChangeImageLayer", "Expression", "1", "Shy",
											  "Speaks",
											  "Noo... I am no good around many people... Or with heat...",
											  "PlayerSpeaks",
											  "...Why come to the beach then?",
											  "ChangeImageLayer", "Expression", "1", "Naughty",
											  "Speaks",
											  "That's a... secret...",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "But... Scyllas like swimming... So it isn't that strange, right?",
											  "PlayerSpeaks",
											  "...I guess.",
											  "PlayerSpeaks",
											  "So when I found you... naked... what were you doing?",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "I was... napping...",
											  "PlayerSpeaks",
											  "Sorry. Did I startle you?",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "No... I woke up when you entered water.",
											  "PlayerSpeaks",
											  "...Why didn't you say anything?",
											  "ChangeImageLayer", "Expression", "1", "Naughty",
											  "Speaks",
											  "Hehe... I wanted to spook you... Hehehe...",
											  "She giggles some more when she sees your expression, then covers her mouth and looks away for a moment.",
											  "ChangeImageLayer", "Expression", "1", "Apologetic",
											  "Speaks",
											  "Umm, I am sorry... I often hear that my sense of humor is... unsavory.",
											  "...",
											  "JumpToScene",
											  "Chat with Messina."
										  ]
							},
							{
								"NameOfScene": "Why don't you attack me?",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "Because... I am on a vacation...",
											  "SetChoice", "1", "Vacation",
											  "Speaks",
											  "I want to take it easy... And...",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "I was not allowed on the resort... unless I promised to be nice.",
											  "PlayerSpeaks",
											  "Huh, why?",
											  "Speaks",
											  "I am too strong for... new heroes who may come here...",
											  "PlayerSpeaks",
											  "I see...",
											  "JumpToScene",
											  "Chat with Messina."
										  ]
							},
							{
								"NameOfScene": "Vacation?",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "Yes... Oh, I guess it is a permanent one now? Umm...",
											  "ChangeImageLayer", "Expression", "1", "Sad",
											  "Speaks",
											  "I was fired from my workplace... So I came here to unwind and... and uhh, nevermind.",
											  "PlayerSpeaks",
											  "Sorry to hear that... Why were you fired?",
											  "Speaks",
											  "I was a masseuse at a parlor in the capital... But I am not very good with clients... Or sometimes I am too good...",
											  "PlayerSpeaks",
											  "...? What do you mean?",
											  "ChangeImageLayer", "Expression", "1", "Shy",
											  "Speaks",
											  "I am a bit shy... so some clients were unhappy. Others liked my massages so much that they started to send gifts... One man even begged in public to marry him...",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "I made all sorts of trouble really... One elf liked my 'happy endings' too much... so she kept coming in every day and got in debt to pay for it... Her family filed a complaint and the parlor went under investigation for illegal hypnosis extortion practices...",
											  "ChangeImageLayer", "Expression", "1", "Worry",
											  "Speaks",
											  "Uuuh... There was no hypnosis of course... But it still troubled my boss a lot.",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Then there was this one bunny girl... She got very horny every session and kept extending service time... I had to work overtime whenever she came by...",
											  "ChangeImageLayer", "Expression", "1", "WorryBlush",
											  "Speaks",
											  "Ahh... I sound like a prostitute don't I? But I really just wanted to give people massages...",
											  "PlayerSpeaks",
											  "...I am not sure I understand. Some trouble aside, it sounds like you made a lot of money for your boss. Why would that get you fired?",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "Ahh... Well, my boss is a very laid back person... She couldn't handle all the excitement... So at some point she begged me to retire... and I accepted.",
											  "PlayerSpeaks",
											  "Do you miss your job?",
											  "ChangeImageLayer", "Expression", "1", "Avert",
											  "She looks away then nods, slowly.",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "I think so... I was thinking of opening my own parlor...",
											  "ChangeImageLayer", "Expression", "1", "Worry",
											  "Speaks",
											  "But that sounds so scary... Managing a business all by myself... I don't have enough confidence...",
											  "Speaks",
											  "Ah, umm... sorry for talking your ear off... Let's change the subject.",
                                                "IfChoice", "2", "Nanpa", "Chat with Messina.",
                                                "IfChoice", "2", "Battlefuck", "Chat with Messina.",
                                                "IfChoice", "2", "BattlefuckTina", "Chat with Messina.",
                                                "IfChoice", "2", "BattlefuckAllowed", "Chat with Messina.",
                                                "IfChoice", "2", "Battlefucking", "Chat with Messina.",
											  "SetChoice", "2", "Confidence",
                                                "JumpToScene", "Chat with Messina."
										  ]
							},
							{
								"NameOfScene": "Confidence?",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Worry",
											  "Speaks",
											  "Yes... I am not very confident... at anything... except massages...",
											  "PlayerSpeaks",
											  "Then... Maybe I could help?",
											  "ChangeImageLayer", "Expression", "1", "Apologetic",
											  "Speaks",
											  "Eh..? How?",
											  "PlayerSpeaks",
											  "We could try doing some confidence-building exercises, or practice things you're not good at.",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Okay... Then... You'll be a customer, and I am the receptionist.",
											  "...",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Messina assumes position next to a boulder, using it as a makeshift desk, and looks at you expectedly.",
											  "PlayerSpeaks",
											  "Hello...",
											  "Speaks",
											  "Greetings..! W-welcome to Messina's Pampering Tentacles Spa...",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "PlayerSpeaks",
											  "I would like to order a massage. It is my first time here, could you tell me more about your services?",
											  "Speaks",
											  "Certainly... We specialize in tentacle massages... For your first time I recommend the Common Course with a Scylla...",
											  "ChangeImageLayer", "Expression", "1", "WorryBlush",
											  "Speaks",
											  "Ah..! But you are free to choose any masseuse, of course... We have slimes, succubi, lamia and many others...",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "The Common Course involves a full-body relaxation massage via hands and tentacles... You may request usage of oils and lotions separately...",
											  "As she talks her tentacles fold into numbers. You assume it is supposed to indicate service pricing.",
											  "900 eros per massage? She's giving you some nice freebies.",
											  "Speaks",
											  "Next, our parlor has an assisted bathing course... Be aware that our slime masseuse does not offer that service...",
											  "Speaks",
											  "We also have a... prostate massage specialist... Any other erotic services are negotiated separately with the masseuse...",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "So, would you like to make a reservation?",
											  "PlayerSpeaks",
											  "Yes, I would like to request...",
											  "...",
											  "ChangeImageLayer", "Expression", "1", "Avert",
											  "You finish your little reservation roleplay but Messina doesn't look convinced.",
											  "Speaks",
											  "That was pretty difficult... But I don't think it was very helpful... You were a very polite customer.",
											  "PlayerSpeaks",
											  "Oh... Sorry, let's try again.",
											  "...",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "If being polite is not challenging enough, maybe a sleazy, lewd customer would work?",
											  "PlayerSpeaks",
											  "Hey there, lady, I was hoping I could book a massage session... But a man has needs you understand...",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "PlayerSpeaks",
											  "So I was hoping for something special with a shapely pretty lady such as yourself... Maybe a passionate steamy encounter for a couple of hours, if you get what I mean...",
											  "ChangeImageLayer", "Expression", "1", "Happy",
											  "Speaks",
											  "Of course sir, say no more... I understand completely and know exactly what you need.",
											  "She smiles and motions a handjob discreetly with her hands.",
											  "Speaks",
											  "A Succubus Special is just what you need sir. She has two time slots available tonight, I assume you would like to reserve both...?",
											  "...",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "PlayerSpeaks",
											  "That went surprisingly well.",
											  "ChangeImageLayer", "Expression", "1", "WorryBlush",
											  "Speaks",
											  "We get many customers like that... Especially the elves... So I am used to it.",
											  "PlayerSpeaks",
											  "Okay one more try!",
											  "...",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "A rude customer must definitely work.",
											  "PlayerSpeaks",
											  "Hey, squid tits!",
											  "ChangeImageLayer", "Expression", "1", "Panic",
											  "Speaks",
											  "Squid ti-! Umm, yes sir, would you like a-",
											  "PlayerSpeaks",
											  "Yeah I'm looking for some quick fuck and maybe a massage, how much are you gonna charge me?",
											  "ChangeImageLayer", "Expression", "1", "Avert",
											  "Speaks",
											  "Umm sir... we are a massage parlor..! Any erotic se-",
											  "PlayerSpeaks",
											  "Yeah whatever, how much?",
											  "ChangeImageLayer", "Expression", "1", "Shy",
											  "Speaks",
											  "Umm... a Common Course is 900-",
											  "PlayerSpeaks",
											  "Huuh, are you messing with me?! I could find a girl for half that much!-",
											  "ChangeImageLayer", "Base", "1", "Shy Bikini",
											  "ChangeImageLayer", "Expression", "1", "ShyCoveredBlush",
											  "Speaks",
											  "Auuu-",
											  "Speaks",
											  "T-time out! S-sorry {ThePlayerName}, I can't do this...",
											  "...",
											  "ChangeImageLayer", "Base", "1", "Bikini",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "PlayerSpeaks",
											  "Sorry, I went overboard there...",
											  "Speaks",
											  "N-no, it's okay... I should be able to deal with that too...",
											  "PlayerSpeaks",
											  "Ideally, your bouncer would.",
											  "ChangeImageLayer", "Expression", "1", "AvertBlush",
											  "Speaks",
											  "Ahh, I suppose someone like that... could be denied service...",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Umm anyway... I kept you long enough, you should probably be going for today...",
											  "PlayerSpeaks",
											  "...You are right.",
											  "PlayerSpeaks",
											  "See you next time then. We should try something different then.",
											  "Speaks",
											  "Yes... I am looking forward to it...",
											  "She slithers into the lake and turns to wave at you.",
											  "ChangeImageLayer", "Expression", "1", "Happy",
											  "Speaks",
											  "Bye...",
											  "DisplayCharacters", "2", "EndLoop",
											  "You nod and she disappears under the dark water's surface.",
											  "Now what would be good for next time..?",
											  "SetChoice", "2", "Nanpa",
											  "JumpToScene",
											  "Leave"
										  ]
							},
							{
								"NameOfScene": "Up for more confidence training?",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Hehe... I guess...",
											  "PlayerSpeaks",
											  "Today we should go outside the cave and have you talk with strangers on the beach.",
											  "ChangeImageLayer", "Expression", "1", "Worry",
											  "Speaks",
											  "Ehh..? T-that's too much... I could never...",
											  "PlayerSpeaks",
											  "You'll never improve if you shy away from a challenge!",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "But...",
											  "PlayerSpeaks",
											  "It's okay, I'll be there with you and will chime in if something goes wrong.",
											  "Speaks",
											  "...",
											  "ChangeImageLayer", "Expression", "1", "ShyBlush",
											  "Speaks",
											  "O-okay... I will... try...",
											  "You take Messina's hand in your own and lead her out of the cave.",
											  "ChangeBG",
											  "../Mods/Beach/Images/beach.png",
											  "ChangeBGM", "music/Relaxing/umi.mp3",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "She squints from the sunlight at first but seems to adapt fairly quickly.",
											  "ChangeImageLayer", "Expression", "1", "Naughty",
											  "Looking around for a person to talk to she seems oddly invigorated. Suddenly she raises her arm and points in the direction behind you.",
											  "Speaks",
											  "I just have to... speak to someone, right..? How about... her..?",
											  "Looking in the direction she's pointing you spot a lone Nereid standing and looking at the ocean.",
											  "PlayerSpeaks",
											  "Sure, sounds good.",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Umm... What should I... talk about?",
											  "PlayerSpeaks",
											  "Anything you want. Try making some small talk at first, then see how it goes.",
											  "ChangeImageLayer", "Expression", "1", "ShyBlush",
											  "Speaks",
											  "Okay... I will do my best...",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "She slithers in the direction of Nereid and you follow closely right behind her. Some distance away the Nereid notices your approach and turns to face you.",
											  "DisplayCharacters", "1", "4", "EndLoop",
											  "Speaks4",
											  "...?",
											  "Speaks",
											  "Umm... H-hello...",
											  "Speaks4",
											  "Hey. On a date with your boyfriend? Lucky.",
											  "ChangeImageLayer", "Expression", "1", "ShyBlush",
											  "Speaks",
											  "H-he's my... my coach... N-not boyfriend...",
											  "Speaks4",
											  "Huh. Okay. Did you need something?",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Not particularly... Umm...",
											  "ChangeImageLayer", "Expression", "1", "ShyBlush",
											  "Speaks",
											  "Nice weather we're having...",
											  "Speaks4",
											  "Yeah.",
											  "ChangeImageLayer", "Expression", "2", "Calm Blush",
											  "The Nereid turns to face the ocean again and smiles.",
											  "Speaks4",
											  "The waters are calm. I am calm today, too.",
											  "...",
											  "An awkward silence falls.",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Messina is fidgeting quietly as the Nereid watches the waves absent-mindedly, both are not saying anything.",
											  "Just as you're about to say something to help, Messina speaks up.",
											  "Speaks",
											  "Umm... Miss Nereid, would you like a... massage?",
											  "That's what she's going with?!",
											  "ChangeImageLayer", "Base", "2", "Blush",
											  "Speaks4",
											  "Eh? Is this a threesome invitation?",
											  "ChangeImageLayer", "Expression", "1", "ShyBlush",
											  "Speaks",
											  "Nooo... Just a normal... massage, if you'd like...",
											  "ChangeImageLayer", "Base", "2", "Base",
											  "ChangeImageLayer", "Expression", "2", "Base",
											  "The Nereid shrugs and plops flat on the ground, right where she was standing.",
											  "Speaks4",
											  "Sure, go ahead.",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Messina kneels next to her, moving the Nereid's incredibly long hair aside, revealing the fish girl's glistening back muscles, thick tail and her firm butt.",
											  "After moving some distance away to give them some space you sit down. You overhear them talking quietly as Messina works, so this might work as casual conversation practice after all.",
											  "...",
											  "Some time passes as you ward off boredom by looking at the ocean waves. Suddenly you notice the Nereid getting a little restless, her tail waving around and sending sand flying around. Curious, you move in closer for a better look.",
											  "ChangeImageLayer", "Base", "2", "Blush",
											  "ChangeImageLayer", "Expression", "2", "BaseBlush",
											  "ChangeImageLayer", "Expression", "1", "Happy",
											  "Messina's numerous tentacles are diligently working on Nereid's inner thighs. The slick appendages occasionaly flicking against her crotch are obviously making the Nereid horny, but Messina seems oblivious to the effects her massage is having on the Nereid as she keeps going, a happy smile plastered on her face.",
											  "Speaks4",
											  "You- you are really good with those... Oohh...♥",
											  "ChangeImageLayer", "Expression", "1", "HappyBlush",
											  "Speaks",
											  "Thank you... I am glad you're enjoying it...",
											  "ChangeImageLayer", "Expression", "2", "Orgasm",
											  "Speaks4",
											  "Yes I- Oh shit I'm actually gonna... gonna cuuuum! Aaah!♥",
											  "The Nereid cums hard, her back arching as her quivering pussy squirts clear juice all over the sand and Messina's tentacles.",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "...Eh?",
											  "Shaking with pleasure, the Nereid is left completely helpless as she starts to magically fade away.",
											  "Speaks4",
											  "Fucking incredible... I should try it with girls more often...",
											  "DisplayCharacters", "1", "EndLoop",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Messina was victorious!\nMessina gained 30 Exp and 108 Eros.",
											  "ChangeImageLayer", "Expression", "1", "ShyBlush",
											  "Speaks",
											  "W-what? W-w-whyy?! I- I didn't mean to... Auuu...",
											  "ChangeImageLayer", "Base", "1", "Shy Bikini",
											  "ChangeImageLayer", "Expression", "1", "ShyCoveredBlush",
											  "PlayerSpeaks",
											  "...Hey, at least she enjoyed it.",
											  "...",
											  "DisplayCharacters", "2", "EndLoop",
											  "Messina seems too embarrassed to continue training today, so you lead her back to cave and bid your farewells at the entrance. She slithers inside, sulking and still embarrassed.\nGood enough for one day.",
											  "SetChoice", "2", "Battlefuck"
										  ]
							},
							{
								"NameOfScene": "We should change out training regimen.",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "ShyBlush",
											  "Speaks",
											  "After last time, for sure...",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "What did you... have in mind..?",
											  "PlayerSpeaks",
											  "We should try... fighting.",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Ah, umm... sex fighting? Like adventurers do?",
											  "ChangeImageLayer", "Expression", "1", "ShyBlush",
											  "You nod in response and Messina blushes furiously.\nShe remains quiet for a while then finally speaks up, in a particularly tiny voice.",
											  "Speaks",
											  "...Will it really help?",
											  "PlayerSpeaks",
											  "I think it will. A sex fighter is proactive and has to act confidently to get what they want. I think it will be helpful to you too.",
											  "ChangeImageLayer", "Expression", "1", "NaughtyBlush",
											  "Speaks",
											  "...You just want to do naughty things with me.",
											  "PlayerSpeaks",
											  "Err.. well, yes... But I really think it'll help!",
											  "ChangeImageLayer", "Expression", "1", "HappyBlush",
											  "Speaks",
											  "...Okay. Then... let's fight... But!",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "I promised the lifeguard... that I wouldn't bully any adventurers while I am here. So first, go and ask her... for permission...",
											  "PlayerSpeaks",
											  "...Alright.",
											  "SetChoice", "2", "BattlefuckTina",
											  "JumpToScene", "MainHub"
										  ]
							},
							{
								"NameOfScene": "I spoke with Tina...",
								"theScene":[
											  "SetChoice", "2", "Battlefucking",
											  "ChangeImageLayer", "Expression", "1", "HappyBlush",
											  "Speaks",
											  "Ah... good... What did she say..?",
											  "PlayerSpeaks",
											  "She... allowed it.",
											  "ChangeImageLayer", "Expression", "1", "Naughty",
											  "Speaks",
											  "Just like that..?",
											  "PlayerSpeaks",
											  "...After a test.",
											  "ChangeImageLayer", "Expression", "1", "NaughtyBlush",
											  "Speaks",
											  "Ah, umm... okay... That is... good.",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "Then... Let's fight... But there is a bit of trouble, I think...",
											  "ChangeImageLayer", "Expression", "1", "WorryBlush",
											  "Speaks",
											  "What happens if I lose...? I will just teleport back home, right..?",
											  "PlayerSpeaks",
											  "I think so, that's what usually happens.",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "I live all that way back in capital... I don't want to go home yet, so...",
											  "Speaks",
											  "Umm... so if I start losing I will give up... then you stop and let me rest...? Would that work?",
											  "PlayerSpeaks",
											  "...I think it should.",
											  "ChangeImageLayer", "Expression", "1", "Apologetic",
											  "Speaks",
											  "Okay then... En garde?",
											  "CombatEncounter",
												  "RunningWontSkipEvent",
												"NoRunning",
												"Messina",
											  "StartCombat",
											  "JumpToScene", "BeatMessina"
										  ]
							},
							{
								"NameOfScene": "BeatMessina",
								"theScene":[
											  "DisplayCharacters", "1", "EndLoop",
											  "ChangeImageLayer", "Base", "1", "Base",
											  "ChangeImageLayer", "Expression", "1", "Erotic",
											  "Having triumphed in battle you disentangle yourself from Messina, who is left shaking on the verge of a powerful orgasm.",
											  "Speaks",
											  "Haa...♥ haa...♥",
											  "Speaks",
											  "That was...♥ funnn...♥",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Thank you... for stopping.",
											  "Speaks",
											  "Umm... the hero needs a reward now!",
											  "She slithers towards the lake and pulls out a dark bag from the water.",
											  "ChangeImageLayer", "Expression", "1", "HappyBlush",
											  "From the bag she procurs a small sack of eros and hands it to you. It is a little wet but you shrug and accept.",
											  "ChangeEros", "250",
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Thanks for helping me again... I think this is... helpful.",
											  "ChangeImageLayer", "Expression", "1", "Apologetic",
											  "Speaks",
											  "I really want to take a nap now... So you should go and... finish your adventure...",
											  "Speaks",
											  "Please come... and visit again.",
											  "You nod and wave a goodbye to the timid Scylla, feeling a little exhausted from your fight but ready to continue your adventure.",
											"JumpToScene",
											"Leave"
										  ]
							},
							{
								"NameOfScene": "Spar",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Yes... I was about to ask... myself...",
											  "CombatEncounter",
												  "RunningWontSkipEvent",
												"NoRunning",
												"Messina",
											  "StartCombat",
											  "JumpToScene", "BeatMessina"
										  ]
							},
							{
								"NameOfScene": "Done talking.",
								"theScene":[
											  "She nods and looks at you quietly.",
                                                "JumpToScene", "MainHub"
										  ]
							},
							{
								"NameOfScene": "Ask for a massage.",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Happy",
											  "Speaks",
											  "A massage..? Of course...♪",
											  "Messina leads you to the same large, smooth boulder and gestures you to lie down.",

											  "As you get comfortable on the rock, you notice Messina warming her hands with quiet breaths.",
											  "She soon places her hands on your back, the familiar sensation of her long fingers caressing your body draining tension from your muscles before she even starts the massage.",
											  "Humming a little song under her breath she increases the force behind her movements, expertly massaging out the tension and stress from your adventures out of your body.",
											  "IfFetishLevelEqualOrGreater", "Monstrous", "3", "MassageFetishIntro",
											  "As her hands work your upper back and neck, you feel her, slimy tentacles begin to massage your legs...",
											  "Menu",
												"Enjoy the massage.",
												"Fantasize...",
											  "EndLoop"
										  ]
							},
							{
								"NameOfScene": "Enjoy the massage.",
								"theScene":[ "JumpToScene",
								"Let her continue."
										  ]
							},
							{
								"NameOfScene": "RepeatMassageWrapup",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Embarrassed",
											  "Speaks",
											  "Thanks for visiting me again... You should go and... finish your adventure now...",
											  "PlayerSpeaks",
											  "Thank you for your help again.",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "Yes... You're welcome...",
											  "Speaks",
											  "Please come... and visit again.",
											  "You nod and wave a goodbye to the timid Scylla, feeling energized and ready to finish your adventure.",
											"JumpToScene",
											"Leave"
											]
							},
							{
								"NameOfScene": "Leave the cave.",
								"theScene":[
											  "ChangeImageLayer", "Expression", "1", "Sad",
											  "Speaks",
											  "Leaving... already?",
											  "ChangeImageLayer", "Expression", "1", "Base",
											  "Speaks",
											  "Okay... See you later...",
											  "She gives you a little wave and slips into the dark lake quietly.",
											"JumpToScene",
											"Leave"
										  ]
							},
							{
								"NameOfScene": "Leave",
								"theScene":[
											  "DisplayCharacters", "2", "EndLoop",
											  "Quickly moving backwards through the now familiar cave you reach the entrance and get back onto the beach, happy to see sunlight again.",
											  "ChangeBG",
											  "../Mods/Beach/Images/beach.png"
										  ]
							}
                ]
}
