{
    "name": "Meet the Sea Dragon!",
    "CardType": "Quest",
    "CardLimit": "0",
    "Description": "Our Boss is finally back from traveling and is available again! Come visit 'Sexy Hookup Resort' and meet the majestic Sea Dragon!\n- Tina ♥",
    "requires": [""],
    "Speakers": [
                  {
                    "name": "Cetuspeanna",
                    "postName": "",
                    "SpeakerType": "Monster"
                  },
                  {
                    "name": "Mermaid",
                    "postName": " 1",
                    "SpeakerType": "Monster"
                  },
                  {
                    "name": "Mermaid",
                    "postName": " 2",
                    "SpeakerType": "Monster"
                  },
                  {
                    "name": "???",
                    "postName": "",
                    "SpeakerType": "?"
                  },
                  {
                    "name": "Tina",
                    "postName": "",
                    "SpeakerType": "Monster"
                  }
                ],
    "EventText": [
                    {
                        "NameOfScene": "EventStart",
                        "theScene":[
                          "DenyInventory",
                          "ProgressEqualsOrGreater", "3", "MeetDragon",
                          "ProgressEqualsOrGreater", "2", "TryAgain",
                          "ProgressEqualsOrGreater", "1", "HiddenDragon",
                          "SetProgress", "1",

                          "ChangeBGM", "music/Relaxing/umi.mp3",
      									  "SetChoice", "1", "DragonHid",
                          "SetChoice", "2", "NotFaintedBefore",
      									  "SetChoice", "3", "NameNotAsked",
      									  "SetChoice", "4", "WhyRun",
      									  "SetChoice", "5", "God",
      									  "SetChoice", "6", "TailPussyNotLooked",
      									  "SetChoice", "7", "SexLocked",
      									  "SetChoice", "8", "SexSuggestions",
      									  "SetChoice", "9", "TailPussyNotFucked",
      									  "Finally, you arrive at the spot mentioned in Tina's invitation. It described a tiny island a several dozen meters away from the shore, housing a peculiar flat rock the size of a table.",
      									  "It is a little difficult to tell from this distance, but you're pretty sure this is the right place. Hoping you didn't mistake the location, you prepare to enter the water and look around.",
      									  "A lone Nereid stands still in the distance, overlooking the island. She notices you and gives a little wave before sitting flat on her ass and pointing to you, then to the island.",
      									  "Is she planning to spectate?",
      									  "With a shrug, you enter the sea, enjoying the pleasantly cool water caressing your body. You'd go for a swim more often, but getting swarmed by Mermaids does not match with your plans most of the time.",
      									  "DisplayCharacters", "2", "3", "End",
					                "StopBGM",
      									  "...Like this.",
					                "ChangeImageLayer", "Expression", "1", "Seductive",
      									  "Speaks2", "Fufu... Oh don't be alarmed, Hero. We are only here to make sure everyone makes it to the Divine Island safely.♥",
				                  "ChangeBGM", "music/Relaxing/umi.mp3",
      									  "PlayerSpeaks", "Alright... Wait, Divine?",
      									  "Speaks3", "That's right, our veritable Dragon Goddess resides there.♥ I am sure you'll understand when you see her for yourself.♥",
      									  "You nod and resume swimming, still feeling a little concerned over the mermaids as you go.",
      										"DisplayCharacters", "4", "End",
      									  "However, they are keeping their distance as promised, and seem to disappear into the water quietly when you safely arrive at the island.",
                          "ChangeBG", "../../ModLoader/mods/Beach/Images/altar.png",
					                "ChangeBGM", "../ModLoader/mods/Beach/Music/PerituneMaterial_Starry_loop.mp3",
      									  "The tiny island is largely empty. A large and flat rock dominates one third of its space. In front of it, you spot a number of markings in the sand. Webbed footprints, scaly trails, dried mucus and other traces left all over the location. The aquatic locals seem to frequent this location.",
      									  "You approach and examine the rock. Up close, it kind of looks like a makeshift altar, but there is nothing on it beside some stray seaweed.",
      									  "You hear a quiet splash coming from behind the altar. Carefully, you lean over the flat stone and peek at the waters...",
      									  "...But see nothing. Thinking you might've imagined it, you step back.",
                          "TimeBecomesNight",
                          "ChangeBG", "../../ModLoader/mods/Beach/Images/altarNight.png",
                          "ChangeBGM", "../ModLoader/mods/Beach/Music/PerituneMaterial_Shizima2.mp3",
      									  "All of a sudden, night falls. The blazing sun disappears almost instantaneously, a gigantic moon replacing it in the skies.",
      									  "As you're still trying to gather your bearings over the sudden change, something rises from behind the altar...!",
                          "DisplayCharacters", "1", "End",
                          "ChangeImageLayer", "Overlay", "1", "Moonlight",
                          "ChangeImageLayer", "Expression", "1", "Solemn",
                          "The strange-looking dragoness is huge, her human half easily twice as tall as you, to say nothing of the rest of her gargantuan body.",
                          "Speaks4", "My greetings to you, Hero... Are you here to challenge-...",
                          "ChangeImageLayer", "Base", "1", "BaseFlush",
                          "Speaks4", "...",
                          "ChangeBGM", "music/Forest/nandesuto.mp3",
                          "ChangeImageLayer", "Base", "1", "BaseFullBodyBlush",
                          "ChangeImageLayer", "Tits", "1", "",
                          "ChangeImageLayer", "ArmsBase", "1", "",
                          "ChangeImageLayer", "ArmsTop", "1", "",
      									  "ChangeImageLayer", "Expression", "1", "Flustered",
                          "Speaks4", "...H-how han-... awawa-!",
                          "DisplayCharacters", "4", "End",
      									  "With a loud splash, she disappears underwater as suddenly as she appeared.",
      									  "StopBGM",
                          "TimeBecomesNormal",
                          "ChangeBG", "../../ModLoader/mods/Beach/Images/altar.png",
                          "ChangeBGM", "music/Relaxing/umi.mp3",
      									  "The weather normalizes as well, the mystical night fading without a trace, giving place to the familiar oppressive heat of the beach.",
      									  "Baffled by what has just transpired you look around for support or a possible explanation.",
      									  "You hear muffled giggles from behind and turn around to see several mermaids in the water, with one of them clumsily climbing unto the land, while the others are pushing her from behind.",
      									  "DisplayCharacters", "2", "End",
      									  "ChangeImageLayer", "Base", "1", "BaseBlush",
      									  "ChangeImageLayer", "Expression", "1", "Submissive",
      									  "Finally plopping upon the land, she hurriedly pulls herself closer to you, addressing you in a panicked manner.",
      									  "Speaks2", "Oh Hero, we are so, so sorry! Our Lady suddenly retreated back to her Undersea Chambers again! P-please we have to do something, or she may lose her job here!",
      									  "PlayerSpeaks", "...Again? Does this happen often or...",
      									  "Speaks2", "Ye- oh, um, I mean, it's not my place to say... This never happened on the job before...",
      									  "Speaks2", "A-anyway, I beg of you, Hero! Please let Miss Tina know that this happened! I am sure she could convince our Lady to meet you properly... I hope...",
      									  "...",
      									  "You can only shrug and promise to call Tina next time, reassuring the flustered Mermaid that it'll be fine. For now, however, you return back to the town to get some rest."
                      ]
                    },
                    {
						"NameOfScene": "HiddenDragon",
                        "theScene":[
                          "ChangeBGM", "music/Relaxing/umi.mp3",
                          "You arrive at the location close to the dragon's island again, but have little reason to visit the place right now.",
										      "First, you should let Tina know about what happened last time."
								                ]
					          },
                    {
						"NameOfScene": "TinaVisit",
                        "theScene":[
									  "SetChoice", "1", "DragonUnhid",
                    "SetProgress", "2",
                    "...",
                    "ChangeBG", "../../ModLoader/mods/Beach/Images/altar.png",
                    "ChangeBGM", "music/Forest/nandesuto.mp3",
									  "DisplayCharacters", "1", "5", "End",
                    "ChangeImageLayer", "Overlay", "1", "Moonlight",
                    "ChangeImageLayer", "Base", "1", "BaseBlush",
									  "ChangeImageLayer", "Expression", "1", "Shy",
									  "ChangeImageLayer", "Base", "2", "Smol1",
                    "ChangeImageLayer", "Extra", "2", "BikiniBottomEmpty",
                    "ChangeImageLayer", "BodyPart", "2", "Empty",
									  "ChangeImageLayer", "Expression", "2", "Empty",
										"You arrive to the island a little later than Tina and see her already talking to the Dragon, who, upon seeing you, flushes crimson and looks like she's about to run away again.",
										"To avoid scaring her off you halt your advance and try to listen in from a distance. You also notice a number of curious Nereids and Mermaids peeking from the waters.",
										"Speaks5", "Cetty! Are you listening? You can't just run off because {thePlayerName}- *unintelligible*. Mrs. Felicia wouldn't- *unintelligible*. Have some confidence, your combat moves are incredibly l- *unintelligible*... I am sure he will f- *unintelligible* you when he sees them.",
                    "ChangeImageLayer", "Expression", "1", "Rules",
										"Speaks4", "Okay... I'll do it... I'll fight him! Just... just give me a moment to prepare, then send him in, okay?",
									  "ChangeImageLayer", "Base", "2", "Smol2",
										"Speaks5", "Mhm, sure! Finally!",
									  "ChangeImageLayer", "Base", "2", "Smol1",
										"Speaks5", "But I am staying here, and if you run off again, I am telling Mrs. Felicia! She'll set you straight for sure.",
										"Speaks4", "N-no need! No need to bother Mrs. Felicia. I'll do just fine, I promise.",
										"DisplayCharacters", "5", "End",
                    "ChangeBGM", "../ModLoader/mods/Beach/Music/PerituneMaterial_Starry_loop.mp3",
										"The dragonness retreats underwater for the moment and Tina walks over to you.",
									  "ChangeImageLayer", "Base", "1", "BlushAlt",
									  "ChangeImageLayer", "Expression", "1", "Beg",
										"Speaks5", "I am so, so sorry that she is like this, {thePlayerName}. She asked for a moment to prepare, so let's wait for a bit.",
										"You inquire about what was the problem in the first place.",
										"ChangeImageLayer", "Expression", "1", "Grin",
										"Speaks5", "Heehee... girls secret. I can't tell you that I'm afraid.♥",
										"Speaks5", "But don't worry, I think I convinced her to do this. I'll just sit here quietly in case she gets any funny ideas, so don't let me distract you two.",
										"Tina looks around briefly and giggles.",
										"Speaks5", "I think you'll have some audience from the fishies anyway.",
                    "ChangeBGM", "../ModLoader/mods/Beach/Music/PerituneMaterial_Shizima2.mp3",
                    "TimeBecomesNight",
                    "ChangeBG", "../../ModLoader/mods/Beach/Images/altarNight.png",
										"Just like the first time, night falls over the sea suddenly.",
										"ChangeImageLayer", "Expression", "1", "Wow",
										"Speaks5", "Ohh, looks like she's ready! I love it when she does this trick, that moon is so ridiculously big and pretty!",
										"ChangeImageLayer", "Expression", "1", "Base",
										"Speaks5", "Okay, I'll get out of the way, good luck there!",
										"DisplayCharacters", "4", "End",
										"She hops some distance away with a little wave.",
										"You take a deep breath to prepare yourself for the fight and approach the altar.",
										"DisplayCharacters", "1", "End",
                    "ChangeImageLayer", "Overlay", "1", "Moonlight",
                    "ChangeImageLayer", "Expression", "1", "Solemn",
										"As you approach, the sea dragoness rises slowly from the water, looking far more composed than before.",
										"Speaks", "I welcome you, Human Hero. Dragon Goddess Cetuspeanna accepts your challenge!",
											  "CombatEncounter",
												  "RunningWontSkipEvent",
												"NoRunning",
												"Cetuspeanna",
											  "StartCombat",
                        "GetEventAndIfChoiceIs", "CetuspeannaCombatEvents", "3", "Fainted", "CetuspeannaFainted",
											  "JumpToScene", "CetuspeannaBeaten"
								  ]
					},
          {
            "NameOfScene": "CetuspeannaFainted",
            "theScene": [
              "SetProgress", "3",
              "RemovePerkQuietly", "Ethereal Hands",
              "DisplayCharacters", "1", "End",
              "ChangeImageLayer", "Overlay", "1", "Moonlight",
              "ChangeImageLayer", "Expression", "1", "EyesClosed",
              "Overwhelmed by the rampant magic spell, Cetuspeanna lays motionless in the shallow waters...",
              "TimeBecomesNormal",
              "ChangeImageLayer", "Overlay", "1", "",
              "ChangeBG", "../../ModLoader/mods/Beach/Images/altar.png",
              "ChangeBGM", "../ModLoader/mods/Beach/Music/PerituneMaterial_Starry_loop.mp3",
              "The magical night fades away quickly, giving way to the usual sunny ambience.",
              "DisplayCharacters", "2", "1", "3", "End",
              "ChangeImageLayer", "Expression", "1", "Submissive",
              "ChangeImageLayer", "Expression", "2", "EyesClosed",
              "ChangeImageLayer", "Expression", "3", "Submissive",
              "Speaks2", "Oh no... The Goddess fainted!",
              "Speaks3", "H-hero, that was going too far! I've never seen anyone bully the Goddess so much!",
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "ChangeImageLayer", "Expression", "1", "Cockeating",
              "Speaks2", "It looked like it felt really good though...",
              "ChangeImageLayer", "Expression", "3", "Pout",
              "Speaks3", "N-not now! We have to bring her home...",
              "ChangeImageLayer", "Expression", "1", "Submissive",
              "ChangeImageLayer", "Expression", "3", "Submissive",
              "Speaks3", "Umm, hero, this is your reward... She was supposed to give it herself if you won, but...",
              "The mermaid procurs an expertly-crafted whistle made of coral from the dragoness' unconscious body and hands it to you.",
              "Speaks3", "When the season is right, you can use this to travel to far, deep places. You'll know it when the time comes.",
              "Leaving behind that cryptic message, the Mermaids begin bustling around their unconscious goddess, trying to move her.",
              "DisplayCharacters", "End",
              "More Mermaids emerge from water, splashing around and helping their sisters to drag the giant dragoness underwater before disappearing from view...",
              "You shrug and decide to return to town, hoping Cetuspeanna is not too upset about this loss.",
              "GiveItem", "1", "Coral Whistle",
              "SetChoice", "2", "FaintedFirstFight",
              "GoToTown"
            ]
          },
          {
            "NameOfScene": "CetuspeannaBeaten",
            "theScene": [
              "SetProgress", "3",
              "RemovePerkQuietly", "Ethereal Hands",
              "TimeBecomesNormal",
              "ChangeImageLayer", "Overlay", "1", "",
              "ChangeBGM", "../ModLoader/mods/Beach/Music/PerituneMaterial_Shizima2.mp3",
              "ChangeBG", "../../ModLoader/mods/Beach/Images/altar.png",
              "DisplayCharacters", "1", "End",
              "ChangeImageLayer", "Expression", "1", "MildlyAroused",
              "Panting heavily Cetuspeanna retreats farther into water, signaling that the fight is over.",
              "Speaks", "Haa... Good job, Hero. You may be the first adventurer to defeat me here, as a part of the resort team.",
              "ChangeImageLayer", "Expression", "1", "SoftSmile",
              "Speaks", "Truly, congratulations! This is a special occasion, as I get to gift you a special item.",
              "The dragoness procurs an expertly-crafted whistle made of coral and hands it to you gingerly.",
              "Speaks", "When the season is right, this will help you travel to far, deep places. You will know how to use it when the time comes.",
              "Leaving behind that cryptic message she draws back further into the water and gives you a little wave.",
              "Speaks", "Now, I would love to get to know my subjugator better, but I must report my loss right away. It's part of the contract. So come see me later sometime, okay?",
              "DisplayCharacters", "End",
              "The giant dragoness waves one last time and dives underwater with a loud splash, disappearing from view... You look around and don't see anyone else, figuring Tina and the spectating locals already left.",
              "You pocket the whistle and decide to return to town, still feeling a little pumped from the intense and beautiful fight.",
              "GiveItem", "1", "Coral Whistle",
              "GoToTown"
            ]
          },
          {
            "NameOfScene": "TryAgain",
            "theScene": [
              "ChangeBGM", "../ModLoader/mods/Beach/Music/PerituneMaterial_Starry_loop.mp3",
              "ChangeBG", "../../ModLoader/mods/Beach/Images/altar.png",
              "You arrive at the dragon's altar once more, intent on challenging her again!",
              "ChangeBGM", "../ModLoader/mods/Beach/Music/PerituneMaterial_Shizima2.mp3",
              "TimeBecomesNight",
              "ChangeBG", "../../ModLoader/mods/Beach/Images/altarNight.png",
              "Just like the last time, night falls over the sea suddenly.",
              "DisplayCharacters", "1", "End",
              "ChangeImageLayer", "Overlay", "1", "Moonlight",
              "ChangeImageLayer", "Expression", "1", "Solemn",
              "As you approach closer, the sea dragoness rises slowly from the water.",
              "Speaks", "I welcome you again, Human Hero. Dragon Goddess Cetuspeanna accepts your challenge!",
                  "CombatEncounter",
                    "RunningWontSkipEvent",
                  "NoRunning",
                  "Cetuspeanna",
                  "StartCombat",
                  "GetEventAndIfChoiceIs", "CetuspeannaCombatEvents", "3", "Fainted", "CetuspeannaFainted",
                  "JumpToScene", "CetuspeannaBeaten"
            ]
          },
          {
            "NameOfScene": "MeetDragon",
            "theScene": [
            "ChangeBG", "../../ModLoader/mods/Beach/Images/altar.png",
            "IfChoice", "2", "FaintedFirstFight", "FaintIntro",
            "You return to Cetuspeanna's island and sit down on the altar, waiting for her arrival. Hopefully the dragoness is not too far.",
            "As if alleviating your concerns, Cetuspeanna emerges from the water gracefully.",
            "DisplayCharacters", "1", "End",
            "ChangeImageLayer", "Expression", "1", "SoftSmile",
            "Speaks", "Hello again, {thePlayerName}.",
            "Slithering unto land, she wraps her long tail around the altar, propping up her upper body across from you, perhaps a little too closely.",
            "ChangeImageLayer", "Expression", "1", "Happy",
            "Speaks", "So, what did you want to do today?",
            "JumpToScene", "MainHub"
            ]
          },
          {
            "NameOfScene": "FaintIntro",
            "theScene": [
            "You return to Cetuspeanna's island and sit down on the altar, waiting for her arrival. Hopefully the dragoness is not too far, and not too upset about the magic fiasco from the last time.",
            "Cetuspeanna emerges from the water, flushed in the face but not looking too angry.",
            "DisplayCharacters", "1", "End",
            "ChangeImageLayer", "Base", "1", "BaseBlush",
            "ChangeImageLayer", "Expression", "1", "Shy",
            "Speaks", "Hello again, {thePlayerName}... Umm... About the last time...",
            "You start to apologize for what happened, but she interrupts you.",
            "Speaks", "N-no no, the fault is my own... I just ask that you... Don't tell anyone about that, okay?",
            "You nod in agreement, not sure if that's gonna help because the Mermaids probably told everyone by now, but she visibly relaxes nonetheless.",
            "Speaks", "Alright.... Thank you...",
            "Slithering unto land, she wraps her long tail around the altar, propping up her upper body across from you, perhaps a little too closely.",
            "SetChoice", "2", "Fainted",
            "ChangeImageLayer", "Base", "1", "BaseFlush",
            "ChangeImageLayer", "Expression", "1", "Happy",
            "Speaks", "So, let's forget about that. What did you want to do today?",
            "JumpToScene", "MainHub"
            ]
          },
          {
            "NameOfScene": "MainHub",
            "theScene": [
              "ChangeBGM", "../ModLoader/mods/Beach/Music/PerituneMaterial_Starry_loop.mp3",
              "DisplayCharacters", "1", "End",
              "ChangeImageLayer", "Expression", "1", "SoftSmile",
              "Menu",
                "Talk.",
                "Spar.",
                "Sex?",
                "RequiresChoice", "7", "SexOpen",
                "Sex.",
                "Leave.",
              "EndMenu"
            ]
          },
          {
            "NameOfScene": "Talk.",
            "theScene": [
              "Menu",
                "About herself.",
                "About the resort.",
                "RequiresChoice", "5", "NotAGod",
                  "About the fight.",
                "RequiresChoice", "3", "NameNotAsked",
                  "'How do you know my name?'",
                "Done talking.",
              "EndMenu"
            ]
          },
          {
            "NameOfScene": "About herself.",
            "theScene": [
              "Menu",
                "'Are you really a dragon goddess?'",
                "RequiresChoice", "4", "WhyRun",
                  "'Why did you run away at first?'",
                "RequiresChoice", "4", "Love",
                  "'So you love me?'",
                "RequiresChoice", "6", "TailPussyNotLooked",
                  "Tail pussy...",
                "Return.",
              "EndMenu"
            ]
          },
          {
            "NameOfScene": "'Are you really a dragon goddess?'",
            "theScene": [
              "ChangeImageLayer", "Base", "BaseFlush",
              "ChangeImageLayer", "Expression", "Smile",
              "Speaks", "No, not at all. I am not a goddess, and not even a dragon per se.",
              "You feel confused and ask her to elaborate.",
              "ChangeImageLayer", "Expression", "SoftSmile",
              "Speaks", "I don't recall the circumstances of my birth. I am an orphan, raised by the local seafolk who've never seen anything quite like me. So for a while everyone just assumed I was a sea serpent from a deeper sea area.",
              "Speaks", "That was until I met a real sea serpent who looked really different from myself.",
              "ChangeImageLayer", "Base", "BaseBlush",
              "ChangeImageLayer", "Expression", "Shy",
              "Speaks", "She didn't have a... {i}tail{/i} quite like mine, or any tentacles.",
              "Her tentacles wiggle demonstratively, but your eyes stealthily wander to her moist tail pussy for a moment...",
              "ChangeImageLayer", "Base", "Base",
              "ChangeImageLayer", "Expression", "Reminiscing",
              "So I tried to do some research into my origin, and it failed completely. That was until the humans came along, founding their guilds and research facilities.",
              "PlayerSpeaks", "Wait... how old are you again?",
              "ChangeImageLayer", "Expression", "Haughty",
              "Speaks", "163.",
              "PlayerSpeaks", "I-I see...",
              "ChangeImageLayer", "Expression", "Reminiscing",
              "Speaks", "I decided I would visit the human wizards. I heard they were invested in classifying the monster races, so I figured they could identify me as well.",
              "PlayerSpeaks", "Did they succeed?",
              "ChangeImageLayer", "Expression", "Happy",
              "Speaks", "They got into a huge fight about it.♪",
              "ChangeImageLayer", "Expression", "Reminiscing",
              "Speaks", "Fundamentally, I turned out to be a sea slug. A really long, unusually ancient sea slug. That was the only thing they all agreed upon.",
              "ChangeImageLayer", "Expression", "Smile",
              "Speaks", "I don't know if you've seen a sea slug, but they're nothing like me. Our slippery and squishy bodies are the only thing we have in common, really.",
              "ChangeImageLayer", "Expression", "Reminiscing",
              "Speaks", "So they tried to figure out why I looked different. One of the wizards insisted I was a chimera, due to the presence of horns, my tail... organ... and tentacles, all of which are uncharacteristic for sea slugs.",
              "Speaks", "The others insisted my chimeric traits were too insignificant and didn't explain my unusually large capacity for magic.",
              "ChangeImageLayer", "Expression", "Happy",
              "Speaks", "I did fly all the way from the sea to their place. They were pretty shocked by it.♪",
              "ChangeImageLayer", "Expression", "Reminiscing",
              "Speaks", "So they ran some tests and received what they called a 'draconic response'. They also noticed my strong affinity for the holy element. Of course, that's not enough to be considered a goddess.",
              "ChangeImageLayer", "Expression", "Smile",
              "Speaks", "So in the end, they classified me as a 'draconic mollusc' and bought me a cake. Wizards are so oddly adorable at times, aren't they?",
              "ChangeImageLayer", "Expression", "Panic",
              "Speaks", "Oh I am sorry, I talked too much about this. I hope I didn't bore you, we should change the subject.",
              "SetChoice", "5", "NotAGod",
              "ChangeImageLayer", "Expression", "Smile",
              "JumpToScene", "About herself."
            ]
          },
          {
            "NameOfScene": "'Why did you run away at first?'",
            "theScene": [
              "ChangeImageLayer", "Base", "1", "BaseFullBodyBlush",
              "ChangeImageLayer", "Tits", "1", "",
              "ChangeImageLayer", "ArmsBase", "1", "",
              "ChangeImageLayer", "ArmsTop", "1", "",
              "ChangeImageLayer", "Expression", "1", "Tiny",
              "Speaks", "T-t-t-that's not important, is it?",
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "ChangeImageLayer", "Tits", "1", "Titties",
              "ChangeImageLayer", "ArmsBase", "1", "ArmsRest",
              "ChangeImageLayer", "Expression", "1", "Shy",
              "You don't look convinced and she averts her gaze shyly.",
              "Speaks", "W-w-well if you have to know... Sometimes I receive prophetic dreams.",
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "ChangeImageLayer", "Expression", "1", "Smile",
              "Speaks", "And the day before we met, I dreamed of a fair man sent by the Goddess to love me.",
              "ChangeImageLayer", "Expression", "1", "Shy",
              "Speaks", "And well... I am sure you noticed how mermaids love talking about marriage, so that kind of romantic thinking must've rubbed off on me a little. Or a lot...",
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "ChangeImageLayer", "Expression", "Panic",
              "Speaks", "So I suppose I am, ah... easily impressed by handsome gentlemen?",
              "SetChoice", "4", "Love",
              "ChangeImageLayer", "Base", "1", "Base",
              "ChangeImageLayer", "Expression", "Smile",
              "JumpToScene", "About herself."

            ]
          },
          {
            "NameOfScene": "'So you love me?'",
            "theScene": [
              "ChangeImageLayer", "Base", "1", "BaseFullBodyBlush",
              "ChangeImageLayer", "Tits", "1", "",
              "ChangeImageLayer", "ArmsBase", "1", "",
              "ChangeImageLayer", "ArmsTop", "1", "",
              "ChangeImageLayer", "Expression", "1", "Shy",
              "Speaks", "...",
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "ChangeImageLayer", "Tits", "1", "Titties",
              "ChangeImageLayer", "ArmsBase", "1", "ArmsRest",
              "ChangeImageLayer", "Expression", "1", "EyesClosed",
              "Speaks", "...",
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "ChangeImageLayer", "Expression", "1", "Smile",
              "Speaks", "I don't know.",
              "ChangeImageLayer", "Expression", "1", "SoftSmile",
              "Speaks", "I do feel more attracted to you than any other man I've met. I don't know why is that. I want to know more about that. About you.",
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "ChangeImageLayer", "Expression", "1", "Happy",
              "Speaks", "So maybe if we spend more time together, I will fall in love with you. Hope you don't mind.♪",
              "ChangeImageLayer", "Base", "1", "Base",
              "ChangeImageLayer", "Expression", "Smile",
              "JumpToScene", "About herself."

            ]
          },
          {
            "NameOfScene": "Tail pussy...",
            "theScene": [
              "Your eyes drift to her exposed tail pussy again and she seems to notice it this time.",
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "ChangeImageLayer", "Expression", "EyesClosed",
              "Speaks", "Are you really so interested in that?",
              "You nod with a flush, unable to deny your interest.",
              "Speaks", "I see...",
              "The moist slit opens a little more, drooling light blue liquid that gets lewdly scooped up by the jet-black tentacles jutting out from the orifice.",
              "ChangeImageLayer", "Expression", "Haughty",
              "Speaks", "If you put your naughty {i}cock{/i} in my tail {i}pussy{/i}, it will feel unbearably good. You will moan helplessly and start ejaculating on the spot, I guarantee that.",
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "Speaks", "And then, you will be leaking without a moment of respite. It will be one long, drawn out and continuous ejaculation. And my obscene tail {i}pussy{/i} will gulp down all of it, more than you knew you'd had in you...",
              "ChangeImageLayer", "Expression", "Happy",
              "Speaks", "Just kidding.♪",
              "ChangeImageLayer", "Expression", "Smile",
              "Speaks", "That is what happens to unprepared men. Adventurers are more durable, I know {i}you{/i} are.",
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "ChangeImageLayer", "Expression", "MildlyAroused",
              "Speaks", "But I also know that with the right mindset... If you were curious, fufu...♥",
              "You gulp down and avert your eyes, dropping the subject. She was uncharacteristically forward about that...",
              "SetChoice", "6", "TailPussyLooked",
              "ChangeImageLayer", "Base", "1", "Base",
              "ChangeImageLayer", "Expression", "Smile",
              "JumpToScene", "About herself."
            ]
          },
          {
            "NameOfScene": "About the resort.",
            "theScene": [
              "Menu",
                "Ask her about the locals.",
                "Talk about her work.",
                "Return.",
              "EndMenu"
            ]
          },
          {
            "NameOfScene": "Ask her about the locals.",
            "theScene": [
              "Speaks", "Well, there is a large mermaid flock in these waters. They have an underwater town nearby, I was raised there. ",
              "ChangeImageLayer", "Expression", "Wistful",
              "Speaks", "I've been around longer than most. People come and go, but the flock remains largely the same. It gets a little lonely when our lifespans are so different.",
              "ChangeImageLayer", "Expression", "Happy",
              "Speaks", "Oh, but I have a very good friend who's been around longer than even me! She is a big sea turtle, maybe you will meet her one day.",
              "ChangeImageLayer", "Expression", "Smile",
              "Speaks", "In the recent years, a Nereid Matriarch moved in nearby. I heard she is a retired general and is really scary, but I never met her personally. Her girls come along often though.",
              "ChangeImageLayer", "Expression", "Shy",
              "Speaks", "SwapLineIf", "Choice",
                "5", "NotAGod", "For some reason they've taken a real liking to me, the whole 'goddess' thing was their idea. Maybe it's a cultural thing for them?",
                "5", "God", "For some reason they've taken a real liking to me. I haven't told you yet, but the whole 'goddess' thing is actually something they came up with. Maybe it's a cultural thing for them?",
              "endSwap",
              "ChangeImageLayer", "Expression", "Smile",
              "Speaks", "Lastly, there is a small group of sea slug ladies visiting the resort often. They're getting on in the years, so they must be looking for husbands...",
              "ChangeImageLayer", "Expression", "Panic",
              "Speaks", "But they end up babying the men so much that I am not sure if that's actually their intent...",
              "ChangeImageLayer", "Base", "1", "Base",
              "ChangeImageLayer", "Expression", "Smile",
              "JumpToScene", "About the resort."
            ]
          },
          {
            "NameOfScene": "Talk about her work.",
            "theScene": [
              "ChangeImageLayer", "Expression", "Panic",
              "Speaks", "Ah yes, I am employed here as a 'boss monster'...",
              "ChangeImageLayer", "Expression", "Smile",
              "Speaks", "The resort owner contacted me through the mermaids. She was looking for someone big and imposing.",
              "ChangeImageLayer", "Expression", "Panic",
              "Speaks", "And I may be big, but in all honesty there is no one more imposing than the owner herself.",
              "ChangeImageLayer", "Expression", "Smile",
              "Speaks", "I have never seen anyone radiate so much confidence.",
              "Speaks", "Anyhow, the money offer was good. And I live nearby so it's not difficult for me to put on a show for adventurers, from time to time. Naturally, I accepted.",
              "PlayerSpeaks", "Were you on a leave until recently? Tina mentioned you...",
              "ChangeImageLayer", "Expression", "Panic",
              "Speaks", "I don't want to know what Tina said, I was training to be a better host!",
              "ChangeImageLayer", "Expression", "Shy",
              "Speaks", "I am not very confident about 'fighting', especially when I have to hold back and still make it entertaining. Those were the contract requirements.",
              "ChangeImageLayer", "Expression", "Smile",
              "Speaks", "Anyway, I don't really do much here. I get a notification if someone accepted a 'quest' to meet me, go out and 'perform'. Nobody even managed to defeat me until you came along.",
              "You nod and ask about her coworkers.",
              "ChangeImageLayer", "Expression", "Happy",
              "Speaks", "Well, there is Tina. She is a real sweetheart, if a bit of a chatterbox. Really supportive too.",
              "ChangeImageLayer", "Base", "BaseFlush",
              "ChangeImageLayer", "Expression", "Shy",
              "Speaks", "And very enthusiastic about... bikinis.",
              "ChangeImageLayer", "Base", "BaseBlush",
              "Speaks", "She kept bringing me these super embarrassing things... Slingshots, micro bikinis, pasties...",
              "ChangeImageLayer", "Expression", "Flustered",
              "Speaks", "I-I can't even put most of them on! And the ones I could, they don't stay on! How do they stay on on her?!",
              "ChangeImageLayer", "Expression", "Shy",
              "Speaks", "At some point she brought me this swimsuit, and I figured I'm not getting anything more reasonable from her.",
              "ChangeImageLayer", "Base", "BaseFlush",
              "Speaks", "When I put it on, all she said was 'super erotic'. She then ran off... I guess that's fine...",
              "ChangeImageLayer", "Base", "Base",
              "ChangeImageLayer", "Expression", "Smile",
              "Speaks", "Anyway, beside Tina and me there's only Mrs. Felicia, the owner. Don't know if you met her, she doesn't do much here. I think the resort is basically her retirement plan, so that makes sense.",
              "Speaks", "She can be a little scary at times, but otherwise I found her to be a very pleasant lady. Tina is super afraid of her though.",
              "ChangeImageLayer", "Expression", "Shy",
              "Speaks", "And I hear she has quite an appetite for men, so do watch out...",
              "ChangeImageLayer", "Base", "1", "Base",
              "ChangeImageLayer", "Expression", "Smile",
              "JumpToScene", "About the resort."
            ]
          },
          {
            "NameOfScene": "Return.",
            "theScene": [
              "JumpToScene", "Talk."
            ]
          },
          {
            "NameOfScene": "Done talking.",
            "theScene": [
              "JumpToScene", "MainHub."
            ]
          },
          {
            "NameOfScene": "About the fight.",
            "theScene": [
              "ChangeImageLayer", "Expression", "Shy",
              "Speaks", "Oh, it's all theatrics. I am sure you noticed nobody actually fights that way.",
              "You nod and agree that it is very grandiose.",
              "ChangeImageLayer", "Expression", "Panic",
              "Speaks", "It is honestly a little embarrassing...",
              "ChangeImageLayer", "Expression", "Smile",
              "Speaks", "I am a bit too powerful for the local adventurers, and also really bad at holding back. So our boss told me to use flashy, needlessly complicated and harmless magic to handicap myself, and to avoid more 'physical' attacks.",
              "Speaks", "For example, my butterfly spell doesn't actually do anything. It's a minor illusion to distract my opponent, and nobody would even look at it if I didn't tell them to.",
              "ChangeImageLayer", "Expression", "Panic",
              "Speaks", "Then at some point, the owner saw the Nereids worshiping me again, and told me to go with that for my fight. Goddess roleplay.",
              "ChangeImageLayer", "Expression", "Smile",
              "Speaks", "Of course, nobody actually thinks I am Goddess, not even the Nereids. But everyone enjoys the aesthetic.",
              "ChangeImageLayer", "Base", "1", "Base",
              "ChangeImageLayer", "Expression", "Smile",
              "JumpToScene", "Talk."

            ]
          },
          {
            "NameOfScene": "'How do you know my name?'",
            "theScene": [
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "ChangeImageLayer", "Expression", "Shy",
              "Speaks", "Oh, I apologize. I asked Tina when she came to convince me to fight you.",
              "ChangeImageLayer", "Expression", "Happy",
              "Speaks", "I am glad she did.",
              "ChangeImageLayer", "Base", "1", "Base",
              "ChangeImageLayer", "Expression", "Smile",
              "JumpToScene", "Talk."
            ]
          },
          {
            "NameOfScene": "Spar.",
            "theScene": [
              "ChangeImageLayer", "Base", "1", "Base",
              "ChangeImageLayer", "Expression", "Solemn",
              "As soon as you suggested a fight, she retreats away from the altar, and her face switches to her solemn dragon goddess persona.",
              "TimeBecomesNight",
              "ChangeBGM", "../ModLoader/mods/Beach/Music/PerituneMaterial_Shizima2.mp3",
              "ChangeBG", "../../ModLoader/mods/Beach/Images/altarNight.png",
              "ChangeImageLayer", "Overlay", "1", "Moonlight",
              "Speaks5", "Fine. Dragon Goddess Cetuspeanna accepts your challenge!",
                  "CombatEncounter",
                    "RunningWontSkipEvent",
                  "NoRunning",
                  "Cetuspeanna",
                  "StartCombat",
                  "GetEventAndIfChoiceIs", "CetuspeannaCombatEvents", "3", "Fainted", "CetuspeannaFaintedSpar",
                  "JumpToScene", "CetuspeannaBeatenSpar"
            ]
          },
          {
            "NameOfScene": "CetuspeannaFaintedSpar",
              "theScene": [
                "DisplayCharacters", "1", "End",
                "ChangeImageLayer", "Expression", "1", "EyesClosed",
                "RemovePerkQuietly", "Ethereal Hands",
                "Overwhelmed by the rampant magic spell, Cetuspeanna lays motionless in the shallow waters...",
                "TimeBecomesNormal",
                "ChangeImageLayer", "Overlay", "1", "",
                "ChangeBGM", "../ModLoader/mods/Beach/Music/PerituneMaterial_Starry_loop.mp3",
                "ChangeBG", "../../ModLoader/mods/Beach/Images/altar.png",
                "The magical night fades away quickly, giving way to the usual sunny ambiance. You are not quite sure what to do now, and no one shows up to help either.",
                "You think for a moment and decide to lay her in a comfortable position and wait until she wakes up.",
                "Fumbling through a mess of her tentacles and coiled tail, you reach her upper body, hauling her closer to land and carefully resting her head in your lap, almost poking your stomach with her horn in the process.",
                "You adjust her messy hair and a slipping swimsuit strap, and settle down to wait for her awakening.",
                "...",
                "Speaks", "Nnn...",
                "She stirs, eyelids fluttering for a moment before flying open.",
                "ChangeImageLayer", "Expression", "1", "Sleepy",
                "Speaks", "W-what happened...",
                "ChangeImageLayer", "Base", "1", "BaseFullBodyBlush",
                "ChangeImageLayer", "Tits", "1", "",
                "ChangeImageLayer", "ArmsBase", "1", "",
                "ChangeImageLayer", "ArmsTop", "1", "",
                "ChangeImageLayer", "Expression", "Shocked",
                "Speaks", "Ww-w-awawawa~~!!",
                "She almost leaps from your lap in embarrassment, flustered and rambling in panic.",
                "ChangeImageLayer", "Base", "1", "BaseBlush",
                "ChangeImageLayer", "Tits", "1", "Titties",
                "ChangeImageLayer", "ArmsBase", "1", "ArmsRest",
                "ChangeImageLayer", "Expression", "Flustered",
                "Speaks",
                "SwapLineIf", "Choice",
                  "2", "NotFaintedBefore", "W-what happened? Did I faint from our fight? No way!",
                  "2", "Fainted", "Nn-noo, did I faint again?! S-soo embarrassing! Aaah!",
                "endSwap",
                "You apologize and try to calm her down. She is still fuming from embarrassment, refusing to look you in the eyes.",
                "ChangeImageLayer", "Base", "1", "BaseBlush",
                "ChangeImageLayer", "BodyPart", "1", "ArmsRest",
                "ChangeImageLayer", "Expression", "Shy",
                "She takes a deep breath, then sighs.",
                "Speaks",
                "SwapLineIf", "Choice",
                  "2", "NotFaintedBefore", "Haaaa... I can't believe I let magic overcome me like this. Absolutely shameful...",
                  "2", "Fainted", "Haaaa... I can't believe I let this happen again. Absolutely shameful...",
                "endSwap",
                "ChangeImageLayer", "Expression", "ShyNonAvert",
                "She looks back to you, still clearly embarrassed from her loss.",
                "Speaks", "L-lets do something else, I need a distraction...",
                "ChangeImageLayer", "Base", "1", "BaseFlush",
                "JumpToScene", "MainHub"

            ]
          },
          {
            "NameOfScene": "CetuspeannaBeatenSpar",
            "theScene": [
              "ChangeBGM", "../ModLoader/mods/Beach/Music/PerituneMaterial_Shizima2.mp3",
              "DisplayCharacters", "1", "End",
              "ChangeImageLayer", "Expression", "1", "MildlyAroused",
              "RemovePerkQuietly", "Ethereal Hands",
              "Panting heavily Cetuspeanna retreats farther into water, signaling that the fight is over.",
              "Speaks", "Haa... Good job, {thePlayerName}. This was fun.",
              "ChangeImageLayer", "Expression", "1", "SoftSmile",
              "TimeBecomesNormal",
              "ChangeImageLayer", "Overlay", "1", "",
              "ChangeBG", "../../ModLoader/mods/Beach/Images/altar.png",
              "StopBGM",
              "The weather returns to normal, moonlit night gone in mere moments. Cetuspeanna comes closer again, curling around the altar and resting her upper body across from you.",
              "Speaks", "Haa... Let's take a little break for now, I am a little winded.",
              "You nod and sit down on the altar again, also feeling somewhat tired from the intense spar session.",
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "JumpToScene", "MainHub"
            ]
          },
          {
            "NameOfScene": "Sex?",
            "theScene": [
              "ChangeImageLayer", "Base", "1", "BaseFullBodyBlush",
              "ChangeImageLayer", "Tits", "1", "",
              "ChangeImageLayer", "ArmsBase", "1", "",
              "ChangeImageLayer", "ArmsTop", "1", "",
              "ChangeImageLayer", "Expression", "1", "Tiny",
              "Speaks", "Ah- y-you mean you want to spar? No?",
              "ChangeImageLayer", "Expression", "1", "Shy",
              "Speaks", "Just casual s-s-sex? Umm...",
              "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
              "Speaks", "...",
              "ChangeImageLayer", "Expression", "1", "Shy",
              "Speaks", "Okay... Maybe...",
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "ChangeImageLayer", "Tits", "1", "Titties",
              "ChangeImageLayer", "ArmsBase", "1", "ArmsRest",
              "ChangeImageLayer", "Expression", "1", "Rules",
              "Speaks", "But there are rules!",
              "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
              "Speaks", "No vaginal, no anal, and most importantly, no {i}k-k-kissing{/i}!",
              "ChangeImageLayer", "Expression", "1", "Rules",
              "Speaks", "And no being all manly and assertive, no pushing me down and making me {i}want{/i} to break my own rules!",
              "ChangeImageLayer", "Expression", "1", "Shy",
              "Speaks", "So what I am saying is... let's start slow, okay?",
              "You nod and agree to her terms, finding them fair.",
              "SetChoice", "7", "SexOpen",
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "ChangeImageLayer", "BodyPart", "1", "ArmsRest",
              "ChangeImageLayer", "Expression", "Smile",
              "JumpToScene", "Sex."
            ]
          },
          {
            "NameOfScene": "Sex.",
            "theScene": [
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "ChangeImageLayer", "Expression", "1", "Shy",
              "Speaks", "So...",
              "Menu",
                "Blowjob?",
                "Tentacles...",
                "RequiresChoice", "6", "TailPussyLooked",
                "Tail pussy sex...",
                "RequiresChoice", "8", "SexSuggestions",
                "Ask if she has any suggestions.",
                "RequiresChoice", "8", "SexSuggestionsAsked",
                "Rimjob.",
                "RequiresChoice", "8", "SexSuggestionsAsked",
                "Cunnilingus.",
              "EndMenu"
            ]
          },
          {
            "NameOfScene": "Blowjob?",
            "theScene": [
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
              "She flushes at the suggestion, but does not look particularly opposed as her eyes dart to your cock a few times.",
              "Speaks", "That is... acceptable. But...",
              "ChangeImageLayer", "Expression", "1", "Rules",
              "Speaks", "Absolutely no grabbing my horns, and no shoving your cock down my throat! Okay? Promise me.",
              "You nod and promise not to get too handsy, and she relaxes visibly.",
              "ChangeImageLayer", "Expression", "1", "Haughty",
              "Speaks", "Good...",
              "Actually, she looks positively dominant now, eyeing you up like a snake would its prey.",
              "Looking somewhat menacingly, the larger woman closes in and pushes you down softly. You find your upper body resting against her thick serpentine tail, as she pulls down your speedo, slowly.",
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "Anticipating the oral service your dick springs up energetically, pointing proudly at the dragoness' curled lips as soon as it was freed from its swimsuit prison.",
              "Cetuspeanna purrs throatily, pleased by your enthusiasm, and plants a brief, but very wet smooch at the tip of your cock, leaving behind a pleasantly tingling sensation and a string of saliva leading to her parted lips.",
              "Throbbing stronger from the erotic sight, your dick is eager for more. Your draconic partner sighs erotically and drags her large, long tongue over your entire length, caressing its underside slowly. Arriving at the tip, she flicks her tongue over your urethra and kisses your glans again.",
              "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
              "She licks it again, dragging her tongue over one of your shaft sides this time, humming as if marveling at the taste. Your cock is thoroughly smeared in her sticky saliva by now, throbbing happily and leaking some juices from the tip.",
              "Speaks", "Delightful taste...♥ Aaahm...♥",
              "She swallows your entire length effortlessly, trapping all inches of your meat in her large mouth. Inside, you feel her tongue flicking and stroking your glans as she suckles on your cock as if it were a tasty popsicle.",
              "ChangeImageLayer", "Expression", "1", "Haughty",
              "Pursing her lips tightly, she begins to drag them up and down your length, their wet pillowy softness feeling quite overwhelming, especially in tandem with the teasing from her tongue. You throb strongly and leak a large dollop of precum on her tongue which she gulps down greedily.",
              "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
              "Her lips travel down smoothly until they reach the base of your cock and meet your crotch with a wet smack. You are not sure why she was concerned about getting throatfucked, because her draconian size would require an unrealistically large penis to perform such a feat. She seems to reach the same conclusion and giggles over your dick briefly, before pulling back and popping your dick free of her mouth.",
              "ChangeImageLayer", "Expression", "1", "Haughty",
              "Speaks", "Ahh, such a tasty little treat.♥ Sometimes I forget just how {i}big{/i} I am...♥",
              "Speaks", "Well, how is it? Do you like getting {i}devoured{/i} by a big, mighty dragon?♥",
              "She teases your cock with the tip of her tongue while waiting for your response. You nod with a flush, eager to receive more of her delightful oral attentions and she smiles broadly.",
              "Gulping down on your entire cock in one go again, she starts sucking really strongly with her powerful mouth. You feel your knees getting shaky, as your cock feels like it will get sucked dry on the spot, and erupts with a large portion of precum again.",
              "Cetuspeanna slowly pulls away again, savoring your taste with obvious enjoyment. Her tongue drooling with a mix of saliva and precum she speaks up again, her hot breath tickling your throbbing cock.",
              "Speaks", "Fufu, don't be in a hurry. I like to take it slowly, so you can build up a nice... Thick... Steamy and hot load of cum for me.♥",
              "ChangeImageLayer", "Expression", "1", "HaughtyEyesClosed",
              "Her long tongue wraps around your erection again, jacking it off with lewd, sloppy sounds as it's drooling precum everywhere, desperate to blast the dragoness' lewd face with cum.",
              "ChangeImageLayer", "Expression", "1", "Haughty",
              "Unwrapping her tongue she swallows your desperately throbbing dick again, slowly and gently wiggling her tongue against its underside. You moan loudly, eager for release, right on the edge of a huge, messy orgasm. Suddenly, the serpentine woman smiles over your cock mischievously and stops all movement, denying you release yet again.",
              "ChangeImageLayer", "Expression", "1", "BigSucc",
              "As you gasp in protest, she suddenly starts sucking really strongly, instantly drawing out a huge eruption of semen that floods even her large mouth so quickly that she has to start swallowing desperately. Her throaty, pleasured moans intermix with loud gulping noises as she drinks up your massive load, brows furrowed and face completely flushed with lust.",
              "Not a single drop of cum escapes her ravenous mouth as she drinks up everything, draining you completely dry. Or so you think, because your cock is still hard inside her mouth and with a delighted moan she begins to slide her lips over it again.",
              "ChangeImageLayer", "Expression", "1", "Haughty",
              "Speaks", "Mmhh...♥ Moore...♥",
              "The unceasing, relentless blowjob feels overwhelming, but you can't deny how it makes you feel. Your cock throbs rapidly, as if doing its best to prepare for the next ejaculation.",
              "Her tongue joins in, wrapping around your glans and stroking wildly as her lips traverse your shaft in a sloppy, desperate and lewd manner.",
              "ChangeImageLayer", "Expression", "1", "Lustful",
              "Speaks", "Mmph! Mooore!♥",
              "Cetuspeanna is completely lost in throes of passion, desperately sucking on your dick, eager for more semen. You cannot hold out through such a sloppy, desperate blowjob, not after you've already cum just now, and begin to unload into her suckling mouth again.",
              "ChangeImageLayer", "Expression", "1", "BigSucc",
              "Your dick throbs powerfully with each ejection of hot seed, again and again as spurts of white seed fill her mouth just like she wanted.",
              "She swallows everything again, moaning and slurping up your sperm with indecent noises, ",
              "ChangeImageLayer", "Expression", "1", "Torogao",
              "Finally your dick goes limp and she lets go, letting it drop weakly from her saliva-drooling mouth. Her eyes are glazed over and pupils dilated, making you think she just came from swallowing your cum.",
              "Speaks", "Haa, haa...♥ Shoo goood...♥",
              "You both lie there for a moment, panting and coming down slowly from your respective orgasm heights, idly caressing each other's bodies in silent appreciation...",
              "...",
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "ChangeImageLayer", "Expression", "1", "Shy",
              "Speaks", "Umm... I r-really got into it, huh..?",
              "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
              "Speaks", "Let's take a little break to calm down, okay?",
              "You nod in agreement, still a little flushed with embarrassment and arousal from the intense and uncharacteristically sloppy fellatio...",
              "ChangeImageLayer", "Expression", "1", "Smile",
              "JumpToScene", "MainHub"
            ]
          },
          {
            "NameOfScene": "Tentacles...",
            "theScene": [
              "Your eyes drift to her numerous slick tentacles, wiggling idly in the air as if possessing a mind of their own.",
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "ChangeImageLayer", "Expression", "1", "SoftSmile",
              "Cetuspeanna seems to follow your gaze and smiles knowingly.",
              "Speaks", "Interested?",
              "The mass of slimy tentacles wiggles invitingly, and you have to admit that you are.",
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "ChangeImageLayer", "Expression", "1", "Haughty",
              "Speaks", "I understand. Well, come over here...",
              "She slithers around and behind you and pulls you closer, resting you against her upper body, the back of your head nestled comfortably in her soft bosom. Her arms wrap around your torso possessively, making you feel really small next to this gargantuan dragon, but also really safe.",
              "Speaks", "There, all mine.♥",
              "Her longer tentacles, all six of them, slither towards your crotch and begin to pull off your swimwear. They fumble and bump against each other, leaving a mess of light blue ooze everywhere.",
              "ChangeImageLayer", "Expression", "1", "ShySmile",
              "Speaks", "Fufu, I apologize.♥ They are a little unruly.♥",
              "ChangeImageLayer", "Expression", "1", "Haughty",
              "Finally your dick springs free, throbbing strongly as it gets surrounded by the tentacles. One of them looms above your tip, drooling down its colorful slime. Running down your dick, it feels cool and firmer than you'd expect, almost like slimegirl ooze.",
              "All of the tentacles then bump into and flatten against your shaft, as if greeting it with a hug. Your cock throbs powerfully in response, as their way of touching you is unusual but rather pleasant. Cetuspeanna giggles and whispers to you quietly.",
              "Speaks", "They're saying hello.♥",
              "Then, five of the tentacles wrap around your shaft symmetrically, forming a flower-like pattern around your ooze-smeared erection and begin pulsating around it, creating an intensely pleasurable sensation that sends shivers through your entire lower body. The sixth tentacle looms over your dick and begins to tickle your glans mischievously.",
              "This suddenly intense stimulation makes you gasp sharply, and Cetuspeanna strokes your hair softly with a quiet giggle.",
              "ChangeImageLayer", "Expression", "1", "NaughtyFace",
              "Speaks", "Good boy, good...♥ Don't hold back your voice, I want to hear more of your cute moans.♥",
              "The tentacles keep up their symmetrical dance, the blue slime they're oozing so profusely making lewd squelching noises with every stroke of your cock. The tentacle at your tip wraps around your glans tightly and begins to stroke in tandem with the other five.",
              "The different stroking motions feel amazing, sending ripples of pleasure through your entire body and your cock leaks precum abundantly. You shiver and moan in her embrace, entirely sure that an amazing orgasm will follow shortly.",
              "The tentacles seem to reach the same conclusion and begin to ripple and squeeze harder and faster, and are promptly rewarded for their efforts as your cock launches a fountain of thick jizz into the air.",
              "Tthe tip-assaulting tentacle makes sure to catch all of your erupting sperm, making it drip down onto the other tentacles below. Delighted by the lewd raid of spunk they wiggle in celebration, smearing each other and your dick in your thick cum.",
              "As your orgasm winds down, the tentacle previously at your tip descends and joins the others in slathering itself in hot seed. Their wiggling act is rather stimulating, especially on your post-orgasmic overly-sensitive dick, and you spray out another load, moaning loudly as your cock pushes out rope after rope of cum.",
              "This time the tentacles pile up on top of your cock, trapping all the ivory cum inside the wiggling sperm and ooze-smeared mess.",
              "Speaks", "Fufu, they look so happy.♥ Do you have any more for them, mm?♥",
              "She squeezes your nipples with her long fingers, causing you to moan in delight as you feel your third orgasm approaching in rapid succession.",
              "Speaks", "Go on.♥ Cum on them again.♥",
              "The tentacles form an attentive line and reach out to softly stroke your almost orgasming cock one by one, each touch almost making you explode all over them. The teasing pleasure is not quite enough to make you spurt normally, but you are too aroused to hold back right now.",
              "ChangeImageLayer", "Expression", "1", "Licc",
              "And so, you gasp and thrust your hips into the air weakly, raining another huge load on the dancing tentacles before finally going limp, completely spent from the powerful ejaculation. This time her hand joins the celebrating tentacles, scooping up some of your cum before disappearing out of your view. You do hear a pair of loud gulps above your head, but your mind is too focused on the fascinating mess of tentacles, ooze and cum around your dick to care.",
              "ChangeImageLayer", "Expression", "1", "Haughty",
              "You begin to drift off in her embrace, the tentacle play proving too stimulating to stay awake. Before you fall asleep, you see the tentacles nestling around your spent cock snugly.",
              "...",
              "You wake up groggily, still in her embrace, all cleaned up and re-dressed.",
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "ChangeImageLayer", "Expression", "1", "SoftSmile",
              "Speaks", "Sleep well?♥",
              "You nod, thanking her for watching over you. She giggles and begins to pull away, setting you free and slithering somewhat awkwardly away from the altar.",
              "ChangeImageLayer", "Expression", "1", "Shy",
              "Speaks", "Sorry, give me a moment to stretch my tail. It kinda fell asleep cause I didn't want to wake you up.",
              "You let go of the dragoness, allowing her to go for a quick swim. Soon enough she returns, wrapping around the altar and facing you again.",
              "ChangeImageLayer", "Expression", "1", "Smile",
              "Speaks", "Well, that was fun. Wanted to do anything else?♥",
              "JumpToScene", "MainHub"
            ]
          },
          {
            "NameOfScene": "Tail pussy sex...",
            "theScene": [
              "Your eyes idly drift towards the slick opening at her tail, and you can't stop your imagination from running wildly, picturing your cock being enveloped inside the wondrous orifice...",
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "ChangeImageLayer", "Expression", "1", "Haughty",
              "Speaks", "I see... you can't stop thinking about it, hmm?",
              "You gulp down and admit your desire, watching in fascination as her tail pussy's lips part slightly, drooling with more of the light blue liquid.",
              "Speaks", "Well... I would love to show you a good time with my tail. But are {i}you{/i} sure?",
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "ChangeImageLayer", "Expression", "1", "Smile",
              "Speaks",
              "SwapLineIf", "Choice",
                "9", "TailPussyNotFucked", "I was being completely honest when I said it may be too much. Your recall stone will definitely activate, and there will be lasting consequences...",
                "9", "TailPussyFucked", "You remember how it ended last time... This time likely won't be different.",
              "endSwap",
              "Menu",
                "Want to try...",
                "...Maybe later.",
              "EndMenu"
            ]
          },
          {
            "NameOfScene": "Want to try...",
            "theScene": [
              "ChangeImageLayer", "Expression", "1", "NaughtyFace",
              "She smiles, visibly delighted by your answer.",
              "Speaks", "I won't deny it, I am glad to hear yo say that.♥",
              "Her tail pussy opens ravenously, a stream of azure liquid drooling out over the black tentacles, which rub each-other excitedly as if anticipating something.",
              "The dragoness pulls closer, wrapping her arms around you and cradling you against her upper body. You feel small and vulnerable in the embrace of such a big dragoness, but it only serves to excite you further, anticipation of her obscene tail's touch building ever higher.",
              "ChangeImageLayer", "Expression", "1", "Haughty",
              "Speaks", "Don't worry about losing yourself, I'll hold you close...",
              "ChangeImageLayer", "Expression", "1", "NaughtyFace",
              "Speaks", "And I want to look carefully on all the amazing faces you'll definitely show me.",
              "Her face looms above yours, carefully taking in your features as a droplet of cool liquid drops on your cock. The sensation surprising you somewhat, you look down. You are not sure when you slipped out of your speedo, but her tail pussy is already looming right above your stiff erection, ready to devour it.",
              "ChangeImageLayer", "Expression", "1", "Haughty",
              "Speaks", "Look inside... Isn't it erotic? Look at those wet, sloppy and pulsating pussy walls... Those jet-black tentacles... The sloppy, lewd liquid that drips out ever so slowly...",
              "Her voice is a lusty whisper, the obscene descriptions of her erotic orifice making you pant with arousal as you ogle the strange organ, unable to look away.",
              "Speaks", "Aren't you just dying to put your penis in there? Tell me.",
              "You nod eagerly, unable to look away from the indecent display, as her slit opens widely, threatening to engulf your overly excited dick. Cetuspeanna chuckles softly, bobbing her tail pussy up and down over your dick teasingly, making you thrust your hips upwards weakly.",
              "Speaks", "Fufu, are you that desperate to get inside? Why the hurry?",
              "ChangeImageLayer", "Expression", "1", "NaughtyFace",
              "Speaks", "Don't forget... As soon as you're inside, you will cry out... and start cumming pitifully. You probably won't get to enjoy it normally, it will just be one big orgasm...",
              "Speaks", "So why the hurry? Or are you a fan of ejaculating prematurely, mm? Naughty, needy boy...♥",
              "You flush from her chastising words, but can't deny your body's desire for that promised overwhelming stimulation. As proof of your lust, your cock throbs and leaks a droplet of precum, intermixing with the azure liquid that keeps dripping from her tail pussy.",
              "You reaize that your cock tingles powerfully from this strange liquid, feeling sensitive even to the air touching it. An uncontrollable desire to orgasm fills your senses, making you whine needily in her embrace.",
              "Speaks",
              "SwapLineIf", "Choice",
                "9", "TailPussyNotFucked", "Ah, so you noticed? That's right, this isn't just lubrication. A mere drop of it makes your penis really sensitive.♥ That is why you will orgasm an amazing lot, and not just because my tail pussy feels really good.",
                "9", "TailPussyFucked", "Fufu, you know your cock defenses are all softened up already... You know how amazing it will be to stuff your cock in my tight tail pussy... And you can't get enough of the thought.♥",
              "endSwap",
              "Cetuspeanna strokes your hair as she speaks, her teasing tail pussy still denying you the sweet insertion as it bobs to the sides of your engorged erection.",
              "Speaks", "You want to cum so much... Leak everything into my tail, everything that you have, and more. More than you thought you had.♥",
              "Speaks", "Well that's alright... I love honest boys who want nothing more than to cum for me...♥",
              "Her hand grips your own as her tail pussy finally begins to descend, if really slowly. You start panting with lust, unable to wait for the heavenly insertion anymore.",
              "Speaks", "Here, hold my hand...♥ Grip tight and don't hold back your moans...♥",
              "The slick orifice finally reaches your cock and slides down smoothly and quickly, engulfing your entire length in a single motion. You have a moment to process the feeling of soft, yielding flesh grasping your manhood, and in the next second you are cumming, just as she said you would.",
              "The intense orgasm bends your lust-addled  mind, replacing all your thoughts with the distinct sensation of filling her tight tail pussy with your splooge. All your thoughts are dominated by images of your thick cum rushing out powerfully to be devoured by her insatiable tail. You cum and cum, jets of almost scathingly hot jizz rushing through your shaft as you shudder and moan uncontrollably",
              "Cetuspeanna giggles softly but you don't hear her. You can only feel the indescribable insides of her tailpussy squeezing out your sensitive prick again and again. Each moment your cock spends inside is an orgasm on top of an orgasm, and your dick finally goes completely loose from the overwhelming sensations. Interchanging between shooting out powerful jets of cum and dribbling out a weak river of sticky splooge, your cock is completely lost in an endless stream of ejaculations.",
              "All the massive amounts of cum that you're spurting get gobbled up by her tail effortlessly, and with a dim despair you begin to realize that your blissful, mind-ruining orgasm is finally subsiding.",
              "However, all of a sudden, you feel the small black tentacles wrap around your testicles and the strangest sensation fills your being. Your cock starts cumming again, stronger than before and you almost black out from the amazingly intense first shot.",
              "Speaks", "Fufu... You'll never get used to that sensation...♥",
              "You don't understand her words, completely immersed in the sublime sensation of your restarted orgasm, simply doing your best to spurt inside again and again. She purrs in delight, the tail orifice sucking down the river of your cum with loud gulping noises",
              "Speaks", "Once more...♥",
              "Your cock tenses up again as her dark tentacles send a final jolt of magic into your balls and you start cumming like a broken faucet, squirting out your seed uncontrollably and unendingly. And in the next moment you black out, your mind completely unable to process any more of this divine, overwhelming pleasure...",
              "SetChoice", "9", "TailPussyFucked",
              "ChangeFetish", "Monstrous", "1",
              "ChangeSensitivity", "Sex", "7",
              "GameOver"
            ]
          },
          {
            "NameOfScene": "...Maybe later.",
            "theScene": [
              "ChangeImageLayer", "Expression", "1", "Wistful",
              "She nods, looking somewhat disappointed but doing her best to hide that.",
              "Speaks", "That is a sensible decision. We can just think of something else.",
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "ChangeImageLayer", "Expression", "1", "Smile",
              "JumpToScene", "MainHub"
            ]
          },
          {
            "NameOfScene": "Ask if she has any suggestions.",
            "theScene": [
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
              "Speaks", "Something I'd want..? W-well...",
              "ChangeImageLayer", "Expression", "1", "Shy",
              "She goes quiet for a moment, thinking of a suggestion or perhaps working up courage to bring it up.",
              "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
              "Speaks", "W-well... I, ah, have something of an interest in... male butts.",
              "ChangeImageLayer", "Expression", "1", "Shy",
              "Speaks", "So if you're interested, I'd lo- like to give you a rimjob? If you want.",
              "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
              "Speaks", "Alternatively... I know I said no vaginal, but... If you wanted to eat me out, I would like that very much.",
              "ChangeImageLayer", "Expression", "1", "Panic",
              "Speaks", "A-anyway! These are my ideas, just tell me if you're interested...",
              "SetChoice", "8", "SexSuggestionsAsked",
              "JumpToScene", "Sex."
            ]
          },
          {
            "NameOfScene": "Rimjob.",
            "theScene": [
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "ChangeImageLayer", "Expression", "1", "Flustered",
              "Speaks", "R-really, you're interested?",
              "ChangeImageLayer", "Expression", "1", "Happy",
              "Speaks", "...♥",
              "ChangeImageLayer", "Expression", "1", "NaughtyFace",
              "Speaks", "Then... let's do it like this.",
              "She drags her upper body unto the stone altar next to you, and reclines backwards on her elbows.",
              "Speaks", "Okay... Now, take off your swimwear and get on all fours in front of me.",
              "You do as she says, feeling a little vulnerable and awkward exposing your butt in front of her face like that, but also anticipating the surely pleasurable act.",
              "Your dragon lover rests her cool hands on your buttcheeks, squeezing them appreciatively. Tentatively, she traces her finger around your butthole, eliciting a pleasured yelp from you.",
              "Speaks", "Fufu, great reaction... I can't wait anymore, let's do this.♥",
              "ChangeImageLayer", "Expression", "1", "Licc",
              "She brings your ass lower and closer to her face, giving your anus an experimental lick. Her long, slippery tongue dragging across your sensitive hole feels really good, and your dick throbs appreciatively in response.",
              "ChangeImageLayer", "Expression", "1", "NaughtyFace",
              "She draws away for a moment, squeezing your asscheeks again, and lets out an erotic sigh.",
              "Speaks", "So hot...",
              "ChangeImageLayer", "Expression", "1", "BigLicc",
              "She plants her face in your ass again, this time giving your anus a sloppy, tongue-filled kiss. One of her hands travels to your dick, caressing your heavy testicles with her palm before giving your shaft an experimental pump. Your cock throbs happily in response, greatly enjoying her double-ended ministrations.",
              "With her other hand she shifts one of your asscheeks aside, spreading your anus a bit and allowing her long tongue to slither inside, making you emit a sharp, pleasured gasp.",
              "Slithering deeper inside, her tongue is probing curiously at your inner walls as her hand keeps softly pumping your cock, making it drool a stream of sticky precum on her stomach.",
              "Finally, her exploratory tongue hits upon your prostate, making your dick jerk powerfully, and leak a huge dollop of precum. With a satisfied hum she begins to attack your sensitive love-button with her strong tongue, increasing the speed of her milking handjob.",
              "Your knees start shaking from the intense pleasure, and you almost collapse on top of her. The dragoness pulls away, patting your ass reassuringly before speaking up.",
              "ChangeImageLayer", "Expression", "1", "Haughty",
              "Speaks", "Ah, is it becoming hard to stand? That's okay, you should lie down on my chest.",
              "ChangeImageLayer", "Expression", "1", "NaughtyFace",
              "Speaks", "My tongue is really long so I'll still be able to reach your butt.",
              "You collapse almost immediately, thankful for the offer as remaining upright was getting increasingly difficult. Your cock nestles snugly right between her soft tits, making you both comfortable and more aroused.",
              "Speaks", "There, all comfortable? Though now your penis is resting between my boobs... I can't really jerk it anymore, but I suppose that feels pretty good too, yes?",
              "The only response you manage is to rub your cock against her soft tits needily, and the dragoness chuckles amusedly before getting back to rimming you.",
              "ChangeImageLayer", "Expression", "1", "Licc",
              "With both her hands free she uses her fingers to help her tongue, caressing the sensitive rim of your anus as the slippery appendage dives back inside, instantly locating your prostate again, and making you have a mini-orgasm on the spot.",
              "ChangeImageLayer", "Expression", "1", "BigLicc",
              "As her tongue digs deeper, pressing more and more insistently on the tender pleasure nub, your dick lets loose completely, flooding the soft valley of her cleavage like a broken dam. You shiver and bury your face into her soft stomach, gasping and moaning shamelessly as your cock keeps leaking seminal fluids with no restraint.",
              "Cetuspeanna hums contentedly, clearly enjoying your unhinged reactions and redoubles her efforts. The pleasure becomes almost unbearable, and you feel like you're pumping out more cum than your cock was built to, as the huge load overflows and drools down unto the altar.",
              "With one last, long jet you squirt one more rope of cum into the mess between your bodies and go limp, physically unable to orgasm any more, only managing to pant weakly from the overwhelming pleasure that just shook you to the core.",
              "ChangeImageLayer", "Expression", "1", "NaughtyFace",
              "Sensing that your cock is no longer throbbing wildly, Cetuspeanna pulls her tongue away. She then sits up, making you slide down to her tail, leaving a trail of cum over her stomach. She startles and manages to catch you before you slip off completely.",
              "Speaks", "Oh, I am so sorry about that, hehe. Didn't expect you to slide off like that...",
              "Cradling you in her large arms she turns you around and sits you beside herself, resting you against her torso.",
              "Looking down, she marvels at the huge load of spunk smeared all over her stomach and tits.",
              "ChangeImageLayer", "Expression", "1", "ShyNonAvert",
              "Speaks", "W-wow... That's a lot of cum. I suppose this must've felt really good?",
              "You nod weakly in response, still basking in the afterglow of the super intense orgasm.",
              "ChangeImageLayer", "Expression", "1", "NaughtyFace",
              "Speaks", "I'm glad...♥ I had a lot of fun doing this too.",
              "You spend a quiet moment together, enjoying the afterglow and each other's presence. Eventually, you reluctantly disentangle yourself from your dragon lover, and she goes for a quick swim to rinse off the huge mess you left on her, but not before scooping up some of it for a taste when she thinks you're not looking.",
              "JumpToScene", "MainHub"
            ]
          },
          {
            "NameOfScene": "Cunnilingus.",
            "theScene": [
              "ChangeImageLayer", "Expression", "1", "Shy",
              "When she hears the suggestion, Cetuspeanna blushes fiercely but also nods eagerly, not daring to look you in the eye",
              "While the dragoness is fidgeting shyly, you waste no time and move closer to her. She reclines backwards, resting herself against her thick tail, and moves her hands towards her crotch, touching her bikini bottom but not daring to pull it off by herself.",
              "You lean closer, her flat tummy leveled with your face. Moving closer, you plant a gentle kiss on it, drawing out a shy gasp from Cetuspeanna. You kiss again, and again, moving lower with every wet smooch until you arrive at her crotch, still concealed by the bikini bottom she didn't dare to remove.",
              "ChangeImageLayer", "Base", "1", "BaseFullBodyBlush",
              "ChangeImageLayer", "Tits", "1", "",
              "ChangeImageLayer", "ArmsBase", "1", "",
              "ChangeImageLayer", "ArmsTop", "1", "",
              "ChangeImageLayer", "BikiniBottom", "1", "",
              "Pulling down the flimsy cloth you reveal her cute puss, already drooling with clear nectar, and note that her entire body seems to be flushed with visible arousal, giving her body a purpler hue.",
              "You cast a glance upwards, enjoying the contrast between dragoness' still shy expression and her lusty gaze, and slowly drag your tongue across her wet pussy.",
                "ChangeImageLayer", "Expression", "1", "Aroused",
              "Speaks", "Ahh...♥ y-you're really licking meee...♥",
              "The draconic woman seems to enjoy the touch of your tongue a great deal, whining in pleasure as her pussy instantly becomes even wetter. Her arms fidget around you with uncertainty, before settling down on your shoulders. The hands tense up, gripping you desperately as soon as you start eating her out again.",
              "Speaks", "O-ooh...♥",
              "She tastes and smells amazing, if a little salty, the taste reminding you a little of all the possible oceanic bounties at once. You dig your tongue deeper into her flooded puss, eager to enjoy more of the salty taste and fragrance.",
              "The meaty walls of her pussy squeeze down on your intruding tongue, as if trying to drag you deeper inside. You oblige and faceplant into her puss, nose poking in her clit, and dig in as deep as you can.",
                "ChangeImageLayer", "Expression", "1", "Helpless",
              "Speaks", "Aaaaah!♥ Soo deep...♥",
              "The serpentine woman wiggles in ecstasy, her larger body almost knocking you away, but you manage to stand your ground and keep focusing your mouth's efforts on eating her out.",
              "Feeling your tongue getting increasingly sore, you use your hands to help yourself with the uneasy task of getting the large dragoness off. Slipping three of your fingers into her squirming pussy, you also trap her stiff clit between two fingers of your other hand.",
                "ChangeImageLayer", "Expression", "1", "BigSucc",
              "Speaks", "Eek!♥ Oooh...♥",
              "You couldn't imagine her getting any wetter, but she does, almost choking you with the delightful juices that flood your mouth. You try to lap everything up, never forgetting to keep teasing her sensitive bits, but most of it drools past your mouth and down your chin, chest and everywhere else.",
              "Your cock is painfully hard at this point, but with all of your efforts concentrated on her pussy, you resign yourself to not getting off for this. However, you feel her tentacles slither inside your speedo, affectionately wrapping up your cock as you work her overflowing puss.",
              "The slimy, wiggling delight brought by her tentacles pushes you to lick harder, and you dig into her puss savagely. Cetuspeanna screams, lost in throes of passion as she pushes your head deeper into her crotch with her hands. Her entire lower body quivering uncontrollably, she seems to be on the verge of a powerful orgasm",
              "Her tentacles wiggle like crazy, creating an indescribably sloppy mess of slime and precum in your speedo together with them. You pump your fingers into her faster, trying to keep up with their pace, and soon both of you are climaxing wildly, not stopping for a moment your efforts in getting each other off.",
                "ChangeImageLayer", "Expression", "1", "Oface",
              "Speaks", "Aaaaah!♥ S-so goo-, I-I'm cumming!!!♥",
              "Your face gets splattered by even more of her juices, as you're flooding your speedo with a massive load, knees shaking from her amazingly slick tentacles prancing around your orgasming cock. You keep licking absent-mindedly, too focused on the task to even get distracted by your orgasm, each lick eliciting a lustful gasp from the dragoness.",
                "ChangeImageLayer", "Expression", "1", "Torogao",
              "Finally your orgasms wind down and you fall to the side, a little exhausted. She softly pushes you up with her strong tail, cuddling you closer as she is still gasping for air, completely out of breath.",
              "Speaks", "Haa, haa...♥ Oh {thePlayerName}, that was amazing...♥",
              "You can only nod, face still drenched with her sticky honey as you cuddle closer to her delightfully large body, already drifting away from exhaustion...",
              "...",
              "ChangeImageLayer", "Base", "1", "BaseBlush",
              "ChangeImageLayer", "Tits", "1", "Titties",
              "ChangeImageLayer", "ArmsBase", "1", "ArmsRest",
              "ChangeImageLayer", "BikiniBottom", "1", "Bottom",
              "You wake up still in her embrace, stirring and disentangling yourself from the cuddly serpent as you sit up. She squeezes your hand longingly for a moment before letting go, and gives you a shy smile before sitting up as well.",
              "ChangeImageLayer", "Expression", "1", "Tiny",
              "Speaks", "Want to do something else now..?♥",
              "JumpToScene", "MainHub"
            ]
          },
          {
            "NameOfScene": "Leave.",
            "theScene": [
              "You decide it is time to return and bid farewell to the dragoness. She nods curtly, raising her body from the sand before retreating back into the water.",
              "ChangeImageLayer", "Base", "1", "BaseFlush",
              "ChangeImageLayer", "BodyPart", "1", "ArmsRest",
              "ChangeImageLayer", "Expression", "Smile",
              "Speaks", "Very well. It was good seeing you again, {thePlayerName}.",
              "DisplayCharacters", "End",
              "With a little wave Cetuspeanna disappears into the water and you backtrack through the resort towards town."
            ]
          }
    ]
}
