{
    "name": "Tina Quest!",
    "CardType": "Quest",
    "CardLimit": "0",
    "Description": "Brave adventurers (who are good at social interactions), please come and see me at the far border of resort area! I won't be at my booth! Tina needs your help! I pay in kisses. Oh, and a thousand Eros! \n- Tina.♥ \nThere is a footnote with a cutesy drawing of Tina's smiling face.",
    "requires": [""],
    "Speakers": [
                  {
                    "name": "Felicia",
                    "postName": "",
                    "SpeakerType": "Monster"
                  },
                  {
                    "name": "???",
                    "postName": "",
                    "SpeakerType": "?"
                  },
                  {
                    "name": "Tina",
                    "postName": "",
                    "SpeakerType": "Monster"
                  }
                ],
    "EventText": [
                    {
                      "NameOfScene": "EventStart",
                      "theScene":[  "DenyInventory",

                        "SetChoice", "1", "NoSex",
                        "Arriving at a less-groomed portion of the beach you begin to struggle with your footing, and trekking through uneven, shell-littered sands under the blazing sun becomes increasingly difficult. This must be the end of resort area, so you look around in search of Tina.",
                        "Nobody seems to be around. You'd expect to spot at least a couple of giggling mermaids in the waters, but sharp-looking rocks jutting out from water would indicate that even waters are inhospitable around these parts.",
                        "Finally, you spot the familiar figure of the tall succubus in the distance behind one of the palm trees. Curious about the so-called 'Tina Quest' you approach her.",
                        "DisplayCharacters", "3", "End",
                        "ChangeImageLayer", "Base", "1", "Flush",
                        "ChangeImageLayer", "Expression", "1", "Grin",
                        "ChangeArousalQuietly", "15",
                        "Tina seems to be in the middle of doing some warm-up exercises, currently touching her toes with her hands. Her large and appetizing butt is sticking out into the air, and her bosom is squeezed tightly between her thighs. Seeing you approach, she flashes you a cheeky grin on her currently upside-down face.",
                        "Speaks3", "Oh, hello {thePlayerName}!",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "You greet the succubus back as she gracefully lifts her body, twirling around to face you again with a happy smile on her flushed face, a droplet of sweat running and disappearing into the valley between her jiggling boobs.",
                        "Speaks3", "I was just feeling a bit too nervous and decided to exercise!",
                        "ChangeImageLayer", "Expression", "1", "Beg",
                        "Speaks3", "I really hope you are here about my quest!",
                        "You nod and inquire her about the details.",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "Base",
                        "Speaks3", "Yes, you see, I need you to speak to someone on my behalf. My boss.",
                        "ChangeImageLayer", "Expression", "1", "Awkward",
                        "Speaks3", "She's the owner of this entire beach, but she never visits the resort! I know she comes here to suntan, but she always stays outside of the resort area.",
                        "ChangeImageLayer", "Expression", "1", "Beg",
                        "Speaks3", "I need to know why! I'm worried that she hates it here and I am doing a bad job! Why else would she choose to tan all alone, surrounded by sharp rocks and stuff.",
                        "ChangeImageLayer", "Expression", "1", "Base",
                        "Speaks3", "She's not an unsociable person either, so the whole thing is a mystery to me.",
                        "You ask why she won't talk to her boss herself.",
                        "ChangeImageLayer", "Base", "1", "Flush",
                        "ChangeImageLayer", "Expression", "1", "Awkward",
                        "Speaks3", "Ahh, umm... I am actually a bit scared of her. She is kind of a bully, in my experience! She always tricks me into doing stupid things that end awkwardly for me.",
                        "ChangeImageLayer", "Expression", "1", "Focused",
                        "Speaks3", "I also find her hard to talk to, reminds me of speaking to my grandma.",
                        "ChangeImageLayer", "Expression", "1", "Awkward",
                        "Speaks3", "Ah! Don't tell her I said that! Don't tell my grandma either.",
                        "Speaks3", "Ohh, I am rambling... Anyway! Please, ask her why she doesn't come to her resort.",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "Base",
                        "Speaks3", "And be on your guard... I am not saying she will pounce and bully you, but... She might pounce and bully you...",
                        "ChangeImageLayer", "Expression", "1", "Awkward",
                        "Speaks3", "Ahaha... She is also fairly strong, but I doubt she'd go all out... So be careful, okay?",
                        "ChangeImageLayer", "Expression", "1", "Grin",
                        "Speaks3", "At least try to ask her before she starts fucking you silly! You can do it! You can always try during the act too!",
                        "ChangeImageLayer", "Base", "1", "Flush",
                        "ChangeImageLayer", "Expression", "1", "Awkward",
                        "Speaks3", "Uuu... I am not helping, am I? Sorry.",
                        "ChangeImageLayer", "Expression", "1", "Grin",
                        "Speaks3", "Anyway, just do your best!",
                        "You give her a skeptical stare and ask who you should be looking for.",
                        "ChangeImageLayer", "Expression", "1", "Base",
                        "Speaks3", "Oh, right! You'll be looking for this hot catgirl milf with impeccable taste in bikini.",
                        "Speaks3", "The beach out there is kinda empty and... sharp, so watch your step. Not even the Nereids come there, so at least you won't be attacked on the way. Keep an eye out for an umbrella and you should find her fast.",
                        "You nod and walk out of the resort area, intent on finding the catgirl for Tina.",
                        "DisplayCharacters", "2", "End",
                        "JumpToScene", "Looking4Cat"
						]
                    },
                    {
                      "NameOfScene": "Looking4Cat",
                      "theScene": [ "ChangeBGM", "music/Desert/Purple Planet Music - Dreamy - Sundial (5_52) 88bpm.mp3",
                      "The shores here are in an even worse condition than you thought, and you find yourself struggling against sharp rocks and shells with every uneven step you take.",
                      "With the beach stretching as far as you can see and no umbrellas in sight, you feel slightly overwhelmed. But the feeling of adventure drives you ever forward, and the feeling of curiosity about the mysterious resort owner fuels your advance.",
    									"After a quarter-hour of suffering through the hot, rocky sands and almost twisting your ankle twice, you stop your reckless advance to catch a quick breather and take a look around more carefully.",
    									"Covering your eyes from the blazing sun you look around, a sigh of relief leaving your lips as you finally spot it: a colorful umbrella standing in the distance, almost hidden behind a palm tree. Invigorated by finally having a goal in sight, you resume walking.",
                      "Your thoughts drift back to Tina's words, about her boss being a bully and potentially pouncing on you. You are no stranger to overly proactive monsters attacking you, but still find yourself slowing down the closer you get to your target. Are you ready to fight someone like that, should it come down to it?",
                      "As luck would have it, several large boulders and a palm tree stand tall between you and the umbrella, likely concealing your approach. You realize that you could try to sneak up on her, to better gauge the situation before you act.",
                      "Menu",
                        "Approach boldly.",
                        "Try to sneak up. (Technique)",
                      "EndMenu"
                      ]
                    },
                    {
                      "NameOfScene": "Approach boldly.",
                      "theScene": [
                        "Given that your goal here is to have a conversation, you see little reason to sneak around. Casting aside your concerns, you decide to approach the umbrella openly and without hiding.",
                        "Taking a short detour around the boulders you walk up from the side, ensuring that your approach is visible from afar, and in turn allowing you to examine the person relaxing underneath the umbrella.",
      									"DisplayCharacters", "1", "End",
        								"ChangeImageLayer", "Expression", "1", "Confus",
                        "Sure enough, you see a mature-looking catgirl, (or should you say, a catwoman?) resting on a comfy-looking beach couch, cocking her head to the side as she notices you.",
                        "Her strikingly cat-like eyes regard you carefully over her sunglasses as you approach, but she makes no attempts to attack you or even get up.",
      									"Speaks2", "Can I help you, young man? This isn't part of the resort, you know. Are you lost?",
                        "You shake your head, introduce yourself and explain that you were looking for her at Tina's request.",
      									"Speaks2", "Tina? Hmm...",
                        "ChangeImageLayer", "Base", "1", "BaseCute",
        								"ChangeImageLayer", "Expression", "1", "Smug",
                        "Speaks2", "I see, I see, Tina... Well, let's hear what she wants from me. Name's Felicia by the way. And...",
                        "ChangeImageLayer", "Base", "1", "Base",
        								"ChangeImageLayer", "Expression", "1", "InvitingSmile",
                        "Speaks", "Why don't you sit down first? It feels unpleasant to talk to someone just looming awkwardly over me.",
                        "She shifts and curls up her legs, squishing her expansive bosom with her knees and freeing up some space on the couch for you to sit down.",
                        "Menu",
                          "'I'll stand.'",
                          "Sit down.",
                        "EndMenu"
                      ]
                    },
                    {
                      "NameOfScene": "'I'll stand.'",
                      "theScene": [
                      "ChangeImageLayer", "Expression", "1", "Pout",
                        "Speaks", "Oh, fine, fine. You adventuring types are always so needlessly careful.",
                        "ChangeImageLayer", "Expression", "1", "Smug",
                        "She extends her legs again, taking some time, perhaps too much time, to show off their shapely form before regarding you again.",
                        "Speaks", "So, let's hear it. Why did the silly succubus girl send you looking for little old me? Tell me all about it.",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "As she speaks, she softly but rather openly caresses her body with her fluffy-looking paws, never breaking eye contact with you.",
                        "You explain that Tina is worried about her boss never coming to enjoy the resort. As you're talking, you can't help but get distracted by Felicia's seemingly absent-minded self-fondling. Right now she is softly bouncing one of her tits in her paw, and you have to stop momentarily to gather your focus.",
                        "ChangeArousalByPercent", "10",
                        "IfPlayerArousalOverPercentOfMax", "50", "PitchingATent",
                        "Menu",
                          "Try to stay focused.",
                          "Ogle her as you speak...",
                        "EndMenu"
                      ]
                    },
                    {
                      "NameOfScene": "Try to stay focused.",
                      "theScene": ["You continue explaining Tina's worries, doing your best to maintain eye contact and not let your eyes wander as the cat milf continues her unsubtly teasing motions.",
                        "Slowly running one of her paws across her thigh, she tugs at her swimsuit's strap with the other, bouncing her heavy tit from side to side repeatedly.",
                        "You realize that you've been gaping for a moment, but manage to snap out of it and finish what you were saying. You can only hope she is actually listening, given how absorbed she looks by her not so subtle seduction attempts.",
                      "ChangeArousalByPercent", "25",
                      "IfPlayerArousalOverPercentOfMax", "50", "PitchingATent",
                        "You've long since finished speaking, but Felicia seems in no hurry to give you a response. An awkward silence hangs for a moment longer, until finally, she folds her arms under her heavy breasts, further emphasizing their sizable weight, and chuckles softly.",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "Laugh",
                        "Speaks", "Good job, Hero. Not even an awkward boner, your self-control is commendable.",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "Smile",
                        "Speaks", "You can tell Tina not to worry. I will be visiting more often, starting next week.",
                        "ChangeImageLayer", "Expression", "1", "Smug",
                        "Speaks", "Of course, I am not telling you, or her, why.",
                        "ChangeImageLayer", "Expression", "1", "Predatory",
                        "Speaks", "But rest assured, you {i}will{/i} be seeing me more often.",
                        "JumpToScene",
                        "WrapUpFirstMeeting"
                      ]
                    },
                    {
                      "NameOfScene": "Ogle her as you speak...",
                      "theScene": ["You continue explaining Tina's worries, not bothering to tear your eyes away from the voluptuous body so readily on display before you, greedily taking in her pleasantly round forms as you find yourself babbling perhaps a little too disconnectedly.",
                        "ChangeArousalByPercent", "15",
                        "Felicia doesn't seem to mind at all, still pretending to listen intently as she bounces one of her tits in her paw, threatening to slip off her flimsy bikini from the wonderfully soft-looking orb of delight.",
                          "ChangeArousalByPercent", "24",
                          "As her other paw travels from her curvy tummy further south, towards her crotch, you have to stop and gulp down, but manage to finish your explanation without stumbling any more.",
                        "IfPlayerArousalOverPercentOfMax", "50", "PitchingATent",
                        "And without sporting an awkwardly visible boner too, you've even surprised yourself.",
                        "An awkward silence lingers for a moment, until finally, she folds her arms under her heavy breasts, further emphasizing their sizable weight, and chuckles softly.",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "Laugh",
                        "Speaks", "Good job, Hero. Your self-control is commendable.",
                        "ChangeImageLayer", "Expression", "1", "SmugTongue",
                        "Speaks", "Despite staring at my tits so much... Are you sure you don't have some problems down there?",
                        "ChangeImageLayer", "Expression", "1", "TongueOutWink",
                        "Speaks", "Just kidding.",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "Smile",
                        "Speaks", "You can tell Tina not to worry. I will be visiting more often, starting next week.",
                        "ChangeImageLayer", "Expression", "1", "Smug",
                        "Speaks", "Of course, I am not telling you, or her, why.",
                        "ChangeImageLayer", "Expression", "1", "Predatory",
                        "Speaks", "But rest assured, you {i}will{/i} be seeing me more often.",
                        "JumpToScene",
                        "WrapUpFirstMeeting"
                      ]
                    },
                    {
                      "NameOfScene": "PitchingATent",
                      "theScene": [
                        "While you managed to relay Tina's concerns, Felicia's not-so-subtle signals left you with a massive boner in plain sight, just barely constrained within your speedo.",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "Smug",
                        "Felicia looks up at you amusedly, then to your boner, and emits a throaty purr.",
                        "ChangeImageLayer", "Expression", "1", "SmugTongue",
                        "Gripping the strap of her swimsuit she pulls it off her tit, revealing her nipple with a playfully smug expression on her cat-like face.",
                        "Speaks", "Well, will you just... {i}stand{/i} there, or up for a...?",
                        "ChangeImageLayer", "Expression", "1", "Seductive",
                        "She makes a naughty gesture, thrusting her finger in and out of her fluffy fist, and shoots you a smoldering hot gaze.",
                        "Menu",
                          "Fuck her!",
                          "Stammer...",
                          "Turn her down.",
                        "EndMenu"
                      ]
                    },
                    {
                      "NameOfScene": "Fuck her!",
                      "theScene": ["Seduced by the slutty invitation, you move to plunge yourself into her tanned, voluptuous body with no restraint.",
                        "In mere moments you're on top of Felicia, balls-deep in her tight pussy and deeply kissing her as she wraps all four of her limbs around your back with a breathy moan.",
                        "ChangeImageLayer", "BikiniLayer", "1", "Naked",
                        "Her flimsy swimsuit just slips off to the sides from her large tits, as it always seemed to intend to do, giving you full access to her welcomely nude body.",
                        "ChangeImageLayer", "Expression", "1", "Pleasured",
                        "Speaks", "Good!♥ Mmh... so deep!♥",
                        "Your hips slap loudly against her meaty thighs as you thrust your engorged dick into her, driven increasingly wilder by your animalistic desire to copulate with this fertile-looking cat woman and her sexually welcoming attitude.",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "Expression", "1", "KissSloppy",
                        "Felicia kisses you passionately and sloppily, incoherent moans escaping into your mouth as her drooling pussy gets stirred and pounded. As her tongue slithers needily into your mouth she bucks her hips in pleasure, as if urging you to go even harder.",
                        "Felicia's yieldingly soft body just keeps drawing you in, harder and deeper with each pleasure-filled thrust you make. She moans and moves her surprisingly strong legs in tandem with your hips, empowering your passionate thrusts.",
                        "The slapping sounds of your uncontrollably wild coupling fill the air, intermixed with lustful moans and giggles of the horny cat milf, and would surely attract a lot of attention if you weren't all alone on this beach.",
                        "The crazed copulation doesn't last long, it simply cannot, and soon you feel an intensely rising urge to orgasm and fill the cat lady to the brim with your cum.",
                        "Seemingly sensing that, Felicia {i}purrs{/i} loudly and wraps her arms around you in a crushing hug, mashing your chest against her plump tits before locking her legs tightly around your waist.",
                        "ChangeImageLayer", "Expression", "1", "NeedyHorny",
                        "Speaks", "{i}Inside!{/i} Fill me up!♥",
                        "With a groan you oblige and blast her womb with a powerful ejaculation, painting her insides white with hot and sticky seed, much to her delight as she shivers and squeals unabashedly, completely lost in shameless pleasure.",
                        "Her wildly spasming pussy squeezes your ejaculating penis tightly, desperately trying to milk out as much semen as possible. You buck your hips in response, eagerly trying to flood her insides completely, and realize that you seem to be cumming more than usual, as your cum spurts out of her pussy.",
                        "ChangeImageLayer", "Expression", "1", "Spent",
                        "A moment later your intense orgasm finally winds down, leaving your muscles feeling like jelly. Spent and exhausted you collapse into her comfortably soft body, gasping for air. Also panting, Felicia paws at your back possessively, purring happily and obviously tired out by the sudden and wild intercourse.",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "Loving",
                        "Speaks", "That was... haa...♥ really good, love.♥",
                        "You nod weakly, more of a nuzzle as your face is resting on top of her soft bosom, and she gently pats the back of your head with a giggle.",
                        "Speaks", "Don't forget to breathe now, fufufu...♥",
                        "Felicia unwraps her limbs from around you, and with a groan you manage to push yourself off the cat lady. Sitting up over her thighs you look down on her, noting your cum leaking from her and admiring her well-fucked, sensual body still flushed from the afterglow, almost getting hard again on the spot.",
                        "ChangeImageLayer", "Expression", "1", "SmugTongue",
                        "Speaks", "Mmh, hurry up and get off, or we'll end up fucking all day...♥ And I don't have so much free time today, sadly.",
                        "ChangeImageLayer", "BikiniLayer", "1", "Bikini",
                        "You nod and get off the couch, re-adjusting your speedo and making yourself more presentable. Felicia carefully slips her swimsuit over her tits again, and you have to wonder how does it even stay on.",
                        "Speaks", "Oh, before we forget about it - you can tell Tina that I'll start coming to the resort starting next week.",
                        "ChangeImageLayer", "Base", "1", "BaseCute",
                        "ChangeImageLayer", "Expression", "1", "Smug",
                        "Speaks", "Of course, I am not telling you, or her, why.",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "Predatory",
                        "Speaks", "But rest assured, you {i}will{/i} be seeing me more often.",
                        "SetChoice", "1", "HadSex",
                        "JumpToScene", "WrapUpFirstMeeting"
                      ]
                    },
                    {
                      "NameOfScene": "Stammer...",
                      "theScene": ["You fumble over your response, taken aback by the direct suggestion and feeling rather embarrassed about your awkward erection.",
                      "ChangeImageLayer", "Base", "1", "BaseFlush",
                      "ChangeImageLayer", "Expression", "1", "PredatoryLewd",
                      "...",
                      "ChangeImageLayer", "Expression", "1", "Seductive",
                      "Speaks", "Well now, I didn't hear a 'no', so...",
                      "In a split second Felicia leaps up from her couch, nearly crashing into you before pushing you down on the sand. Surprisingly gently, but insistently and with no room for resistance.",
                      "ChangeImageLayer", "Base", "1", "BaseBlush",
                      "ChangeImageLayer", "Expression", "1", "PredatoryLewd",
                      "Resting her weighty ass on your midsection, she looks down on you with a grin and pins your arms down with her paws. Leaning in, she plants a hot, slow kiss on your lips.",
                      "ChangeImageLayer", "Expression", "1", "KissDommy",
                      "You timidly return the kiss, overwhelmed by the surprisingly powerful woman, and her substantial weight. You suspect it may be best not to tell her how heavy she is.",
                      "Despite the discomfort, you find yourself getting intensely aroused, your already hard dick twitching with desire for the plump feline woman on top of you.",
                      "ChangeImageLayer", "Expression", "1", "PlayfulLewd",
                      "Felicia breaks the kiss, before shifting her body lower, her large ass colliding with your erection, and plants a kiss on your pecs, looking up at you with a playful expression.",
                      "Her paw suddenly flicks over one of your nipples, the smooth, soft pad of her finger providing an unusually pleasant sensation. Her mouth attacks your other nipple, eliciting a yelp, and a pleasured moan from your lips.",
                      "Speaks", "Mmm, that's right, moan for me, boy.♥",
                      "Her butt wiggles against your hard dick for a moment, trapping the stiff thing between her plump ass cheeks. Redoubling her offensive on your nipples, she looks up at you intently, obviously enjoying your rather vocal reactions to her three-way assault.",
                      "ChangeImageLayer", "Expression", "1", "PredatoryLewd",
                      "Alternating between playing with your nipples and lewdly smooching your pecs, collarbones and neck, she keeps rubbing her soft buttcheeks on your stiff erection, making you shiver with need and delight from her dotingly aggressive affections.",
                      "While both of you aren't even out of your swimsuits yet, you still find yourself on the edge of a powerful orgasm. Your dick is copiously leaking precum all over your speedo, twitching strongly from the pleasure, begging for release from the tight clothing.",
                      "ChangeImageLayer", "Expression", "1", "KissDommy",
                      "Sensing your enclosing orgasm she grins and softly bites on your nipple, all the while aggressively flicking the other. Quickly bouncing her bubble butt over your rock-hard erection, she clearly intends to make you cum just like this.",
                      "Unable to hold back or get away from her lewd ministrations, you moan as your dick erupts, helplessly flooding your speedo and her bum valley with a thick load of spunk.",
                      "ChangeImageLayer", "Expression", "1", "Loving",
                      "As if rewarding you for the premature release, her touch becomes very gentle and affectionate. She lovingly kisses your chest, softly nuzzling her ass to your still hard dick.",
                      "Speaks", "Fufu, finishing before the main course? You shameful boy.♥ I love shameful boys.♥",
                      "ChangeImageLayer", "Expression", "1", "PlayfulLewd",
                      "Pushing back she raises her body, moving her butt across your crotch to sit down on your legs. Looking down she playfully tugs at your swimsuit, bouncing your dick around inside it, quickly making you hard again.",
                      "Finally she tugs down at the speedo, letting your cum-smeared erection pop free from the soiled swimsuit and press against her soft tummy, eager for more.",
                      "ChangeImageLayer", "BikiniLayer", "1", "Naked",
                      "Shifting aside her own swimsuit she reveals her glistening pussy, and wastes no time hopping forward, lewdly squatting right above your dick, her drooling pussy a hair's breadth away.",
                      "Speaks", "Hey, look closely.♥ My pussy is about to devour your dick.♥ Do your best not to cum from the insertion, or I will be fucking you silly.♥",
                      "She brings her hips down abruptly, her wet pussy warm and welcoming, hilting your entire length in vice-like tightness in one smooth motion.",
                      "You grit your teeth, almost overwhelmed on the spot by the unusually intense pleasure of insertion, needing time to adjust to her high-class pussy clamping down on your length.",
                      "Felicia gives you no such time, already rocking her wide hips up and down, smacking her heavy butt against your legs faster and faster. You moan incoherently, overwhelmed by the sensation and causing Felicia to laugh in delight when she looks down at your face.",
                      "ChangeImageLayer", "Expression", "1", "PredatoryLewd",
                      "She rides your dick with wild abandon, her crotch mashing wetly against yours, her bountiful tits bouncing heavily on her chest, all making loud slapping sounds. Her cat tail thrashes wildly behind her, tickling your legs softly, but you are too focused on your dick and the intense fucking it receives.",
                      "ChangeImageLayer", "Expression", "1", "BigCums",
                      "You feel your orgasm approaching quickly but Felicia cums first, mewling and howling like an animal, her pussy squeezing chaotically around your intruding member. Your dick begins unloading in response, filling her insides with warm spunk. At the height of her orgasm, she collapses heavily on top of you, panting and purring contentedly, her pussy still milking out your seed.",
                      "You keep cumming and cumming, quickly filling her to the brim and a mix of your juices escapes her slick hole despite how tightly it is wrapped around you. Felicia mewls softly in response, rolling over to the side next to you, panting happily as your cum drools out on the sand from her well-fucked pussy.",
                      "ChangeImageLayer", "Base", "1", "BaseFlush",
                      "ChangeImageLayer", "Expression", "1", "Spent",
                      "Speaks", "Haa...♥ Good job, boy.♥ That was a great fling.",
                      "A moment passes in silence, both of you panting and trying to catch your breath, before she suddenly emits a soft 'oh' and speaks up again.",
                      "ChangeImageLayer", "Base", "1", "Base",
                      "ChangeImageLayer", "Expression", "1", "Flash",
                      "Speaks", "Oh, I almost forgot...",
                      "ChangeImageLayer", "Expression", "1", "Base",
                      "ChangeImageLayer", "BikiniLayer", "1", "Bikini",
                      "She sits up on her ass, re-adjusting her bikini and dusting herself off from the sand.",
                      "Speaks", "You can tell Tina that I'll start coming to the resort starting next week.",
                      "ChangeImageLayer", "Expression", "1", "Smug",
                      "Speaks", "Of course, I am not telling you, or her, why.",
                      "ChangeImageLayer", "Expression", "1", "Predatory",
                      "Speaks", "But rest assured, you {i}will{/i} be seeing me more often.",
                      "SetChoice", "1", "GotDommed",
                      "JumpToScene", "WrapUpFirstMeeting"
                      ]
                    },
                    {
                      "NameOfScene": "Turn her down.",
                      "theScene": ["You decline the salacious offer, saying that's not what you came here for.",
                      "ChangeImageLayer", "Base", "1", "Base",
                      "ChangeImageLayer", "Expression", "1", "Laugh",
                      "Speaks", "Hahaha, really now, Hero? Your self-control is commendable.",
                      "ChangeImageLayer", "Base", "1", "BaseFlush",
                      "ChangeImageLayer", "Expression", "1", "SmugTongue",
                      "Speaks", "Have fun rubbing one out later.",
                      "ChangeImageLayer", "Base", "1", "Base",
                      "ChangeImageLayer", "Expression", "1", "Smile",
                      "Speaks", "I suppose I should address Tina's concerns then - you can tell her not to worry. I will be visiting more often, starting next week.",
                      "ChangeImageLayer", "Expression", "1", "Smug",
                      "Speaks", "Of course, I am not telling you, or her, why.",
                      "ChangeImageLayer", "Expression", "1", "Predatory",
                      "Speaks", "But rest assured, you {i}will{/i} be seeing me more often.",
                      "JumpToScene",
                      "WrapUpFirstMeeting"
                      ]
                    },
                    {
                      "NameOfScene": "Sit down.",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "Seductive",
                        "With a shrug, you sit down on the couch cross-legged, across from the feline milf. She flashes you a smile, brushing her fluffy tail against your stomach, once, before putting it out of the way.",
                        "You begin to explain why Tina sent you to meet Felicia. As you're talking, Felicia takes one of your hands into her own paws, while gesturing you to continue speaking. Her fur is very soft, if a little ticklish. Your hand feels small in the grasp of her big, fluffy paws.",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "Smile",
                        "As you keep relaying Tina's concerns to the best of your ability, Felicia takes your other hand and brings both of them to her expansive bosom, giving you the most innocent smile she can muster. Your hands slowly sink into the soft flesh, completely halting your monologue as Felicia grins and waits for your reaction.",
                        "Menu",
                          "Play with her boobs as you talk.",
                          "Pull your hands away and keep talking.",
                        "EndMenu"
                      ]
                    },
                    {
                      "NameOfScene": "Play with her boobs as you talk.",
                      "theScene": ["ChangeImageLayer", "Expression", "1", "Pleasured",
                        "You give her boobs a firm squeeze, enjoying their amazing softness, and resume talking, your hands still glued to her wonderfully soft tits. Bouncing them in your hands, you marvel at their weight and softness. Eager for more, you grasp her tits firmly, kneading and squeezing the motherly bosom with no restraint.",
                        "ChangeImageLayer", "Base", "1", "BaseBlush",
                        "ChangeImageLayer", "BikiniLayer", "1", "Naked",
                        "Felicia is obviously enjoying your touch, cooing and moaning softly as you play around with her boobs. Your dick strains against its swimsuit prison, eager to bounce free, just as her breasts just bounced free of her slingshot swimsuit.",
                        "ChangeImageLayer", "Expression", "1", "BiteLip",
                        "Her nipples are large and puffy, catching your attention as soon as they came into view. You squeeze them softly, briefly wondering if any milk will come out, but only manage to draw out a pleasured whine from Felicia.",
                        "You realize you stopped talking for a moment and hurry to briefly wrap up your explanation, eager to focus completely on her amazing tits. Felicia is audibly enjoying your touch. So much in fact, that you find yourself worrying if she even listened to you talk at all. You give her boob a firm poke and stop groping her, waiting for a response.",
                        "ChangeImageLayer", "Expression", "1", "Pleasured",
                        "Speaks", "Haa...♥ Is that all...♥ she wanted? Silly girl.",
                        "ChangeImageLayer", "Expression", "1", "Seductive",
                        "Speaks", "But nevermind that for now... Isn't there something else you want to {i}do{/i}?",
                        "She points to your erection then repeatedly thrusts her finger between her tits with a naughty smile.",
                        "You find herself in agreement with her suggestion, pushing her down on her back, still gripping her enormous bosom with both hands. Felicia giggles excitedly, pulling you on top of her, the bulge in your swimwear pressed snugly against her tits as she rests her paws on your thighs.",
                        "JumpToScene",
                        "Titfuck"
                      ]
                    },
                    {
                      "NameOfScene": "Titfuck",
                      "theScene": [
                          "ChangeImageLayer", "Expression", "1", "BiteLip",
                          "Speaks", "Come on, hurry.♥",
                          "ChangeImageLayer", "Expression", "1", "Pleasured",
                          "She uses her paws to press her heavy tits together, watching closely as you pull off your speedo and finally thrust your rock-hard cock between her yieldingly soft tits. Felicia purrs in delight, blushing harder as she shoots you a smoldering gaze full of barely contained lust.",
                          "There is enough of her massive bosom to accomodate two pairs of hands, and yours naturally move to grasp her soft milk-tanks again. Felicia coos in pleasure, also groping and massaging herself, seemingly having as much fun with the act as you do.",
                          "ChangeImageLayer", "Expression", "1", "NeedyHorny",
                          "Her breasts appear to be very sensitive, and the two-way groping is obviously making her very horny as she mewls in delight. Your cock, squeezed really tightly in her heavenly bosom, still demands more stimulation and you thrust forward roughly, your crotch colliding loudly with the soft underside of her heavy cleavage.",
                          "That single thrust sets the pace, and the very next moment you're pounding her tits with wild abandon, as hard and as fast as you can, rocking the entire couch back and forth, almost worried that you might knock it over.",
                          "ChangeImageLayer", "Expression", "1", "PleasuredHard",
                          "Felicia is obviously enjoying the rough treatment, bouncing and mashing her tits into your crotch in tandem with your thrusts and moaning loudly and unabashedly. The slightly damp valley between her tits feels amazing, its heavy walls pressing down on your erection oppressively. Precum leaking into the hot cleavage copiously, your wild thrusts fill the air with a steamy musky smell and loud squelching noises alike.",
                          "ChangeImageLayer", "Expression", "1", "BiteLip",
                          "Your catwoman sexfriend's arms become wobbly, their movements less certain as the wild titfuck picks up pace even more. She mewls weakly and gives up on holding her tits together, simply kicking back to enjoy the tit-ramming of her life. Your hands struggle to grasp all of her wobbling titflesh and you settle for keeping them squeezed tightly around your cock.",
                          "Just as Felicia is on the verge of a wild orgasm from the rough titfucking, your dick is throbbing wildly and preparing to unload a steamy hot load into her amazing cleavage. You groan and thrust even faster, cock throbbing, completely set on flooding her massive tits with cum.",
                          "ChangeImageLayer", "Expression", "1", "NeedyHorny",
                          "Do it, hurry, creampie them!♥ Do it do it!♥ Gonna cum! Gonna cum, gonnacumgonnacumgonnacum!! Aaaah~~♥!!",
                          "ChangeImageLayer", "Expression", "1", "BigCums",
                          "You moan from mind-numbing pleasure as your dick explodes into her stuffy cleavage and Felicia howls simultaneously, thrashing wildly underneath you, riding out a wild orgasm of her own. Your dick is pulsating powerfully, repeatedly ejecting thick globs of cum into the tight confinements of her massive boobs, not intending to stop until the tight valley overflows.",
                          "Most of your cum never actually leaves her massive mammaries, but last, single spurt of very thick cum finally shoots out from between her tits and falls over her face, making her blush even harder. Purring loudly she scoops it up with her finger before licking it off with her strikingly pink tongue, savoring the taste. Gulping down the thick wad of sticky cum, she wiggles her ears and exhales contentedly.",
                          "ChangeImageLayer", "Expression", "1", "Spent",
                          "Speaks", "Haa...♥ Haa...♥ That was... amazing.♥",
                          "ChangeImageLayer", "Expression", "1", "BiteLip",
                          "The wild titfuck left you completely spent after a single ejaculation, and you pull out your soft dick, leaving a trail of cum over her stomach. You move to get off the cat woman but she pats down on your legs insistently, forcing you to sit down on her soft thighs.",
                          "ChangeImageLayer", "Expression", "1", "Seductive",
                          "Speaks", "For afterglow...♥ I need my man on top of me...♥",
                          "As a streak of cum from her cleavage reaches her crotch, Felicia switches her attention down to her tits, as they rest heavily over her chest, slightly apart and thoroughly creampied.",
                          "ChangeImageLayer", "Base", "1", "BaseFlush",
                          "ChangeImageLayer", "Expression", "1", "NeedyHorny",
                          "Speaks", "Wow, what a fucking mess.♥ You wanted to knock them up or something?.♥",
                          "Exhausted and squeezed completely dry by her motherly bosom, you simply nod absent-mindedly in agreement, causing the older woman to giggle amusedly. The two of you relax for a moment in silence until Felicia speaks up abruptly.",
                          "ChangeImageLayer", "Base", "1", "Base",
                          "ChangeImageLayer", "Expression", "1", "Flash",
                          "Speaks", "I forgot!",
                          "She sits up suddenly, her tits smacking into you and almost pushing you off her lap, but she manages to catch you before that happens.",
                          "ChangeImageLayer", "Expression", "1", "Laugh",
                          "Speaks", "Oh, sorry there, haha. I forgot I was supposed to meet with someone later today.",
                          "You nod and disentangle yourself from the cat woman, standing up to let her leave.",
                          "ChangeImageLayer", "Expression", "1", "Thinking",
                          "She looks down to her cum-smeared front quizzically, as if contemplating something.",
                          "ChangeImageLayer", "Expression", "1", "Pout",
                          "Speaks", "I shouldn't eat all this...",
                          "ChangeImageLayer", "Expression", "1", "Apologetic",
                          "She grabs her beach towel and wipes off all the sticky splooge, looking at you apologetically.",
                          "Speaks", "Sorry, I am on a diet...",
                          "ChangeImageLayer", "BikiniLayer", "1", "Bikini",
                          "She takes a moment to pull her flimsy bikini back on, and looks up to you again.",
                          "ChangeImageLayer", "Expression", "1", "Smile",
                          "Speaks", "Oh, and before I forget. You can tell Tina that I'll start coming to the resort starting next week.",
                          "ChangeImageLayer", "Expression", "1", "Smug",
                          "Speaks", "Of course, I am not telling you, or her, why.",
                          "ChangeImageLayer", "Expression", "1", "Predatory",
                          "Speaks", "But rest assured, you {i}will{/i} be seeing me more often.",
                          "SetChoice", "1", "HadSex",
                          "JumpToScene", "WrapUpFirstMeeting"

                      ]
                    },
                    {
                      "NameOfScene": "Pull your hands away and keep talking.",
                      "theScene": [
                        "You pull away your hands, intent on finishing your quest without having to use your recall stone. Surprisingly enough Felicia lets it go, letting you keep talking with a small shrug and a pout.",
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "1", "Bored",
                        "You finish relaying Tina's concerns as Felicia listens quietly, occasionally pawing at your body, seemingly to ward off boredom. Once you finish talking, she looks up to you and shrugs.",
                        "Speaks", "Well, if that is all... You can tell her not to worry. I will be visiting more often, starting next week.",
                        "ChangeImageLayer", "Expression", "1", "Smug",
                        "Speaks", "Of course, I am not telling you, or her, why.",
                        "ChangeImageLayer", "Expression", "1", "Predatory",
                        "Speaks", "But rest assured, you {i}will{/i} be seeing me more often.",
                        "ChangeImageLayer", "Expression", "1", "Bored",
                        "She shoos you off her couch and yawns, stretching her legs for a moment before sitting up.",
                        "JumpToScene",
                        "WrapUpFirstMeeting"
                      ]
                    },
                    {
                      "NameOfScene": "Try to sneak up. (Technique)",
                      "theScene": ["You slowly approach the umbrella, managing to stay out of view and steal a glance on the person beneath.",
                        "As expected, you see a mature-looking catgirl, (or should you say, a catwoman?) resting on a comfy-looking beach couch. You are not surprised Tina likes her bikini... Resolving to keep sneaking, you move in closer.",
                        "StatCheck", "Technique", "25",
                          "SneakSuccess",
                        "Fail",
                          "SneakFail"
                      ]
                    },
                    {
                      "NameOfScene": "SneakSuccess",
                      "theScene": [
                        "You manage to make it to the boulder without being spotted. Carefully peeking from behind the boulder gives you a full view on the cat woman from the side.",
                        "DisplayCharacters", "1", "End",
                        "She is definitely an older woman, with a pleasantly blush build and an air of relaxed confidence around her. Trying to scour for a weakness you conclude that she is unlikely to be very fast in combat, but the cat-like grace of her movements as she adjusts her sunglasses makes you doubt that assessment.",
                        "ChangeArousalByPercent", "10",
                        "Her full breasts rest heavily against her chest, barely constrained by the bikini, a slight sag in their womanly shape. Her long legs look both strong and plump, their shapely fullness nicely complementing her big ass. She is also intensely seductive and fashionable, with the abundance of flashy accessories and almost garish makeup.",
                        "ChangeArousalByPercent", "15",
                        "DisplayCharacters", "End",
                        "Realizing that you're shamelessly ogling her, you hide behind the boulder again. You are also not certain what you have accomplished. She appears rather formidable in many regards, betraying no weakness, and now you have a throbbing erection to boot.",
                        "DisplayCharacters", "1", "End",
                        "You can't help yourself and peek again, your eyes drawn to her sensually mature body and its pleasantly round shapes. She probably wouldn't notice if you rubbed one out quietly...",
                        "Menu",
                          "That's not why you came here. Time to act!",
                          "Just once...",
                        "EndMenu"
                      ]
                    },
                    {
                      "NameOfScene": "That's not why you came here. Time to act!",
                      "theScene": [
                        "Given that your goal here is to have a conversation, you see little reason to sneak around any longer. To avoid startling and possibly agitating the feline lady, you creep backwards and take a short detour around the boulders, ensuring that your approach is visible from afar.",
                        "DisplayCharacters", "1", "End",
                        "ChangeImageLayer", "Expression", "1", "Confus",
                        "This time she notices your approach, cocking her head to the side.",
                        "Her strikingly cat-like eyes regard you carefully over her sunglasses as you approach, but she makes no attempts to attack you or even get up.",
                        "Speaks2", "Can I help you, young man? This isn't part of the resort, you know. Are you lost?",
                        "You shake your head, introduce yourself and explain that you were looking for her at Tina's request.",
                        "Speaks2", "Tina? Hmm...",
                        "ChangeImageLayer", "Expression", "1", "Smug",
                        "Speaks2", "I see, I see, Tina... Well, let's hear what she wants from me. Name's Felicia by the way. And...",
                        "ChangeImageLayer", "Expression", "1", "InvitingSmile",
                        "Speaks", "Why don't you sit down first? It feels unpleasant to talk to someone just looming awkwardly over me.",
                        "She shifts and curls up her legs, squishing her expansive bosom with her knees and freeing up some space on the couch for you to sit down.",
                        "Menu",
                          "'I'll stand.'",
                          "Sit down.",
                        "EndMenu"
                      ]
                    },
                    {
                      "NameOfScene": "Just once...",
                      "theScene": [
                        "You can't deny your growing desire, and the prospect of secretly masturbating to a potentially dangerous monster woman sounds oddly enticing. Perhaps because you normally have sex with them upfront, a secretive embarrassing act such as this feels more exciting than usual.",
                        "With your cock throbbing with a powerful need, you free it of the tight swimwear and begin to stroke it slowly, stealing a careful peek at the cat woman.",
                        "ChangeImageLayer", "Expression", "1", "Bored",
                        "She appears none the wiser to your presence, the fact exciting you further, and making you stroke faster. You can't stroke {i}too{/i} fast, out of fear of the act being too loud, and the agonizing, self-imposed slowness makes your masturbation session that much more desperate.",
                        "Your eyes wander over her motherly curves, greedily taking in their plump fullness. Her rich, fertile-looking body fills you with a base desire, flooding your mind with all sorts of debauched fantasies, making you masturbate as furiously as possible.",
                        "Powerfully jacking your dick in silent desperation, you keep ogling the cat woman's huge tits, deliciously plump thighs and stomach, physically unable to tear away your gaze from her filled-out curves. The catwoman adjusts the strap of her bikini, her heavy breast bouncing wonderfully from the movement and your dick throbs in delight, consumed by wild desire for this cat woman.",
                        "Your cock starts drooling precum in excitement, adding wet squelching noises to your movement and suddenly making your clandestine masturbation much louder. Your heart skips a beat and you halt your stroking movements, dreading that the cat might've noticed the lewd sounds, but are relieved to find that doesnt seem to be the case.",
                        "ChangeImageLayer", "Expression", "1", "Sleeping",
                        "She actually appears to be falling asleep, and you breathe out in relief, slowly resuming your stealthy cock-stroking. This time your eyes are drawn to her plump, juicy lips and your imagination soars, filled with amazing imagery of those sensual, plump love-pillows wrapped around your dick, her mature face flushed with unsightly lust as she services you submissively.",
                        "A powerful climax approaching rapidly, you grit your teeth and point your dick at a the rock, finally erupting as quietly as you can, not a single moan escaping your lips as your cock blasts the boulder with your seed. Even as you're cumming, you can't look away from her pouty lips, the intense blowjob fantasy never leaving your mind even as your cock finishes spurting, deflating and becoming soft in your grip.",
                        "You gulp nervously, throat parched and knees shaky from the intense fapping session, and lean back, concealing yourself again to catch your breath.",
                        "...",
                        "Cleaning up and carefully hiding your semi-hard prick back into speedo, you do your best to make yourself presentable and move away from the cum-stained boulder, intent on openly approaching the cat woman, now that you have a clear mind, if not a clear conscience.",
                        "JumpToScene", "That's not why you came here. Time to act!"
                      ]
                    },
                    {
                      "NameOfScene": "SneakFail",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "Flash",
                        "Creeping behind a boulder you almost twist your ankle on the treacherous sands and step on a seashell, crushing it with an audible crunch. Catwoman's ear twitches from the sound and she turns in your direction, spotting you instantly!",
                        "ChangeImageLayer", "Expression", "1", "Amused",
                        "Speaks2", "...Why are you skulking around, young man? Come on over here, I won't bite.",
                        "Resigning to your fate, you shuffle from behind the boulder awkwardly, regarding the feline woman warily.",
        								"ChangeImageLayer", "Expression", "1", "Bored",
                        "Speaks2", "This isn't part of the resort, you know. Are you lost?",
                        "You shake your head, introduce yourself and explain that you were looking for her at Tina's request.",
      									"Speaks2", "Tina? Hmm...",
        								"ChangeImageLayer", "Expression", "1", "Smug",
                        "Speaks2", "I see, I see, Tina... Well, let's hear what she wants from me. Name's Felicia by the way. And...",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
        								"ChangeImageLayer", "Expression", "1", "InvitingSmile",
                        "Speaks", "Why don't you sit down first? It feels unpleasant to talk to someone just looming awkwardly over me.",
                        "She shifts and curls up her legs, squishing her expansive bosom with her knees and freeing up some space on the couch for you to sit down.",
                        "Menu",
                          "'I'll stand.'",
                          "Sit down.",
                        "EndMenu"
                      ]
                    },
                    {
                      "NameOfScene": "WrapUpFirstMeeting",
                      "theScene": [
                        "ChangeImageLayer", "Base", "1", "Base",
                        "ChangeImageLayer", "Expression", "Smile",
                        "Felicia gets up and casually folds her umbrella and the couch, before nonchalantly putting them over her shoulder.",
                        "While the items are not particularly heavy, the display is still impressive as her plush build didn't really hint at a great, hidden strength. You find yourself taking a step back, a bit awestruck.",
                        "Speaks", "Sorry to cut our conversation short, but I really need to meet with someone in a couple of hours.",
                        "ChangeImageLayer", "Base", "1", "BaseFlush",
                        "ChangeImageLayer", "Expression", "1", "InvitingSmile",
                        "She playfully pokes you in the chest with her fluffy finger and smiles softly.",
                        "Speaks", "Hope to see you again, boy.",
                        "With that she walks away from the shore, a playful spring in her step, fluffy tail swishing from side to side. You blink and can only wonder how she is walking so effortlessly through all the sharp rocks, with a weight over her shoulder no less.",
                        "DisplayCharacters", "2", "End",
                        "Accomplishing what you set out to do, you begin walking back to the resort area, quietly hoping you never have to traverse these rocky sands ever again.",
                        "SwapLineIf", "Choice",
                          "1", "NoSex", "Thinking of it, this went smoother than expected. Felicia was reasonably polite, if overly salacious, and never tried to attack you. Perhaps Tina's impression of her is wrong?",
                          "1", "HadSex", "Thinking of it, this went smoother than expected. Felicia did flirt rather aggressively, and you ended up fucking, but she was rather friendly about it. Perhaps Tina's impression of her is wrong?",
                          "1", "GotDommed", "Thinking back on what happened, you wonder what would happen if Felicia kept going... You may need to be wary of her in the future, or your trips to the resort may end abruptly. Perhaps Tina's impression of her is not all wrong...",
                        "endSwap",
                        "DisplayCharacters", "3", "End",
                        "ChangeImageLayer", "Expression", "1", "Awkward",
                        "With these thoughts on your mind, the trip back feels fairly short, and soon you spot Tina fidgeting awkwardly on the edge of resort, waiting for you.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Her face lights up as she sees you, and she jumps happily in place before waving energetically at you.",
                        "Speaks3", "You're back! You're back, and not tomorrow and not from a different direction, so she didn't fuck you silly!",
                        "ChangeImageLayer", "Expression", "1", "Base",
                        "Speaks3", "Hurry, tell me, how did it go?",
                        "You explain that Felicia will start visiting the resort at a later date, and that she refused to explain her behavior.",
                        "ChangeImageLayer", "Expression", "1", "Focused",
                        "Speaks3", "Why is she like that...",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Speaks3", "Ah well, I'll get a headache if I worry too much about it, or if ask her about it, so it is probably better I just forget about the matter!",
                        "ChangeImageLayer", "Expression", "1", "Base",
                        "Speaks3", "Okay, here is your reward, a thousand eros as promised!",
                        "ChangeEros", "1000",
                        "SetChoice", "1", "QuestCleared",
                        "You accept the money and wonder if she's going to say anything else, but she just looks back at you quietly, looking slightly confused by your silence. Did she forget about the other part of the reward she mentioned in the quest posting?",
                        "Menu",
                          "Ask for the kiss.",
                          "Let it go.",
                        "EndMenu"
                      ]
                    },
                    {
                      "NameOfScene": "Ask for the kiss.",
                      "theScene": [
                        "ChangeImageLayer", "Expression", "1", "Flash",
                        "Speaks3", "Oh! I completely forgot!",
                        "ChangeImageLayer", "Expression", "1", "Grin",
                        "Speaks3", "Of course, I did promise after all!",
                        "ChangeImageLayer", "Base", "1", "Flush",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "Tina takes a step closer before gently wrapping her arms around you, wiggling her hips happily. You hug her back, wrapping your arms around her waist and bringing her closer.",
                        "ChangeImageLayer", "Expression", "1", "Kiss",
                        "Tilting your head up to kiss the taller succubus, you feel her lips touch yours softly. She tastes {i}really{/i} good, and you wonder if she merely pretended to forget about the kiss reward and was actually well-prepared.",
                        "Her longer tongue slips into your mouth, gently probing at first, but soon intertwining passionately with your own. She moans quietly and presses herself closer to you, kissing you deeper and more desperately.",
                        "ChangeImageLayer", "Base", "1", "Blush",
                        "ChangeImageLayer", "Expression", "1", "Horny",
                        "She whines softly as you hug her closer and momentarily breaks the kiss, gasping for air. Her arms fidget around your back, as if wanting to squeeze you as tight as possible, but not daring to. Blushing harder she dives into the kiss again, almost bumping your foreheads in her cute eagerness.",
                        "ChangeImageLayer", "Expression", "1", "Kiss",
                        "Despite your dancing tongues and Tina's inherently erotic nature, this kiss doesn't feel very sexual. More like something coming from a gentle and awkwardly sincere gratitude and affection.",
                        "Coming from a succubus, you wonder if this may be something special.",
                        "ChangeImageLayer", "Expression", "1", "Shy",
                        "Suddenly breaking the embrace Tina steps back, giving you a shy smile. 'Thank you', she whispers, before blushing even more fiercely and bolting away.",
                        "You feel a little stunned for a moment, and after gathering your thoughts decide to return back to town for the day, a job well-done and well-paid.",
                        "questComplete",
                        "GoToTown"
                      ]
                    },
                    {
                      "NameOfScene": "Let it go.",
                      "theScene": [
                        "You decide not to press the issue and bid farewell to Tina with a nod.",
                        "ChangeImageLayer", "Expression", "1", "Happy",
                        "She waves you off with a smile, but you feel like she may looked a little disappointed. Did she want to kiss you but was too shy to offer?",
                        "DisplayCharacters", "End",
                        "With a shrug you return back to town for the day, a job well-done.",
                        "questComplete",
                        "GoToTown"
                      ]
                    }
                ]
}
