{
    "name": "CongregationGangbang",
    "CardType": "",
    "CardLimit": "0",
    "Description": "",
    "requires": [ ""],
    "Speakers": [
                  {
                    "name": "Nereid",
                    "postName": " 1",
                    "SpeakerType": ""
                  },
                  {
                    "name": "Nereid",
                    "postName": " 2",
                    "SpeakerType": ""
                  },
                  {
                    "name": "Nereid",
                    "postName": " 3",
                    "SpeakerType": ""
                  },
                  {
                    "name": "Nereid",
                    "postName": " 4",
                    "SpeakerType": ""
                  },
                  {
                    "name": "Nereid",
                    "postName": " 5",
                    "SpeakerType": ""
                  },
                  {
                    "name": "Cetuspeanna",
                    "postName": "",
                    "SpeakerType": ""
                  }
                ],
    "EventText": [
                 {
      					  "NameOfScene": "CongregationReverseGangbang",
      					  "theScene": [
                                "DisplayCharacters", "6", "EndLoop",
                    						"ChangeImageLayer", "Base", "1", "Base",
                    						"ChangeImageLayer", "BodyPart", "1", "ArmsRest",
                    						"ChangeImageLayer", "Magic", "1", "MagicNone",
                    						"ChangeImageLayer", "Expression", "1", "Haughty",
                    						"Overwhelmed by the dragoness' techniques you fall on your ass, dick still spurting weakly. Your strength fails you, and you can move no more as Cetuspeanna looms over you triumphantly.",
                    						"ChangeImageLayer", "BodyPart", "ArmsSpread",
                    						"ChangeImageLayer", "Expression", "Solemn",
                    						"Speaks6", "Come, gather round, my congregation!",
                                "RemovePerkQuietly", "Ethereal Hands",
                    						"DisplayCharacters", "2","3","4","5","6", "1", "EndLoop",
                    						"ChangeImageLayer", "Expression", "6", "Haughty",

                								"ChangeImageLayer", "Base", "1", "Base",
                								"ChangeImageLayer", "Base", "2", "Blush",
                								"ChangeImageLayer", "Base", "3", "Disdain",
                								"ChangeImageLayer", "Base", "4", "Blush",
                								"ChangeImageLayer", "Base", "5", "Base",

                    						"ChangeImageLayer", "Expression", "1", "Calm",
                    						"ChangeImageLayer", "Expression", "2", "Calm Blush",
                    						"ChangeImageLayer", "Expression", "3", "Disdain",
                    						"ChangeImageLayer", "Expression", "4", "Calm",
                    						"ChangeImageLayer", "Expression", "5", "Calm",

                                "A large gathering of Nereids rise from the waters. Quickly surrounding your prone form they turn to their goddess, awaiting her command as Cetuspeanna watches over you in amusement.",
                      					"ChangeImageLayer", "Base", "6", "BaseFlush",
                                "Speaks6", "This man challenged me in his insolence, and failed miserably. He is yours. Punish him as you see fit.",
                                "The Nereids start panting in excitement, turning their attention to you. You gulp down nervously, trying to steel yourself for what is to come.",
                                "Wasting no time, one of the Nereids impales herself on your treacherously hard erection, hilting the entire thing in the smooth, vice-like tightness of her pussy.",
                                "Your pleasured gasp is muffled as you are greeted with a faceful of fish pussy when one of the Nereids sits on your face.",
                                "Speaks2", "Lick.",
                                "You can only obey submissively, eating out the slightly salty fish pussy, as the Nereid coos and caresses your head.",
                                "Your vision obscured, you feel one of the other Nereids attack your nipples with her webbed hands. You shiver from the sensation, almost producing a shameful gasp which is thankfully muffled as the face-sitting Nereid presses her crotch harder in your face.",
                                "Your mind's attention quickly switches towards your crotch, as the Nereid occupying that spot starts rapidly bouncing up and down on your cock. Her moist pussy effortlessly sliding over your over-sensitized hard cock feels heavenly, if quite overwhelming, and you moan weakly, already on the edge of spurting inside her.",
                                "ChangeImageLayer", "Expression", "1", "Disdain",
                                "Speaks", "Already gonna cum? How pathetic. Did you really hope to defeat our wonderful Goddess with that pathetic leaky dick?",
                                "You muster your strength to grip the smug Nereid's hips and try to fight back, but your arms are quickly pinned to the ground by a couple of Nereids sitting on them, rubbing their wet slits over your forearms.",
                                "Trapped and restrained in a pile of fish girls you can only groan as your dick helplessly explodes inside the mercilessly squeezing orifice, filling her womb to the brim with seed.",
                                "Speaks4", "Hey you got your creampie, let's switch.",
                    						"ChangeImageLayer", "Expression", "1", "Hurt",
                                "Speaks", "But I didn't get to cum yet...",
                    						"ChangeImageLayer", "Expression", "4", "Hurt",
                                "Speaks4", "Are you kidding? There's no way he'd make any of us come the way he is right now. Let's just ride him dry.",
                    						"ChangeImageLayer", "Expression", "1", "Calm",
                    						"ChangeImageLayer", "Expression", "4", "Calm",
                                "You feel the Nereid lift herself off your cock, not a single drop of your splooge escaping her tight canal. In the very next moment your dick is swallowed up by another Nereid's pussy, her hips meeting yours with a loud, wet smack. This one squeezes you even tighter, drawing out a huge droplet of precum with the insertion alone.",
                    						"ChangeImageLayer", "Expression", "2", "Disdain",
                                "Speaks2", "Hey, don't get distracted. Lick harder.",
                                "Your face is smothered by Nereid pussy again, forcing you to lick desperately as you realize you cannot breathe. Digging into her delightfully tasting honeypot, you are almost distracted from the sensation of your dick and nipples getting mercilessly attacked by the other Nereids.",
                    						"ChangeImageLayer", "Base", "2", "Manic",
                    						"ChangeImageLayer", "Expression", "2", "Manic",
                                "The Nereid emits a high-pitched laugh in response, sounding almost hysterical. Raising your eyes to look at her, you realize that her switch has been flipped, as she watches down on you with a completely unhinged expression on her face.",
                                "Speaks3", "Uh oh, look at her, getting all horny. Guess he's good at eating pussy.",
                                "Speaks2", "Hyahyahya! That's right, lick, lick harder you pathetic losing Hero!♥",
                      					"ChangeImageLayer", "Base", "6", "BaseBlush",
                                "You redouble your pussy-eating efforts, desperate to draw air, almost not noticing as you erupt powerfully with a load of thick spunk, flooding another womb before getting gobbled up by a different pussy.",
                                "The Nereid on top of your face is riding it with wild abandon, her wildly spasming pussy feeling like it's about to tear off your desperately licking tongue. Finally she howls loudly, splattering your face with pussy juice as she shivers from a back-arching orgasm, lifting herself off you face and letting you breathe.",
                    						"ChangeImageLayer", "Base", "2", "Base",
                    						"ChangeImageLayer", "Expression", "2", "Snooze",
                                "The horny Nereid falls off your face, plopping weakly unto the sand next to you, and seems to fall asleep on the spot.",
                                "Your vision is clear for a moment and you see a couple of Nereids sucking affectionately on your niples, and a big bubble butt bouncing on your dick up and down, splattering pussy juice everywhere. The image is too erotic and your dick explodes again, pumping a third womb full of semen.",
                    						"ChangeImageLayer", "Base", "5", "BaseBlush",
                    						"ChangeImageLayer", "Expression", "5", "Calm Blush",
                                "One of the fish girls leans over you, obscuring the view again. She is smiling softly down on you, patting your head encouragingly, as you feel the Nereids switching over your dick again.",
                    						"ChangeImageLayer", "Base", "1", "BaseBlush",
                    						"ChangeImageLayer", "Expression", "1", "Hurt",
                                "Speaks", "Hey, you already had your fill!",
                                "Speaks3", "Oh shut up, he can keep going.",
                    						"ChangeImageLayer", "Expression", "1", "Calm Blush",
                                "You start feeling helpless, cursing your insatiable dick for trying to sate the insatiable water nymphs, feeling like your mind might break before your dick goes down. As if sensing your desperation, the Nereid patting you coos softly, trying to chase away your concerns.",
                                "Speaks5", "There, there, good boy.♥ You're doing great, you even made one of us cum. Good boy...♥",
                                "You moan weakly, taken aback by the sudden affection and a thoroughly creampied pussy bouncing wildly in your lap again. The affectionate Nereid pets and strokes your hair gently, drawing your attention back to her gentle affection.",
                                "Speaks5", "Shh, it's okay, it's okay. Here, kiss me...♥",
                                "She kisses you tenderly, her lips peppering your face with gentle, affectionate smooches as she keeps patting your head with her webbed hand.",
                                "Despite the tender affections of this Nereid, the pussy currently squeezing your painfully hard erection is riding you harder than any before, mashing into your pelvis with wild abandon. Your quiet whine of desperation is muffled by another gentle kiss, as the Nereid whispers gentle reassuring words to you.",
                                "Finally you cum again, filling this wild pussy a second time, a huge load of your semen escaping her pussy and splashing around your dick wetly, as her insides can't fit two of your loads.",
                    						"ChangeImageLayer", "Base", "3", "Base",
                    						"ChangeImageLayer", "Expression", "3", "Snooze",
                                "Your dick finally goes limp as the greedy Nereid pulls it out from her over-filled pussy. The fish women slowly retreat, some stretching out on the sand next to you and falling asleep, leaving just the tenderly affectionate Nereid to stroke your face.",
                                "Speaks5", "Good job...♥ You did you best and creampied them all.♥",
                                "Speaks5", "But... I am still empty... Can you go for one more? It's okay if you can't... But I would love to get a share as well.♥",
                                "Your dick rises to attention instantly, eager to thank the nice Nereid for her affection. She giggles softly and lies on top of you, her flat and slick body presed tightly against yours.",
                                "Speaks5", "Thank you.♥",
                                "She kisses you softly again, gently aligning her pussy over your dick, preparing for insertion.",
                                "Speaks4", "Hehe, she really likes him.♥",
                                "The Nereids that haven't fallen asleep plop down on their asses and watch. You also catch a glimpse of Cetuspeanna, who seems to be looking away shyly from the lewdly affectionate spectacle.",
                                "Speaks5", "Hug me?♥",
                                "You oblige, wrapping your arms around your loving partner and she smiles happily. The loving Nereid slides down gently, pushing your dick inside her welcoming, smooth pussy with a pleasured sigh.",
                                "You both lay there motionless for a moment, enjoying each other's embrace and intimate coupling. Balls-deep inside the lovingly soft and warm fish pussy you feel relaxed and content.",
                                "Speaks5", "I know you're sore and tired, so...♥ I'll squeeze it out without moving too much.♥",
                                "The walls of her unmoving pussy begin to pulsate around your dick gently, offering a gentle stimulation, full of care and affection. You gasp in delight, your body shivering from the loving treatment.",
                                "The Nereid kisses you again, her soft lips joining yours in a passionate display of love. Your lover moans happily and the other Nereids cheer in approval.",
                                "The gentle cuddlefuck is intoxicatingly sweet and erotic, and soon your dick throbs with desire again, eager to reward the gently-squeezing pussy with a hot load of cum. The Nereid gasps from the powerful throbbing, anticipating your orgasm with a gleeful face.",
                                "Speaks5", "Ahh, thank you, darling... Fill me...♥",
                                "You moan and orgasm one more time, eager to make the last Nereid happy, to thank her for her support.",
                                "A long, drawn out ejaculation slowly fills the lovable Nereid, spurt after spurt of hot cum filling out her welcoming womb, as she wiggles her butt in delight, tail swishing to the sides.",
                                "Having given all you can to your lover you simply lie there, submerged in sublime bliss from the final, gentle orgasm. Then you begin to fade away slowly, completely spent.",
                                "Speaks5", "Ahh, thank you...♥ And come see us again sometime, darling.♥",
                                "ChangeFetish", "Kissing", "5",
                                "ChangeFetish", "Sex", "10",
                                "ChangeSensitivity", "Sex", "5",
                                "ChangeSensitivity", "Mouth", "3",
                                "ChangeSensitivity", "Breasts", "3",
                                "GameOver"
                          ]
                  },
                  {
                    "NameOfScene": "LoveydoveySex",
                    "theScene": [
                      "DisplayCharacters", "6", "EndLoop",
          						"ChangeImageLayer", "Base", "1", "Base",
          						"ChangeImageLayer", "BodyPart", "1", "ArmsRest",
          						"ChangeImageLayer", "Magic", "1", "MagicNone",
          						"ChangeImageLayer", "Expression", "1", "SoftSmile",
                      "Completely spent by the playful fight you fall backwards, pulling your laughing lover down with you. As soon as your bodies touch the soft sands, Cetuspeanna pulls you closer, wrapping you up in a tender embrace, and plants a loving kiss on your forehead.",
                      "You murmur and nuzzle affectionately against her larger body, doing your best to wrap your arms around her in turn. The dragoness coos delightedly and wiggles her hips against you, causing her soft stomach to rub against your semi-hard cock.",
                      "It springs to attention quickly, seemingly forgetting about the exhaustion. Cetuspeanna kisses you again before suddenly rolling to the side, trapping you beneath herself. You wiggle a little, your arousal intermixing with some worry as you find yourself in such a vulnerable position.",
          						"ChangeImageLayer", "Expression", "1", "MildlyAroused",
                      "Speaks6", "Now now, don't struggle.♥ I don't often get you all tired out and cute...♥",
                      "Still keeping you trapped beneath herself, the serpentine woman unwraps her arms from you and rests them on the sand to the sides from your chest.",
          						"ChangeImageLayer", "Expression", "1", "ShySmile",
                      "Speaks6", "H-hey, let's hold hands...",
                      "You nod and oblige, moving your arms from her torso and blindly searching for her hands with your own.",
          						"ChangeImageLayer", "Base", "1", "BaseFlush",
          						"ChangeImageLayer", "Expression", "1", "Happy",
                      "Right as your hands finally touch, she shifts upwards and slips your already hard cock inside the velvety canal of her pussy. Sighing in pleasure, she also muffles your own gasp with her large chest, as it comes to rest on your face.",
          						"ChangeImageLayer", "Expression", "1", "Panic",
                      "Speaks6", "Ah... I wish I could kiss you right now, but I am too big...",
          						"ChangeImageLayer", "Base", "1", "BaseBlush",
          						"ChangeImageLayer", "Expression", "1", "HappyLewd",
                      "Thrusting upwards into her receptive, clingy pussy, you sweep away her concerns by causing her to let out a happy moan. Cetuspeanna squeezes your hands lovingly as her pussy begins to milk your shaft in response. She wiggles her hips playfully, still not moving much herself, but her drooling pussy shamelessly betrays her excitement.",
                      "You thrust up again, fighting against her incredible weight pinning you down, eliciting another sweet moan from the large dragoness.",
          						"ChangeImageLayer", "Expression", "1", "MildlyAroused",
                      "Speaks6", "Oh no, no, you're not going to make me lose control this time.♥",
                      "Slowly thrusting her hips forward, she methodically squeezes your cock with her skilled pussy muscles, displaying an uncharacteristic amount of control over herself. Your cock is already throbbing with need, leaking large droplets of precum inside her tight snatch.",
                      "Speaks6", "See? Cetty is- ah...! in charge this time.♥ I won't lose my chance to have sex at my own pace.♥",
                      "The dragoness slowly begins bouncing her large, serpentine hips, seemingly doing her best to hold back her moans. Most of your vision dominated by her soft bosom, you can only hear loud plapping noises echoing through the underwater cavern as her indecently drooling crotch meets yours.",
                      "Exhausted from the fight, you can only accept your submissive position and nuzzle affectiontely against her soft titties. Cetty coos in pleasure and slows down a little, switching to a gentler pace. You squeeze her hands lovingly and realize you're about to cum already, the sudden change to affectionate love-making being too much.",
          						"ChangeImageLayer", "Expression", "1", "HappyLewd",
                      "With your moan muffled by her tits you start cumming, filling her tight dragon pussy with your thick cum. She coos and giggles happily, slowly mashing her wide hips against yours as you're spraying your load inside her.",
                      "Speaks6", "Mmmh...♥ So cute...♥",
                      "As your orgasm subsides, you slump down weakly, getting completely smothered by the soft dragon lady. She stops moving her hips, but her pussy clamps down on your cock harder than before, forcing you to let out a helpless gasp.",
                      "Speaks6", "No, no.♥ This time you cum more for Cetty.♥",
                      "You moan incoherently and do as she says, cumming again, unable to withstand the intense pressure on your exhausted, over-sensitive dick. More spurts of sticky seed shoot out of your cock, eager to fill her warm insides to the brim just as she demands.",
                      "Speaks6", "Good, good.♥ Cum and keep cumming.♥ All your wonderful, tasty cum is mine.♥",
                      "You cum yet again, readily and delightedly, all your thoughts focusing on filling up your dragon lover and meeting her demands. She starts thrusting her hips again, drawing out a small spurt of cum from your loose dick every time her soft pussy smacks against your crotch.",
                      "Your eyes roll back from the repeated orgasms, the world growing dim as you ineffectually shake your hips and spill cum everywhere beneath her...",
                      "ChangeFetish", "Sex", "10",
                      "ChangeSensitivity", "Sex", "5",
                      "JumpToEventThenScene", "Dragon Palace", "CetuspeannaLostSparLover"
                    ]
                  }
                ]
}
